{"class_name":"Model","config":{"name":"model_1","layers":[{"name":"input_1","class_name":"InputLayer","config":{"batch_input_shape":["None",100,18],"sparse":false,"name":"input_1"},"inbound_nodes":[]},{"name":"mask","class_name":"Masking","config":{"name":"mask","mask_value":-999},"inbound_nodes":[[["input_1",0,0,{}]]]},{"name":"td_dense0","class_name":"TimeDistributed","config":{"name":"td_dense0","layer":{"class_name":"Dense","config":{"name":"dense_1","units":24,"activation":"relu","use_bias":true,"kernel_tensor":[-0.041933704167604446,-0.0450642853975296,0.2545410692691803,-0.6096524000167847,0.24801793694496155,0.22875060141086578,-0.08060676604509354,0.07069322466850281,0.01999286562204361,-1.2770843505859375,0.34289947152137756,0.4198371469974518,-0.06806064397096634,-0.03362399712204933,-0.11315375566482544,-0.013873289339244366,-0.07627739757299423,-0.020296134054660797,-1.0883917808532715,-0.01529446430504322,-0.333723783493042,-0.21271856129169464,-0.2970748543739319,-0.02853870391845703,0.19179274141788483,0.064562126994133,0.29427340626716614,-0.952991783618927,-0.5407268404960632,0.01994278095662594,-0.01520035695284605,0.4437684118747711,0.06955764442682266,-0.9964418411254883,0.10345806926488876,-0.039898935705423355,0.26535603404045105,-0.11022114753723145,-0.4853074848651886,0.030892254784703255,0.37423479557037354,-0.18514449894428253,0.14001336693763733,0.09378980845212936,0.11761587858200073,1.5730799436569214,0.015035165473818779,0.18934625387191772,0.22594071924686432,-0.2970666289329529,-0.33798468112945557,0.3717057704925537,-0.30575457215309143,-0.01882025972008705,0.005127707961946726,0.016029732301831245,0.017625726759433746,0.033490877598524094,0.07736874371767044,0.02050432190299034,-0.24874567985534668,0.15583324432373047,-0.012000253424048424,2.5557057857513428,0.12985512614250183,0.020291540771722794,-0.05818182975053787,0.04401176795363426,-2.790093421936035,-0.028848940506577492,-0.017012303695082664,0.11545789986848831,0.3380413353443146,-0.03321366384625435,0.1894437074661255,0.05736672133207321,-0.31140968203544617,-0.11589203029870987,0.11592725664377213,0.1393577754497528,-0.04802928492426872,0.6642811298370361,1.5833488702774048,0.016244960948824883,-0.06570695340633392,-0.3204285204410553,-0.06620659679174423,0.7596204876899719,0.07802895456552505,0.14445188641548157,-0.9723688960075378,0.09536048769950867,-0.24282000958919525,0.0003495228593237698,-0.31898730993270874,0.12363220006227493,0.03803865239024162,-0.14031857252120972,-0.06710777431726456,-0.0022210711613297462,-2.5377376079559326,0.12080209702253342,0.007778973784297705,0.06099940091371536,-0.6203835010528564,0.1388085037469864,-0.0070935809053480625,0.01965692639350891,-0.2395804077386856,0.07522311061620712,-0.07060431689023972,0.10403656959533691,0.09558738768100739,0.11418277770280838,0.11415882408618927,0.21592114865779877,-0.02469819225370884,0.40631103515625,0.5471925139427185,0.008032683283090591,0.02133352868258953,0.11619284003973007,-0.030252089723944664,0.9945917725563049,-0.09719927608966827,0.07073157280683517,-0.3312123417854309,0.05434422567486763,0.06835412979125977,0.07207953184843063,0.05369258299469948,0.07934050261974335,0.17692238092422485,0.0490129329264164,-0.12718427181243896,-0.34800755977630615,-0.464350163936615,-0.04530715197324753,0.031061111018061638,0.21571038663387299,-0.16869919002056122,-1.516994833946228,0.0003164702211506665,0.1761077642440796,-0.3905332088470459,-0.0011176400585100055,-0.0090615414083004,-0.26703691482543945,-0.01847630925476551,-0.010631241835653782,0.0039065079763531685,0.004294713027775288,-0.017009185627102852,0.5535858273506165,0.7795913219451904,-0.010592104867100716,0.007549821864813566,0.009053753688931465,-0.006442399229854345,1.6025967597961426,0.011632150039076805,0.008669908158481121,-0.11481855064630508,-0.8244845271110535,0.15420733392238617,0.5765800476074219,-0.04875238984823227,0.05860535427927971,0.10324709117412567,0.04243374243378639,0.16644078493118286,-0.09255589544773102,0.6459987163543701,0.4880147874355316,0.1112503856420517,0.23043052852153778,-0.08509964495897293,0.09538351744413376,-0.011902738362550735,-0.0305948406457901,0.36238425970077515,-0.29085373878479004,0.18940556049346924,0.6710430383682251,-0.2816206216812134,-0.19445478916168213,-0.12816347181797028,-0.06440359354019165,-0.05378926545381546,-0.541972815990448,-0.053828611969947815,0.05547404661774635,-0.12502555549144745,-0.10770326852798462,0.37596434354782104,0.14591024816036224,-0.1544293463230133,0.055389463901519775,-0.0009032814996317029,-0.053466059267520905,-0.2093362957239151,0.02771579474210739,0.15297727286815643,-0.03259160369634628,-0.00932475458830595,0.0190674290060997,-0.21988528966903687,1.622515082359314,0.20725856721401215,-0.018776051700115204,0.053330324590206146,0.1531732678413391,0.7245887517929077,0.04212813824415207,-0.017709465697407722,0.10085319727659225,-0.0018267795676365495,0.04120025038719177,-0.09437072277069092,-0.008970396593213081,-0.09202293306589127,0.059373289346694946,0.13212308287620544,0.04449844732880592,0.5774384140968323,0.48521721363067627,0.6030462384223938,0.03551193326711655,0.2779112756252289,-0.11258542537689209,-0.7865198850631714,0.01510427426546812,-0.33041101694107056,0.08124437928199768,0.0121727604418993,-0.08202755451202393,0.12390638887882233,-0.12338263541460037,-0.1318768560886383,-0.2011663317680359,-0.07312530279159546,0.1535302847623825,1.3475061655044556,0.7522473931312561,0.3225577175617218,0.04819387197494507,-0.2198895812034607,-0.15569691359996796,0.17336660623550415,0.11383518576622009,0.05655834078788757,-0.11195310950279236,0.08656466752290726,-0.09356647729873657,0.03420262038707733,-0.12958835065364838,-0.1414606273174286,-0.1685154289007187,0.09248575568199158,0.05833142250776291,-0.007022992707788944,-2.704289436340332,-2.331209897994995,0.2668740153312683,-0.05148188769817352,0.1600366234779358,-0.12961596250534058,-0.038187578320503235,-0.045952122658491135,-0.021073918789625168,-0.149587482213974,0.04465143382549286,0.45171257853507996,-0.031704843044281006,-0.08860611170530319,-0.06493333727121353,0.05596058815717697,0.20477840304374695,-0.1035650372505188,2.666490316390991,2.7958927154541016,0.2298605591058731,-0.009832020848989487,0.10365577042102814,0.1233820989727974,-0.033539000898599625,-0.06350351870059967,-0.01253973413258791,0.03390152007341385,0.0029813586734235287,0.6703651547431946,-0.07189814746379852,0.020475897938013077,-0.09863366186618805,-0.20042192935943604,-0.07524705678224564,0.02451198548078537,0.21409796178340912,-0.36039596796035767,0.015347030945122242,-0.021281400695443153,-0.47318586707115173,0.016452006995677948,-0.09007221460342407,0.11047840118408203,0.17259694635868073,-0.017100967466831207,0.189049631357193,0.059995733201503754,0.040062401443719864,0.0952286422252655,0.09749297797679901,-0.08503783494234085,0.3559100925922394,0.11522258073091507,-0.05514240637421608,-3.0397534370422363,0.013933666050434113,0.03017662838101387,0.06136193498969078,0.9420926570892334,-0.04805893450975418,0.16073931753635406,0.33462175726890564,-0.022582361474633217,-0.09739124029874802,0.0527564212679863,-0.0385899618268013,-0.012274952605366707,-0.17020417749881744,0.28354766964912415,-1.238486886024475,0.037336789071559906,0.6735600233078003,-2.2336459159851074,0.04625590890645981,-0.1824786216020584,0.07550349086523056,0.5559324026107788,0.18560726940631866,-0.14686423540115356,0.149067223072052,0.3325968086719513,-0.04097449406981468,0.005720963701605797,0.11969515681266785,0.006953171454370022,0.0784280076622963,-0.1099424883723259,0.37255769968032837,0.0669674426317215,-0.8901587128639221,0.015399700030684471,0.10490722209215164,-0.09437554329633713,-0.6294976472854614,0.32251814007759094,-1.4527723789215088,0.08416317403316498,-0.022692885249853134,0.3502318263053894,0.1464262455701828,0.265182763338089,-0.013176714070141315,-0.21513594686985016,-0.021435799077153206,0.2815379202365875,-1.0857211351394653,-0.049189742654561996,-2.2927863597869873,0.543256402015686,-0.0859580785036087,0.11603017896413803,0.1605987548828125,-0.540471076965332,-0.0011388355633243918,0.11247044056653976,-0.15085674822330475,-0.014463682658970356,0.002297711092978716,0.04249515011906624,-0.001648344681598246,0.005517904181033373,0.020593103021383286,0.0016566765261813998,-0.013954241760075092,-0.001992064295336604,-5.174863815307617,-3.853959560394287,0.004759112372994423,0.003479036968201399,-0.01583060622215271,0.0051444824784994125,0.005337545648217201,0.0013138353824615479,0.006417338270694017,0.016952170059084892,0.4632728099822998,-0.15214316546916962,0.1508559137582779,0.7516385316848755,0.22013336420059204,0.26617246866226196,-0.004502075724303722,0.02642778679728508,1.9844081401824951,0.18050463497638702,0.09697553515434265,-0.3167714774608612,-0.12850342690944672,-0.5528959035873413,-0.09929265081882477,0.08239275217056274,-0.5264552235603333,-0.17022158205509186,0.06900829821825027,0.12823645770549774,-0.05321504920721054,0.026064224541187286,0.016525674611330032,-0.03053745999932289,0.45109695196151733,-0.3459068536758423,-3.0315825939178467,-1.5411125421524048,-0.02207012288272381,0.013057401403784752,-0.21361684799194336,-0.18901096284389496,-0.03286614269018173,0.009570853784680367,-0.059190575033426285],"bias_tensor":[0.830976665019989,-0.2928543984889984,-0.2879481911659241,-0.38854557275772095,0.7565054297447205,0.17372292280197144,0.7377123236656189,-0.4820258319377899,0.7171356081962585,-0.3991941511631012,-0.5580679178237915,0.6976279616355896,0.3171035349369049,-0.04052019491791725,-0.7946516871452332,0.8384169936180115,0.14221851527690887,-0.07541587203741074,0.37797921895980835,-0.5082617998123169,-0.12352149188518524,-1.1924059391021729,0.07712000608444214,-0.017593665048480034],"feature_scaling":[{"name":"B_IFT_OSMuonDev_TagPartsFeature_Tr_T_PROBNNe","offset":0.028123268857598305,"scale":0.13705119490623474},{"name":"B_IFT_OSMuonDev_TagPartsFeature_Tr_T_PROBNNghost","offset":0.12149450182914734,"scale":0.23996014893054962},{"name":"B_IFT_OSMuonDev_TagPartsFeature_Tr_T_PROBNNk","offset":0.14964638650417328,"scale":0.26349830627441406},{"name":"B_IFT_OSMuonDev_TagPartsFeature_Tr_T_PROBNNmu","offset":-0.7986099720001221,"scale":0.41691336035728455},{"name":"B_IFT_OSMuonDev_TagPartsFeature_Tr_T_PROBNNp","offset":0.1111789271235466,"scale":0.22657831013202667},{"name":"B_IFT_OSMuonDev_TagPartsFeature_Tr_T_PROBNNpi","offset":0.6722174882888794,"scale":0.3515162467956543},{"name":"B_IFT_OSMuonDev_TagPartsFeature_Tr_T_P","offset":11855.3896484375,"scale":15391.771484375},{"name":"B_IFT_OSMuonDev_TagPartsFeature_Tr_T_PT","offset":673.6062622070312,"scale":661.4232177734375},{"name":"B_IFT_OSMuonDev_TagPartsFeature_Tr_T_Charge","offset":0.008345737121999264,"scale":0.9999651312828064},{"name":"B_IFT_OSMuonDev_TagPartsFeature_Tr_T_BPVIP","offset":1.371565580368042,"scale":6.349822521209717},{"name":"B_IFT_OSMuonDev_TagPartsFeature_Tr_T_BPVIPCHI2","offset":830.6148681640625,"scale":11913.82421875},{"name":"B_IFT_OSMuonDev_TagPartsFeature_Tr_T_SumBDT_ult","offset":-53.26155090332031,"scale":26.827566146850586},{"name":"B_IFT_OSMuonDev_TagPartsFeature_Tr_T_VeloCharge","offset":0.9711280465126038,"scale":0.13890254497528076},{"name":"B_IFT_OSMuonDev_TagPartsFeature_Tr_T_IP_trMother","offset":2.815931797027588,"scale":6.69918155670166},{"name":"B_IFT_OSMuonDev_TagPartsFeature_diff_z","offset":9.381742477416992,"scale":76.19425964355469},{"name":"B_IFT_OSMuonDev_TagPartsFeature_P_proj","offset":11958703.0,"scale":19928662.0},{"name":"B_IFT_OSMuonDev_TagPartsFeature_cos_diff_phi","offset":-0.0452224500477314,"scale":0.7113487124443054},{"name":"B_IFT_OSMuonDev_TagPartsFeature_diff_eta","offset":-0.020097680389881134,"scale":1.0171055793762207}]}}},"inbound_nodes":[[["mask",0,0,{}]]]},{"name":"td_dense1","class_name":"TimeDistributed","config":{"name":"td_dense1","layer":{"class_name":"Dense","config":{"name":"dense_2","units":24,"activation":"relu","use_bias":true,"kernel_tensor":[0.28893932700157166,-0.19355225563049316,-0.357132226228714,-0.5740061402320862,-0.8173379302024841,0.018834274262189865,0.3848564922809601,-0.05694214627146721,-0.42016398906707764,-0.31605419516563416,0.3069774806499481,-0.10049275308847427,-0.6397303938865662,-0.13512618839740753,0.5495406985282898,-0.05893589183688164,0.16587813198566437,-0.46013563871383667,0.6156657338142395,-0.8765249252319336,-0.12232419103384018,-0.07358019053936005,-1.495615839958191,-0.6378886699676514,-0.11392514407634735,0.12647759914398193,0.37687352299690247,-0.021955398842692375,-1.0473867654800415,0.1125093325972557,-1.284170389175415,0.6434748768806458,0.8594452142715454,-0.12849318981170654,-0.1241973266005516,-0.11369835585355759,-0.01413364615291357,-0.13247138261795044,-0.08351024240255356,-0.7508436441421509,0.24645525217056274,-0.2242295891046524,0.2381647229194641,1.075771450996399,0.6359128355979919,-0.08166996389627457,-0.08376947790384293,-0.06474968791007996,-0.2812718451023102,0.3587256968021393,-0.18826907873153687,0.011119894683361053,-0.32410845160484314,-0.2439962923526764,0.30336129665374756,-0.2810603976249695,0.055779021233320236,0.12651923298835754,-0.6293461322784424,-0.8714512586593628,0.5255871415138245,0.31257808208465576,-0.04356566071510315,-0.16313433647155762,-0.24589574337005615,0.3881281912326813,-0.5916171669960022,0.377697616815567,-0.482486367225647,1.4724351167678833,0.09820705652236938,0.13005736470222473,-0.007475594058632851,0.1420494168996811,-0.3645516335964203,-0.11297203600406647,-0.2695150077342987,-0.0351366363465786,-0.865209698677063,0.8093377351760864,-5.782750606536865,-0.025111882016062737,-0.027133377268910408,-0.3660416007041931,0.3226774036884308,0.2511756718158722,0.18206749856472015,0.01905396766960621,-0.07016274333000183,0.03621704876422882,-0.07553702592849731,0.523789644241333,0.04054722189903259,0.6030099391937256,-0.13783615827560425,0.07347330451011658,0.46778833866119385,-0.4018407166004181,-0.08916956931352615,-0.21046848595142365,0.41879579424858093,0.034116096794605255,0.31790003180503845,-0.06665316224098206,-0.4547092914581299,0.24616727232933044,0.21158276498317719,-0.1323075145483017,0.041573990136384964,0.3363271951675415,0.27869144082069397,0.08953435719013214,-0.21070197224617004,-0.008510192856192589,-0.13052873313426971,0.3719003200531006,-0.2172997146844864,-0.8291863799095154,0.4306432008743286,0.06201794743537903,0.14614246785640717,-0.2982832193374634,-0.14005635678768158,-0.10270659625530243,-0.10935866087675095,0.014302556402981281,0.37953469157218933,-0.044848233461380005,-0.07866115123033524,-0.10389462858438492,0.11292654275894165,0.4717976748943329,0.18334095180034637,0.33826538920402527,-0.3355242908000946,-0.17244531214237213,0.29846465587615967,0.01628021150827408,-0.18278750777244568,0.08104417473077774,0.2034807652235031,-0.27905333042144775,0.11330991983413696,-0.40802714228630066,-0.16530904173851013,-0.04644649103283882,-0.061376530677080154,-0.12489306926727295,-0.20329734683036804,-0.17750294506549835,0.02639969252049923,-0.1358017474412918,0.11217713356018066,-0.0005382017698138952,0.03224317356944084,-0.14161162078380585,0.02510894276201725,0.02245328202843666,0.4208250939846039,-0.40279847383499146,0.02615225315093994,-0.023749982938170433,0.18060855567455292,0.03667435422539711,-0.06672106683254242,5.195499897003174,-0.018650619313120842,0.2976749539375305,0.044736701995134354,0.20543664693832397,0.3474346697330475,-0.11800665408372879,-0.24687543511390686,-0.03143405169248581,-0.5954171419143677,0.28057777881622314,-6.540890216827393,0.08421918004751205,0.060283225029706955,0.005790472961962223,-0.06821572035551071,-0.06424028426408768,0.12208861112594604,-0.25651684403419495,-0.11568297445774078,0.016706250607967377,0.05590646713972092,0.026203405112028122,-0.1317138522863388,0.5035629272460938,0.17169782519340515,0.40104252099990845,0.0944366306066513,-0.045280877500772476,-0.4744807779788971,-0.4028280973434448,0.23448386788368225,0.03819630667567253,0.016758454963564873,-0.030180372297763824,0.013057399541139603,-0.152970552444458,0.3545353412628174,0.1750958263874054,-0.46161308884620667,-0.28535187244415283,0.46447136998176575,-0.37550151348114014,0.0609816312789917,-0.3889468014240265,0.07076915353536606,-0.23312921822071075,0.07327096164226532,1.5389175415039062,-0.16709983348846436,0.5765529870986938,0.1609901487827301,-0.006522194016724825,0.6008633971214294,-0.01474662497639656,-0.8092390894889832,-0.6189330816268921,0.37191829085350037,-0.38389647006988525,0.11499771475791931,-0.7339687347412109,0.5558975338935852,0.6949093341827393,-1.302531123161316,0.038846880197525024,-0.7542012333869934,-0.21241897344589233,-0.12521032989025116,0.7924501895904541,-0.3329237103462219,0.2478354275226593,0.1896536648273468,-1.165875792503357,0.47820693254470825,-0.3024689853191376,0.0012427280889824033,0.4434870779514313,-0.8189529180526733,-0.07291421294212341,-0.23526185750961304,0.15606021881103516,-0.42080244421958923,0.2638827860355377,-0.3077211081981659,0.09994933754205704,0.05430395528674126,0.11615405976772308,0.07408691942691803,0.10915786027908325,0.3760213553905487,-0.19088540971279144,-0.5218117237091064,-0.002242711838334799,-0.04532001540064812,0.25314775109291077,0.08611570298671722,1.3114010095596313,-0.19850873947143555,0.5569595694541931,0.009678777307271957,-0.6498499512672424,-0.8310341835021973,-0.02096187323331833,0.3791346549987793,0.16247659921646118,-0.3070993721485138,-0.07401251792907715,-0.052870362997055054,-0.09087373316287994,0.08683567494153976,-0.1283530741930008,0.06320298463106155,-0.04404503107070923,0.18915057182312012,0.23932693898677826,-0.44381698966026306,-1.0215502977371216,-0.29481828212738037,-0.4049198627471924,-0.05781222879886627,0.6554304361343384,-0.2063039243221283,0.360867977142334,-0.16655677556991577,0.19442816078662872,-0.9271357655525208,0.23229193687438965,-0.2693348824977875,-0.3835509121417999,-0.15364119410514832,0.33843109011650085,0.32164815068244934,-0.6583171486854553,0.5689253211021423,0.46611151099205017,0.1703128069639206,-0.4196633994579315,0.21534661948680878,-0.10234904289245605,0.2819213271141052,0.11318083107471466,0.12154309451580048,-0.00616853591054678,0.3849589228630066,0.3735109269618988,0.18298567831516266,-0.44643762707710266,-0.6454105973243713,-0.12099821120500565,0.014367382042109966,-0.17452387511730194,-0.42764192819595337,-0.39008814096450806,0.0026771719567477703,0.2996463179588318,0.10215307027101517,-0.46169590950012207,0.1661602407693863,-0.2129073143005371,0.15581239759922028,0.3424559533596039,-0.4587765336036682,0.32363930344581604,0.5328243374824524,-0.4891924262046814,-0.418825626373291,0.8286897540092468,0.21929699182510376,0.2762361168861389,0.20497910678386688,0.20261883735656738,-0.05732647702097893,-0.23338532447814941,0.29157841205596924,0.13547232747077942,0.021674981340765953,0.17710378766059875,0.11723734438419342,0.040353089570999146,-0.15522177517414093,0.11296164989471436,0.10790839046239853,0.2427210956811905,-0.4073829650878906,-0.35497912764549255,0.45698654651641846,0.2102930247783661,0.10250426828861237,-0.03545771539211273,-0.005197849590331316,-0.18015636503696442,-0.4507763087749481,-1.856165885925293,-0.039663948118686676,0.06733918190002441,-0.5527695417404175,-0.4351668357849121,-0.11779112368822098,0.34677720069885254,0.14788471162319183,-0.545099139213562,0.19276264309883118,-0.007864106446504593,-0.10608690232038498,0.1395362764596939,-0.573451817035675,0.09941944479942322,-0.39090681076049805,0.29462483525276184,-0.294071763753891,0.629801869392395,0.15947005152702332,0.2552836835384369,-0.46079006791114807,-0.30824512243270874,-0.35283735394477844,1.5347875356674194,0.45478248596191406,-0.2083672285079956,0.3015839159488678,-0.12167617678642273,-0.1829114407300949,-0.575376033782959,0.28867366909980774,-0.5817059278488159,0.20775452256202698,-0.291135311126709,-0.12913043797016144,0.4688069224357605,-0.1680143028497696,-0.04560057446360588,0.06203663721680641,0.39115267992019653,0.4198310077190399,-0.11462175846099854,0.40536242723464966,0.11635852605104446,-0.1544313132762909,-0.14247767627239227,-0.5196534991264343,-2.610539436340332,-0.14652559161186218,-0.14301186800003052,0.38251903653144836,-0.396883100271225,-0.3803595304489136,-0.7310239672660828,0.4041694402694702,-0.6013648509979248,0.09724197536706924,-0.0012397048994898796,-0.013331976719200611,0.25444266200065613,0.03431046009063721,-0.034687258303165436,-0.28863289952278137,-0.682724118232727,-0.11950507760047913,0.3212260603904724,0.37679755687713623,-0.3372895419597626,0.05606856197118759,0.13590916991233826,-0.31079965829849243,-1.6289632320404053,0.024393532425165176,0.1286848932504654,0.21706624329090118,0.03814806789159775,-0.16419970989227295,-0.5058849453926086,0.33169105648994446,-0.3592105507850647,0.30475297570228577,-0.06147098168730736,-0.03483295813202858,-0.1864214390516281,0.12126246094703674,0.1740889549255371,0.18555986881256104,-0.06502153724431992,-0.20722196996212006,0.18105342984199524,-0.04084015265107155,-0.3322591483592987,-0.07880818843841553,0.07399006932973862,-0.23884978890419006,-2.6459784507751465,-0.4648968279361725,-0.17111600935459137,-0.09497543424367905,-0.3569676876068115,0.10418324172496796,-0.3568034768104553,-0.05457823723554611,0.11729319393634796,-0.5045291781425476,0.01467590406537056,0.10514679551124573,0.11384613066911697,-0.1251823455095291,-0.13075028359889984,-0.3641722798347473,0.08240186423063278,-0.029964983463287354,-0.43724972009658813,-0.18420979380607605,0.06696880608797073,-0.22666321694850922,-0.18774324655532837,-0.3846636116504669,0.1501053273677826,-0.16322574019432068,-0.147195503115654,-0.06883156299591064,0.15690036118030548,-0.06259220093488693,0.09103181958198547,-0.24895624816417694,0.02041853405535221,0.00780413718894124,0.008701945655047894,0.3432658016681671,-0.05062965303659439,0.19008350372314453,0.046101219952106476,0.2646680474281311,-0.017444411292672157,-0.03703465685248375,0.18964697420597076,0.1329505294561386,-0.07049320638179779,0.6540954113006592,-0.2613827586174011,0.18881751596927643,0.36402443051338196,0.10563056915998459,-0.3942852020263672,0.24809420108795166,-0.4220453202724457,0.16731217503547668,-0.022992342710494995,0.20513761043548584,-0.08300108462572098,0.14136354625225067,0.01105043850839138,-0.002586619695648551,0.14805442094802856,0.3049217462539673,0.3878592550754547,-0.16188699007034302,-1.1629610061645508,-0.02284945547580719,-0.16164174675941467,-0.11437729001045227,0.1114860400557518,-0.13398177921772003,0.10316726565361023,-0.08114635944366455,0.6355561017990112,0.11842285841703415,0.5376381874084473,-0.43096262216567993,0.09462586790323257,-0.40053093433380127,0.5181814432144165,-0.039613910019397736,0.1491694301366806,0.04330290108919144,-0.04016280919313431,0.13422974944114685,-0.05308462306857109,-0.598476767539978,0.23719775676727295,0.018639396876096725,-0.39108479022979736,0.24826949834823608,0.3943326771259308,-0.24003739655017853,0.10198160260915756,-0.06432019174098969,-0.22728444635868073,-0.07690273225307465,1.2316030263900757,0.44291967153549194,0.1572069227695465,-0.14103850722312927,-0.31946444511413574,0.08124715089797974,-0.9697996973991394,0.11310368776321411,-0.7403242588043213,0.05698636174201965,0.20741327106952667,0.10170958191156387,0.5517396330833435,0.68708336353302,-0.4010557532310486,-0.07786228507757187,-0.2945305109024048,0.7346550226211548,-0.9438959956169128,-0.3386719524860382,0.09091156721115112,0.13447006046772003,0.07728029787540436,-0.08749084919691086,0.8977265357971191,0.17255361378192902,0.12551425397396088],"bias_tensor":[-0.1553855687379837,-0.1358318328857422,0.028500843793153763,-0.22338220477104187,-0.29895448684692383,0.636940062046051,-0.34457966685295105,-0.17390158772468567,-0.05663985759019852,-0.06955838948488235,-0.13082648813724518,0.20002400875091553,0.20652322471141815,0.04188290610909462,0.2639830708503723,0.41577455401420593,-0.19231291115283966,0.11215701699256897,0.32544639706611633,-0.11862388253211975,0.8601778149604797,-0.03879981487989426,0.32466772198677063,-0.728141188621521]}}},"inbound_nodes":[[["td_dense0",0,0,{}]]]},{"name":"td_dense2","class_name":"TimeDistributed","config":{"name":"td_dense2","layer":{"class_name":"Dense","config":{"name":"dense_3","units":24,"activation":"relu","use_bias":true,"kernel_tensor":[-0.7180970907211304,-0.1573380082845688,0.2718687355518341,-0.3656104505062103,0.19134081900119781,0.21806083619594574,-0.6810865998268127,-0.40838417410850525,-0.7556508779525757,-0.7632733583450317,0.8374738097190857,-0.5129116773605347,-0.17695671319961548,-0.2589785158634186,0.16833312809467316,-0.060565829277038574,0.45676010847091675,-0.36593249440193176,0.0223951768130064,0.28086820244789124,-0.07043270766735077,-0.5800879597663879,-1.087955117225647,0.12833550572395325,0.34587693214416504,0.60848468542099,-0.31101009249687195,-0.2905651032924652,0.2917143702507019,-0.06632355600595474,-1.1280826330184937,-0.5525885820388794,-0.16378851234912872,-0.8190909028053284,0.25152403116226196,-0.022431446239352226,0.019731318578124046,-0.4475276470184326,0.08429939299821854,-0.24636012315750122,0.5314282774925232,0.2718750536441803,-0.4103551506996155,0.2761758863925934,-0.04921886324882507,0.12715484201908112,-0.12965179979801178,0.2663327753543854,-1.1197859048843384,-0.26068949699401855,0.0003472047101240605,0.4041491746902466,0.38830843567848206,0.40037816762924194,0.36669689416885376,0.2805272936820984,0.0910552516579628,0.5697168111801147,-0.6371998190879822,-0.06116950884461403,0.22066329419612885,-0.1491384506225586,-0.32117602229118347,-0.10021240264177322,-0.34123972058296204,-0.5423687696456909,-0.12813159823417664,0.02102329023182392,-0.66292804479599,0.2527264356613159,-0.4867696464061737,0.8682055473327637,-0.03750305995345116,0.11732732504606247,-0.32513731718063354,-0.4164195954799652,0.21668395400047302,0.10810262709856033,1.3455020189285278,-0.48868468403816223,0.178519606590271,0.7111361622810364,-0.1355396807193756,-0.24629834294319153,-0.4540340006351471,-0.31420591473579407,-0.31998854875564575,0.15576261281967163,-0.01690048910677433,-0.13822565972805023,-0.34472379088401794,0.06716231256723404,0.4666878283023834,-0.07678365707397461,-0.20066095888614655,-0.09411028772592545,0.12266812473535538,-0.0747697576880455,0.23180565237998962,0.9693232178688049,0.06063675880432129,0.1875157654285431,0.07968254387378693,1.1016935110092163,-0.23332346975803375,-0.34911760687828064,0.29199641942977905,-0.3161701560020447,-0.41231489181518555,-0.37372368574142456,0.341966450214386,-1.0952060222625732,-0.4733349084854126,0.2637042701244354,-0.5448192954063416,0.19132913649082184,-0.04137837141752243,-0.8241990804672241,-0.46027055382728577,-0.3964568078517914,0.3007577061653137,0.049235232174396515,0.13297557830810547,0.3501494824886322,0.16739420592784882,0.3433385491371155,-1.6683287620544434,-0.5106774568557739,-0.8402308821678162,-0.12093857675790787,-0.026870589703321457,-0.7520043253898621,0.010002926923334599,0.19892553985118866,-0.5199998617172241,-0.6747084259986877,0.5345283150672913,-1.0039883852005005,0.08540204912424088,0.09570270031690598,-0.43070849776268005,0.24850885570049286,-0.35666558146476746,0.4857707917690277,-0.24390417337417603,0.008892265148460865,-0.773148775100708,-1.25188148021698,0.33121588826179504,-0.4766063988208771,-0.3268473744392395,-0.35129934549331665,0.14654763042926788,-1.2033518552780151,0.6456030011177063,-0.688217043876648,0.004160069394856691,-0.06636840105056763,-0.49078676104545593,-0.9774044156074524,-0.4739004373550415,0.5031200647354126,0.18766038119792938,0.02568378485739231,-0.19613568484783173,-0.1498798429965973,-0.4212266504764557,-0.41491052508354187,-0.20087701082229614,-0.2990051507949829,-0.41515257954597473,-0.8097575306892395,-0.7031054496765137,-0.5525493025779724,-1.2012470960617065,0.2028760462999344,-0.11669116467237473,0.22915297746658325,0.05606474354863167,0.4775703251361847,-0.3740012049674988,-0.4386335611343384,0.9073956608772278,-0.807811975479126,-0.3083820044994354,-0.5211238265037537,-0.6495735049247742,-0.07023652642965317,-0.285757839679718,0.13460773229599,0.5914844870567322,0.16190655529499054,-0.06800059229135513,-0.9967621564865112,0.30648180842399597,-0.003893826622515917,-0.048635367304086685,-0.0788421481847763,1.3081778287887573,-0.433430016040802,0.24518954753875732,-0.5477449297904968,0.5279815196990967,0.03229464963078499,0.23997052013874054,0.29266321659088135,-0.19439908862113953,-0.09226635098457336,-0.18080466985702515,0.0543813481926918,-0.7580059766769409,-0.1429862380027771,0.04455011337995529,0.16518479585647583,-0.20412862300872803,-0.122158944606781,-0.4902876615524292,-0.5942807793617249,0.2562618553638458,0.16468705236911774,0.35454922914505005,0.21543647348880768,-0.8086455464363098,0.5292892456054688,0.17447429895401,0.38851118087768555,-0.37447938323020935,-0.011506044305860996,-1.0750908851623535,0.2359347641468048,0.1280372440814972,-0.23183709383010864,0.6381407976150513,-0.22564850747585297,0.1942291408777237,-0.1154370903968811,0.0027759289368987083,-0.6881069540977478,-0.30185025930404663,-0.09595951437950134,-0.13175182044506073,-0.3142703175544739,0.4665891230106354,-0.5094515681266785,0.06443613022565842,-0.6425573229789734,0.5076438784599304,0.034122589975595474,0.5158364176750183,-0.854062557220459,0.4314050078392029,-0.03262872248888016,-0.4375941753387451,-0.21835152804851532,0.052965350449085236,-0.8727825284004211,-0.34238889813423157,0.084931381046772,-1.4915452003479004,-0.06857971101999283,-0.3912658989429474,0.13599665462970734,0.16731320321559906,0.017538461834192276,-0.15309743583202362,0.11747533082962036,0.33244919776916504,-0.5787514448165894,0.03705637529492378,0.3987163305282593,0.6237087249755859,-0.8459296226501465,0.1526503562927246,0.3785002529621124,-0.4052812457084656,0.12727688252925873,0.06066099554300308,-0.38608574867248535,0.2429380714893341,0.353084921836853,-0.42477747797966003,-0.18719319999217987,-0.3799899220466614,0.1276383399963379,0.23278602957725525,0.12225297093391418,0.21474458277225494,0.16716007888317108,-0.3341562747955322,-2.289569616317749,-0.0355568528175354,0.7173328399658203,0.16887266933918,-0.4610929489135742,0.22470031678676605,0.6596708297729492,0.09285338222980499,0.4385506510734558,0.1867600381374359,-0.8414238095283508,-0.028759069740772247,-0.1226491928100586,-0.6063292026519775,-0.6459729075431824,-0.3986213207244873,0.023522961884737015,-0.8559578657150269,0.07285995781421661,-0.5331987142562866,0.0036200028844177723,-0.16009646654129028,0.11983468383550644,0.029739944264292717,0.7202972769737244,-0.06549075245857239,0.19787952303886414,-0.46106842160224915,0.41441529989242554,0.27401262521743774,-0.017407234758138657,0.2673770487308502,0.1828315407037735,-0.2195087969303131,0.26480546593666077,0.25372955203056335,-0.18753111362457275,0.15448035299777985,0.06608530879020691,0.09109298884868622,-0.15001891553401947,-0.35243645310401917,0.26982179284095764,0.025741156190633774,-0.10194218158721924,0.03539970517158508,0.1521252691745758,0.07879532128572464,-0.1345788985490799,-0.048761364072561264,0.2751556634902954,0.18807843327522278,0.14953753352165222,-1.9772002696990967,-0.9041765332221985,0.031531304121017456,-0.06810595095157623,-0.0841764509677887,0.12074609100818634,-0.7181359529495239,0.3292474150657654,0.10624215751886368,-0.20394615828990936,0.42672741413116455,0.36800840497016907,0.19795085489749908,0.010797664523124695,-0.10600153356790543,-0.13512443006038666,-0.16208796203136444,-0.31627994775772095,0.5671027898788452,-0.11873973906040192,0.5237475037574768,0.47120022773742676,-0.29752016067504883,0.09780625998973846,1.0520931482315063,-1.1317332983016968,-0.28255319595336914,0.7689721584320068,-0.0032192906364798546,0.38466888666152954,0.003051607869565487,0.17309771478176117,-0.008507000282406807,0.293813019990921,-0.08816051483154297,-0.19707950949668884,0.07396583259105682,-0.1884768307209015,0.2053757756948471,-0.6792749762535095,-0.07722692936658859,0.310857892036438,0.13108061254024506,-0.5864371657371521,-0.22402772307395935,-2.9912264347076416,0.0036860546097159386,-0.40399548411369324,1.3147740364074707,-1.1373478174209595,0.37436938285827637,0.1536322683095932,-0.16164475679397583,-0.04621625319123268,-0.16947171092033386,0.01396256498992443,-0.1345052719116211,0.18103927373886108,-0.1377532035112381,0.12021612375974655,0.05218284949660301,0.32524797320365906,-0.09587273001670837,0.255278617143631,0.031153356656432152,-0.17216908931732178,0.6660456657409668,0.2931292951107025,0.05431700125336647,-0.36578890681266785,0.32904714345932007,-0.18492048978805542,-1.549890398979187,0.3159201741218567,0.413944810628891,0.35039013624191284,0.24251243472099304,0.03792504593729973,0.07024349272251129,-0.5016050934791565,0.07027236372232437,-0.5698453783988953,0.2116422802209854,0.1192505806684494,-0.0745585560798645,-0.3364517092704773,-0.34194216132164,0.426560640335083,-0.2035338282585144,-0.08386856317520142,0.44443729519844055,0.19078703224658966,-1.0904173851013184,-0.9005666971206665,-0.5964968204498291,-0.6344090104103088,-0.4361225962638855,-0.6088795065879822,-1.3740686178207397,0.6248278617858887,0.20278692245483398,-0.3194533586502075,0.48541638255119324,0.5085921883583069,-0.033790938556194305,0.06894940882921219,0.33903226256370544,-0.47182583808898926,0.1865525245666504,0.10720377415418625,0.1729155033826828,-0.046858176589012146,0.0931561216711998,-0.2645427882671356,-0.466815710067749,-0.11036577820777893,-0.3021916449069977,-0.332518994808197,0.11233600974082947,-0.05933985486626625,-0.09410347044467926,0.49353229999542236,0.17173978686332703,-0.06038407236337662,-0.40788811445236206,0.0798654705286026,-0.09074101597070694,0.03036409243941307,0.26513394713401794,-0.2905029356479645,-0.44027113914489746,0.5271852016448975,0.13434715569019318,-0.1753140538930893,-0.13457822799682617,0.3130704164505005,-0.16262850165367126,-0.31599968671798706,1.010737657546997,0.16202564537525177,-0.5395553708076477,-0.4039335548877716,-0.477548211812973,0.02693580463528633,0.24115221202373505,0.5994430184364319,0.4174440801143646,-0.12272629141807556,0.6459099650382996,-0.015368475578725338,0.08476614952087402,-0.9589679837226868,0.17081554234027863,-0.5571151971817017,-0.6072375178337097,-0.15703031420707703,0.018073303624987602,-0.18049483001232147,-0.5322983264923096,0.796976625919342,0.334509938955307,0.3825189471244812,-0.18464867770671844,-0.40340739488601685,0.23968933522701263,-0.7518759965896606,-0.07550770789384842,0.3224357068538666,0.32378578186035156,-1.0858097076416016,-0.2748560607433319,0.42690810561180115,0.18246124684810638,0.5879392027854919,-0.0770922377705574,-0.29019176959991455,0.33477696776390076,-0.5588992834091187,-0.004267641808837652,-0.06975703686475754,0.25531354546546936,0.23137156665325165,-0.05681152641773224,0.0715368390083313,-0.005911704618483782,-1.041465401649475,0.48067429661750793,-0.5606635212898254,-0.31336620450019836,-2.382143259048462,-0.16430526971817017,-0.025244176387786865,-0.5986188650131226,-0.7849631309509277,0.3982931077480316,0.43341293931007385,0.25466370582580566,0.4999525249004364,-0.20909719169139862,0.0651775673031807,0.056104108691215515,-0.6749531030654907,-0.15604650974273682,-0.2481866180896759,-0.25018951296806335,-0.36809495091438293,0.20199862122535706,-0.15074525773525238,-0.10826597362756729,0.3114737868309021,-1.2105772495269775,-0.048614535480737686,-0.011213669553399086,-0.03643690422177315,0.0757846012711525,0.46248334646224976,0.3693898618221283,-0.25033286213874817,0.24276971817016602,-0.5763053297996521,-0.44438251852989197,0.3153832256793976,-0.3591313362121582,0.4852009415626526,-0.5673975944519043,-0.2597362995147705,0.2430153787136078,-0.22249247133731842,0.2417309731245041,0.25843316316604614,-0.311278760433197,0.050411783158779144,-0.23882058262825012,-0.34770554304122925],"bias_tensor":[0.1155041828751564,-0.8845399022102356,-0.36604735255241394,0.37153947353363037,0.10472153127193451,0.126844584941864,0.2773653566837311,0.1149662509560585,0.12255699932575226,-0.06440629065036774,-0.06795143336057663,0.3672633767127991,-0.02903169021010399,0.7412776947021484,0.08097846060991287,0.31208813190460205,0.30650806427001953,-0.3578646183013916,-0.03662522882223129,0.21212315559387207,0.04004131630063057,0.23560971021652222,0.2348187118768692,0.41435500979423523]}}},"inbound_nodes":[[["td_dense1",0,0,{}]]]},{"name":"noseq_gru","class_name":"GRU","config":{"name":"noseq_gru","return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"units":48,"activation":"relu","recurrent_activation":"hard_sigmoid","use_bias":true,"reset_after":false,"Wz":[-0.20498546957969666,-0.25662916898727417,-1.7820852994918823,0.3845007121562958,0.8841205835342407,-0.00800599530339241,-0.7306580543518066,0.5769464373588562,-0.002434102352708578,1.59860098361969,-0.31727027893066406,0.39561787247657776,0.030429938808083534,0.2967260181903839,-0.6895852088928223,0.12823669612407684,0.6000796556472778,0.25273630023002625,0.9651558995246887,-0.14330577850341797,0.1194506585597992,0.5408234000205994,0.8944607973098755,0.32877907156944275,0.32704079151153564,-0.9409514665603638,0.2728222906589508,-0.0004978076322004199,0.2827109694480896,0.9256752133369446,0.04640469700098038,0.027226056903600693,-0.40244901180267334,-1.049429178237915,-1.0616368055343628,0.5428977012634277,-0.9749994277954102,0.37210074067115784,-0.7139073014259338,0.5220082998275757,-0.03158794343471527,0.07092487812042236,-0.6243882179260254,0.27652037143707275,0.12338751554489136,0.5452495217323303,0.2258986532688141,0.20500415563583374,0.24383991956710815,-0.9863095283508301,0.814096987247467,0.29840922355651855,0.188334122300148,0.5847030282020569,0.9621946215629578,0.14803220331668854,-0.5366357564926147,-0.48002028465270996,0.22094498574733734,0.6330789923667908,0.9939326047897339,0.32712408900260925,-0.6697067022323608,0.4258985221385956,0.5137467980384827,-0.4711005389690399,-0.28500401973724365,0.8848450779914856,-0.104715995490551,0.20171940326690674,0.24946872889995575,-0.15413130819797516,0.24299350380897522,-0.22799152135849,-0.5720952153205872,0.9365119338035583,-0.4102427065372467,-0.6794677972793579,0.40523219108581543,0.8255005478858948,-0.7453235983848572,-0.3005238473415375,-0.7248271107673645,0.11937990039587021,-0.9833862781524658,0.36773964762687683,0.059603385627269745,0.22968411445617676,-0.0461554080247879,0.4012587368488312,0.8808241486549377,0.44764211773872375,0.543825089931488,0.020760271698236465,0.6604905724525452,0.4158289134502411,0.17734579741954803,0.8746296167373657,1.0349559783935547,0.15010778605937958,-0.5272403955459595,0.7468235492706299,-1.2829959392547607,0.5448805093765259,-0.5385967493057251,0.006266121752560139,-0.0221949964761734,0.1354011595249176,-1.7612085342407227,0.6454390287399292,0.07145429402589798,0.0363488532602787,0.11260302364826202,-0.8879275321960449,-0.38078194856643677,-0.03813653066754341,0.0888429805636406,0.8372576236724854,-0.3649836778640747,0.5498498678207397,0.318403959274292,-0.3691611886024475,1.3343929052352905,0.2569870948791504,0.2669543921947479,0.5985440015792847,0.23193256556987762,-0.3403150737285614,0.00946118775755167,-0.3934295177459717,0.3416486382484436,0.4809512495994568,-1.224399209022522,0.27096813917160034,-0.5396700501441956,0.26231953501701355,0.10656538605690002,-0.12213120609521866,-0.04451349005103111,0.5276920199394226,0.824333131313324,0.4953796863555908,0.022666340693831444,0.4962504208087921,0.14630599319934845,-0.3777449429035187,0.002688428619876504,0.6476959586143494,0.11379599571228027,-0.013169452548027039,-0.24905356764793396,0.22273321449756622,-0.1546650379896164,-0.26818835735321045,-0.10428396612405777,0.6462543606758118,-1.2363502979278564,0.485234797000885,-0.057991478592157364,0.3747374713420868,1.3926337957382202,0.1459483653306961,-0.8925672769546509,0.4425323009490967,0.30887141823768616,0.29953810572624207,0.11717525124549866,0.46745553612709045,0.03654898330569267,-0.16175477206707,-0.4570826590061188,-0.3241511583328247,0.09700870513916016,0.8864005208015442,0.8657739162445068,-0.18235035240650177,-0.04690904915332794,-1.0030397176742554,-0.8077273964881897,0.46320563554763794,-0.5159192085266113,0.7622928023338318,-0.4305045008659363,0.5847516059875488,0.09842592477798462,-0.2967366874217987,-0.5015251040458679,0.029335275292396545,-0.007631598971784115,0.24569520354270935,0.2985028028488159,-0.00410340866073966,0.10095702111721039,-0.534803032875061,0.0008626298513263464,0.5015935897827148,-0.30448558926582336,0.09980027377605438,-0.2801443636417389,0.7364031672477722,0.4350694417953491,0.010699095204472542,0.06957779079675674,0.06136808916926384,-0.7926579117774963,0.7269500494003296,-0.4539320170879364,0.45672768354415894,0.17011967301368713,-0.1640940010547638,0.35980862379074097,-0.9405950307846069,1.3318582773208618,-0.07566266506910324,0.08663886040449142,0.3246220052242279,-0.4692620038986206,0.1816413551568985,0.40964314341545105,0.907240092754364,-1.3646857738494873,-1.2028478384017944,0.6608299016952515,1.3645172119140625,-0.4921606779098511,0.5561877489089966,-0.8588616847991943,0.32784175872802734,-1.294108271598816,0.19646631181240082,1.2548644542694092,-0.15353086590766907,-0.34547919034957886,0.4582712948322296,0.29820966720581055,0.7464960217475891,-0.06552886962890625,0.10557914525270462,0.06716129928827286,0.2638014853000641,0.39401334524154663,0.23899176716804504,-0.08061033487319946,0.2760000228881836,0.5243155360221863,-0.08416543900966644,-0.35205742716789246,0.42881515622138977,-0.693904459476471,-0.04640914872288704,-0.6363183259963989,0.5639516711235046,0.32817840576171875,0.2931479811668396,0.3185472786426544,0.21292078495025635,0.6694003343582153,-0.2265334278345108,0.9480339288711548,0.46521174907684326,-0.08466997742652893,0.708283007144928,0.6196274161338806,-0.09233298897743225,-0.36547237634658813,0.13637270033359528,0.11764051765203476,-0.0893445834517479,-0.23938849568367004,0.03801627457141876,0.1611243188381195,0.16752614080905914,0.10505664348602295,0.025388043373823166,0.03518179804086685,-0.03752271458506584,0.1185314804315567,-0.05339347943663597,0.0663314014673233,-0.248795285820961,0.15496490895748138,0.20029853284358978,0.1150408610701561,0.017667699605226517,0.0592404268682003,-0.08821725100278854,0.31506311893463135,-0.14729450643062592,0.3523422181606293,0.4410416781902313,0.3190147876739502,0.5198435187339783,-0.33849355578422546,-0.3115204870700836,-0.27657443284988403,0.2919101417064667,-0.2355595827102661,0.20068396627902985,-0.30072975158691406,0.6508917212486267,-0.8512549996376038,0.4529317021369934,-0.6506141424179077,0.016870006918907166,0.26148921251296997,0.16967836022377014,-0.48697328567504883,0.2648445665836334,0.3116775453090668,0.32077333331108093,0.012954681180417538,0.29912057518959045,0.14738346636295319,0.018255075439810753,0.04705335944890976,0.3765895962715149,-0.3397867977619171,0.47136300802230835,-0.22955717146396637,1.0093930959701538,-0.6537746787071228,-0.17061947286128998,-0.08305949717760086,0.8680017590522766,-1.037396788597107,0.18193911015987396,-0.04268842190504074,0.07413767278194427,0.8634425401687622,0.24948976933956146,0.698469340801239,0.5438941717147827,0.26915857195854187,0.7054141759872437,0.09811663627624512,0.41805192828178406,1.1492321491241455,-0.7557063698768616,-0.3068679869174957,0.4239960014820099,1.2556743621826172,0.9824246764183044,0.2924949824810028,0.3903772830963135,0.5417303442955017,0.8970807790756226,-0.13536077737808228,0.3075650930404663,0.8647871017456055,0.4952996075153351,-0.4553791880607605,0.3602384328842163,0.40961527824401855,-0.12510204315185547,0.07630478590726852,-0.05682918801903725,0.2625029385089874,0.13417978584766388,0.13503727316856384,0.2603933811187744,-0.2117958515882492,-0.4461109936237335,-0.020556490868330002,-0.06925628334283829,-0.1153988465666771,-0.13620412349700928,-0.19583015143871307,0.694078803062439,-0.05069749057292938,0.2602783739566803,0.011613474227488041,0.4911598563194275,-0.0966908261179924,0.45385563373565674,0.03104434534907341,-0.051435500383377075,-0.27119016647338867,0.20677444338798523,-0.7691124677658081,0.4488026201725006,-0.2880699336528778,0.21628810465335846,0.05020441114902496,0.27869755029678345,0.4232632517814636,0.144444540143013,0.3406776487827301,0.3303479254245758,0.0444147102534771,0.5165347456932068,-0.7231005430221558,0.2813419699668884,-0.9637468457221985,0.030265985056757927,-0.6106832027435303,0.5616146326065063,-0.4981171488761902,0.505992591381073,0.9490565657615662,0.384065181016922,1.5742125511169434,-0.1049647331237793,1.1813842058181763,0.797668993473053,-0.10247191786766052,1.3423357009887695,0.4339401423931122,1.429674744606018,-0.22181466221809387,-0.2554624080657959,-1.1378971338272095,0.10799067467451096,-0.4450726807117462,0.35765376687049866,-1.2116445302963257,0.6708683967590332,-0.9341856837272644,-0.7913370132446289,-1.4455673694610596,0.4345815181732178,-0.6041969060897827,0.7696507573127747,0.2469765841960907,-0.004299058113247156,0.9962459206581116,-0.6119516491889954,0.595089852809906,0.8181186318397522,0.15784911811351776,0.2095610797405243,0.22073246538639069,-0.11240747570991516,-0.10514305531978607,0.11008021980524063,-0.1028573140501976,0.05104634538292885,0.19057771563529968,-0.07734624296426773,-0.11801460385322571,-0.16260646283626556,-0.009452938102185726,-0.04516560211777687,-0.15883032977581024,-0.047711148858070374,0.14220890402793884,0.10255508124828339,-0.027762578800320625,0.016597943380475044,0.18140502274036407,0.09697970747947693,-0.10566562414169312,0.008656853809952736,0.0341859795153141,0.1271734982728958,-0.22066675126552582,0.04253159463405609,0.23805928230285645,0.20956286787986755,0.15164326131343842,0.7320513129234314,0.38671866059303284,0.3824828267097473,0.17011244595050812,0.6745346784591675,-0.3736253082752228,0.15560665726661682,-0.33797702193260193,0.1671268790960312,-0.4203746020793915,0.7294080853462219,0.6318094730377197,0.29261094331741333,0.6905521154403687,-0.7240732908248901,-0.2514670193195343,-0.19648464024066925,-0.07137499749660492,0.7031559348106384,0.06852998584508896,0.0014076035004109144,0.31980100274086,0.5114784836769104,0.3938511610031128,0.49087536334991455,0.3149872124195099,0.31088685989379883,0.41585052013397217,0.20241647958755493,-0.5403482913970947,-0.01977609284222126,-0.6046913266181946,0.01744290068745613,-0.5313072204589844,0.42695221304893494,0.9677637815475464,0.3390876352787018,1.6228517293930054,-0.29859715700149536,0.003270967397838831,0.955119252204895,-0.5732792019844055,0.40007421374320984,-0.00812754686921835,1.163809061050415,-0.26747027039527893,-0.08518251031637192,-0.25928863883018494,-0.037947095930576324,0.6506372094154358,1.2528808116912842,0.517821192741394,0.26921412348747253,0.22454454004764557,-0.8778588771820068,-0.5367022752761841,0.3073495626449585,-0.08541705459356308,0.6361523866653442,-0.4801546037197113,0.4001690149307251,0.35269615054130554,-0.215519517660141,0.932134747505188,0.10165487974882126,-0.07353959232568741,0.13950605690479279,0.22842134535312653,-0.2106076180934906,0.29489102959632874,-0.3095771074295044,0.34922370314598083,0.29428938031196594,-1.09818696975708,-0.47241055965423584,-1.2307710647583008,1.752023696899414,0.1492190808057785,0.044615376740694046,-0.002929034410044551,0.18229155242443085,-1.656286358833313,0.23945727944374084,-0.6613061428070068,0.8038974404335022,0.5529872179031372,-0.7652958631515503,-0.4443424940109253,-0.554915726184845,0.7318185567855835,0.3925864100456238,-0.38957884907722473,0.4265771210193634,-0.1095268726348877,-0.2579532265663147,-0.43735307455062866,0.264187216758728,0.7699405550956726,0.014773884788155556,0.14203016459941864,0.23311002552509308,0.4537118971347809,-0.10399946570396423,-0.09241779148578644,0.32014259696006775,-1.3318026065826416,0.5104991793632507,-0.3028194010257721,0.5471299886703491,1.426123857498169,0.38486742973327637,-0.8373221158981323,0.7257426381111145,0.8869044780731201,0.34598207473754883,0.5514142513275146,0.12345174700021744,0.27095896005630493,-0.35866791009902954,-0.4252796769142151,0.42797282338142395,0.1608494222164154,0.12016752362251282,-0.6612114906311035,0.9415334463119507,0.27962419390678406,0.1255810707807541,0.08568038791418076,0.29015621542930603,-0.9646364450454712,0.7649372220039368,-0.30941182374954224,0.5196640491485596,0.1865830272436142,-0.30554285645484924,-0.018822312355041504,-0.8788983821868896,0.3473134934902191,-0.2618308961391449,0.32234513759613037,0.01306871511042118,-0.10640795528888702,0.21908466517925262,0.31881946325302124,0.40533846616744995,-0.93694007396698,-1.5537689924240112,0.2948123514652252,0.4029933214187622,-0.32452037930488586,0.24663372337818146,-0.41936245560646057,0.6312357783317566,-0.7443792819976807,0.4787445664405823,1.352097511291504,-0.35509055852890015,-0.11876979470252991,0.15587027370929718,-0.31119853258132935,0.45077693462371826,0.1470905840396881,0.46771642565727234,0.03727499768137932,0.6983434557914734,0.22853480279445648,-0.7010102868080139,-0.04710552841424942,0.3815210461616516,1.15354323387146,0.19969506561756134,0.07120349258184433,-0.1792004108428955,-0.0764789879322052,-0.25861525535583496,-0.29955971240997314,0.5611971616744995,-0.5443805456161499,0.25151968002319336,-0.13171811401844025,0.41661858558654785,1.0155788660049438,0.4225819408893585,-0.2165631204843521,1.0116878747940063,0.18662163615226746,0.5277130007743835,0.1883852779865265,0.16772843897342682,0.09296110272407532,-0.9269624352455139,-1.2644799947738647,0.3441949784755707,-0.8263633251190186,3.842427395284176e-05,-0.6865657567977905,0.4869329631328583,0.04965999722480774,0.013607833534479141,-1.1091800928115845,0.2383117377758026,-1.5641010999679565,0.8547667264938354,-0.11092813313007355,0.443800151348114,-0.08186750113964081,-0.8153199553489685,