{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": ["None", 100, 18], "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "mask", "class_name": "Masking", "config": {"name": "mask", "mask_value": -999}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "td_dense0", "class_name": "TimeDistributed", "config": {"name": "td_dense0", "layer": {"class_name": "Dense", "config": {"name": "dense_1", "units": 24, "activation": "relu", "use_bias": true, "kernel_tensor": [-0.34082940220832825, -0.01275415439158678, 0.3865897059440613, 0.2288346141576767, -0.16671209037303925, 0.021883629262447357, 0.38279980421066284, 0.1277293562889099, -0.041574060916900635, -0.056232959032058716, 0.2515224516391754, 0.07491036504507065, -0.07593704015016556, 0.033556513488292694, 0.8992542624473572, 0.3419714570045471, 0.2642534375190735, -0.09941121935844421, 0.2778192460536957, 0.06957616657018661, -0.6841095089912415, 0.214608296751976, -0.22328761219978333, 0.29504287242889404, 0.35540255904197693, 0.17658664286136627, -0.13528968393802643, 0.301936537027359, 0.12910376489162445, -0.2832418382167816, 0.13495603203773499, -0.2064797431230545, -0.237020343542099, 0.19905392825603485, -0.34232842922210693, 0.1760270893573761, 0.4193801283836365, -0.5392819046974182, 0.07863873243331909, 0.33841821551322937, -0.1677159070968628, -0.23122355341911316, -0.20335163176059723, 0.16524675488471985, -0.6027654409408569, -0.0715213268995285, -0.21882502734661102, -0.017286287620663643, -0.17052888870239258, -0.5114268064498901, -0.048319634050130844, 0.09707488119602203, 0.36557891964912415, -0.27628093957901, -0.5674908757209778, -0.23300962150096893, -0.16064098477363586, -0.818596601486206, 0.3273109793663025, 0.1919420212507248, 0.40591686964035034, 0.05494455620646477, -0.1415185034275055, -0.40910351276397705, -1.0284368991851807, -0.25592395663261414, -0.19145548343658447, 0.3431413471698761, -0.04813519865274429, 0.18473829329013824, -0.2674139738082886, -0.7612074017524719, 0.30423566699028015, -0.07305864989757538, -0.04057445377111435, 0.08639238774776459, 0.2122618556022644, 0.05591787025332451, 0.38736745715141296, -0.31681784987449646, -0.7385798096656799, -0.10062449425458908, 0.3487150967121124, 0.43030864000320435, 0.26907896995544434, 0.00588182732462883, -0.3057170808315277, 0.2783134877681732, -0.5450056791305542, 0.01266530342400074, 0.02668711356818676, 0.07117311656475067, 0.11886487901210785, -0.06013874337077141, 0.09434574842453003, 0.03854778781533241, -0.025288645178079605, 0.3707782030105591, -0.7605806589126587, 0.22426100075244904, 0.6996949315071106, 0.5796271562576294, 0.0788431465625763, -0.6499739289283752, 0.1686498373746872, 0.2783143222332001, 0.006397882476449013, 0.2650502920150757, -0.30687278509140015, 0.10571318864822388, 0.18014810979366302, -0.0329124853014946, 0.09622251242399216, 0.21129710972309113, 0.2693697512149811, 0.4906826615333557, 0.5829337239265442, 0.22709649801254272, 0.09411277621984482, -0.08807219564914703, -0.12352892756462097, 0.005880867596715689, 0.0351778119802475, 0.5588728785514832, -0.2969471514225006, -0.046768493950366974, 0.2518370449542999, -0.12738226354122162, 0.19060437381267548, 0.06364955753087997, 0.09302721917629242, -0.025799088180065155, 0.09304692596197128, -0.15800943970680237, 0.2834891080856323, -0.12762635946273804, 0.19310709834098816, 0.6933581829071045, 0.33803102374076843, -0.540351390838623, 0.5519742965698242, 0.0009250696748495102, -0.40280041098594666, -0.14442111551761627, -0.514216423034668, 0.16371692717075348, -0.5437504649162292, 0.3264068365097046, 0.2293926626443863, 0.2819945514202118, 0.21845799684524536, 0.03750902786850929, 0.0632745772600174, -0.19039374589920044, -0.0025635778438299894, -0.11047305911779404, 0.11478633433580399, -0.034977033734321594, -0.43507295846939087, 0.42950889468193054, -0.4153215289115906, 0.4125220477581024, 0.13488522171974182, -0.23219098150730133, -0.06772580742835999, -0.06135258451104164, 0.36573776602745056, -0.703805685043335, -0.07309672981500626, -0.18047276139259338, -0.3605179488658905, -0.26947343349456787, -0.2531960606575012, -0.08618906140327454, -0.16158217191696167, -0.20542512834072113, -0.5918067693710327, 0.08301148563623428, -0.07458263635635376, -0.0734824687242508, 0.1421922892332077, -0.24626082181930542, 0.03896689787507057, 0.1198163777589798, -0.2233704775571823, -0.023672571405768394, -0.02927861362695694, 0.20637130737304688, 0.7087337374687195, -1.8136802911758423, -0.7488948702812195, 0.10622227191925049, 0.12592025101184845, -0.02418159879744053, 0.048799995332956314, -0.15038879215717316, -0.066465824842453, 0.4966488778591156, 0.031298961490392685, 0.25072434544563293, -0.020490914583206177, 0.07852263003587723, 0.35309523344039917, 0.2146664410829544, -0.4326348900794983, 0.34094110131263733, -0.03571810573339462, 0.28434810042381287, 0.5210604071617126, -0.15782353281974792, 0.2247595638036728, 0.08250630646944046, 0.7898718118667603, -0.20931266248226166, -0.01092018187046051, -0.08862719684839249, -0.6921616792678833, 0.15119510889053345, -0.5354292392730713, 0.06501926481723785, -0.02237231470644474, 0.3359069228172302, 0.11295362561941147, -0.11566296964883804, -0.29926416277885437, -1.2684959173202515, -1.0744551420211792, 0.10689166933298111, 0.07259097695350647, -0.3561398386955261, -0.25052571296691895, -0.8889009356498718, -0.17585471272468567, -0.38394150137901306, 0.24014610052108765, 0.13322357833385468, -0.39038005471229553, 0.1834956407546997, -0.19707678258419037, 0.44961944222450256, 0.48313435912132263, -0.3528730869293213, 0.3192698359489441, 0.11615850031375885, 0.1044297143816948, -0.00853230431675911, 0.28123417496681213, 0.20719307661056519, 0.05179757624864578, 0.22035638988018036, 0.025155989453196526, -0.4077009856700897, 0.24856014549732208, -0.10856355726718903, 0.32268932461738586, 0.12249001115560532, 0.043543536216020584, -0.3398919701576233, 0.09508839249610901, 0.2822698652744293, -0.15522193908691406, 0.5555070042610168, -0.042238377034664154, 0.8335786461830139, -0.0805017501115799, 0.18344368040561676, -0.039107173681259155, 0.09854426980018616, -0.3326983153820038, -0.12131062150001526, 0.09315923601388931, -0.4078453779220581, -0.19845665991306305, 0.14866018295288086, 0.3018714189529419, -0.33266061544418335, 0.12424357235431671, 0.264129102230072, 0.7380620837211609, 0.20118384063243866, -0.2175009548664093, 0.8231320977210999, 0.0033263801597058773, -0.21997639536857605, 0.2921241521835327, 0.18936434388160706, 0.36810022592544556, -0.07903356850147247, -0.020641088485717773, -0.13816575706005096, -0.003370472230017185, -0.24791690707206726, 0.3444591164588928, -0.07698985189199448, 0.22788286209106445, 0.42072078585624695, 0.224680557847023, -0.4708978831768036, -0.33571508526802063, -0.6087731122970581, 0.05533207952976227, -0.22918061912059784, -0.3927769362926483, 0.27402234077453613, 0.1032489538192749, 0.2856786251068115, -0.5057242512702942, 0.39035165309906006, -0.21265049278736115, 0.057250212877988815, -0.01840342953801155, 0.43829870223999023, 0.27403056621551514, -0.13127702474594116, -0.5147683620452881, -0.014850946143269539, -0.21929797530174255, -0.43489789962768555, 0.03360866755247116, 0.11540205776691437, 0.22815637290477753, 0.02092273160815239, 0.055357400327920914, 0.16974875330924988, -0.6059885621070862, -0.2976725995540619, -0.30055472254753113, 0.14809903502464294, 0.26137205958366394, -0.25056248903274536, -0.14666472375392914, -0.9035532474517822, 0.3525276482105255, 0.797491729259491, 0.2352982759475708, 0.09827584028244019, -0.17196331918239594, 0.2394149750471115, 0.1130913570523262, 0.2805722951889038, 0.3504834771156311, -0.06918834149837494, -0.5135983228683472, -0.0050074076279997826, -0.38357362151145935, -0.017692137509584427, -0.32835161685943604, 0.10978751629590988, 0.11676076799631119, -0.24410302937030792, 0.1992236226797104, 0.09750880300998688, -0.04427048936486244, -0.14822931587696075, 0.3072381913661957, -0.3615851104259491, -0.0005034900386817753, -0.35382142663002014, -0.3427577316761017, -0.5867969393730164, -0.15138162672519684, -0.046808600425720215, -0.2936360239982605, 0.22009187936782837, -0.21161310374736786, 0.025183873251080513, 0.2323380410671234, -0.02989530935883522, -0.2242746353149414, -0.9521685838699341, -0.5091098546981812, -0.20675837993621826, 0.003198123537003994, 0.31560584902763367, -0.33190393447875977, -1.60289466381073, 0.3122321665287018, -0.1609126627445221, 0.04366210475564003, -0.049221575260162354, -0.022443940863013268, 0.17415621876716614, -0.05223459005355835, 0.1623603105545044, 0.23840461671352386, 0.509565532207489, -0.6216258406639099, -0.40457862615585327, -0.33149227499961853, 0.01781081035733223, 0.04257112741470337, 0.23552921414375305, -0.06606963276863098, -0.08746969699859619, 0.06384330987930298, -0.030868636444211006, 0.2780519425868988, 0.19038499891757965, -0.25619614124298096, -0.020383711904287338, 0.13942064344882965, 0.28529536724090576, 0.34461909532546997, 0.27958977222442627, -0.18714532256126404, -0.5533916354179382, -0.6975435614585876, -0.0531076155602932, -0.08392222225666046, -0.3564356863498688, 0.3779228925704956, -0.5980225801467896, 0.31820306181907654, 0.005087888799607754, 0.005951559636741877, -0.20302124321460724, 0.2339421957731247, -0.2751085162162781, 0.09247869998216629, 0.395430326461792, 0.26429975032806396, -0.010843221098184586, 0.2319936752319336, 0.2149256467819214, -0.14409984648227692, 0.5178037881851196, -0.2144049108028412, -0.31121307611465454, -0.21879254281520844, 0.2050221860408783, -0.14142222702503204, 0.2873964309692383], "bias_tensor": [-0.3263013958930969, -0.4057733416557312, 0.0901995524764061, 0.18797874450683594, 0.22731174528598785, 0.07543861865997314, 0.01661144383251667, -0.01885790005326271, 0.2510397732257843, -0.08647056668996811, 0.1355043649673462, -0.2482510358095169, -0.03344615921378136, 0.39384758472442627, 0.010131068527698517, 0.16929233074188232, -0.0011860316153615713, -0.04875551536679268, 0.3492724299430847, 0.033164653927087784, -0.31755560636520386, 0.06306516379117966, -0.43817561864852905, 0.24347707629203796], "feature_scaling": [{"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_PROBNNe", "offset": 0.030261768028140068, "scale": 0.1453121453523636}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_PROBNNghost", "offset": 0.11383388191461563, "scale": 0.23897698521614075}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_PROBNNk", "offset": 0.15035028755664825, "scale": 0.2782687544822693}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_PROBNNmu", "offset": -0.9379542469978333, "scale": 0.26889532804489136}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_PROBNNp", "offset": 0.12028364092111588, "scale": 0.24430136382579803}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_PROBNNpi", "offset": 0.6829375624656677, "scale": 0.3651497960090637}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_P", "offset": 12405.263671875, "scale": 15748.662109375}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_PT", "offset": 692.3184204101562, "scale": 674.5028686523438}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_Charge", "offset": 0.011514171026647091, "scale": 0.9999337196350098}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_BPVIP", "offset": 1.2815855741500854, "scale": 5.881059646606445}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_BPVIPCHI2", "offset": 739.5873413085938, "scale": 9590.01953125}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_SumBDT_ult", "offset": -31.441909790039062, "scale": 16.6632022857666}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_VeloCharge", "offset": 0.9704895615577698, "scale": 0.14000895619392395}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_IP_trMother", "offset": 2.594221353530884, "scale": 6.110372543334961}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_diff_z", "offset": 8.95514965057373, "scale": 74.30827331542969}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_P_proj", "offset": 12478874.0, "scale": 21695880.0}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_cos_diff_phi", "offset": -0.04796719178557396, "scale": 0.7115429639816284}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_diff_eta", "offset": -0.07696045190095901, "scale": 0.9891189932823181}]}}}, "inbound_nodes": [[["mask", 0, 0, {}]]]}, {"name": "td_dense1", "class_name": "TimeDistributed", "config": {"name": "td_dense1", "layer": {"class_name": "Dense", "config": {"name": "dense_2", "units": 24, "activation": "relu", "use_bias": true, "kernel_tensor": [0.058641500771045685, -0.1061391606926918, 0.4219338297843933, -0.2526748478412628, -0.09700175374746323, 0.27706408500671387, -0.3572596609592438, 0.06470920890569687, -0.12720969319343567, -0.14913511276245117, -0.260872483253479, 0.061713963747024536, 0.23457451164722443, -0.2812751531600952, 0.040142983198165894, 0.4481251537799835, 0.0488911010324955, -0.05536685883998871, -0.3768913447856903, -0.0553283728659153, -0.09158728271722794, 0.5191572904586792, 0.5781841278076172, 0.077009417116642, 0.5455119013786316, 0.008983735926449299, 0.20199716091156006, -0.14399610459804535, -0.47113338112831116, 0.038797348737716675, 0.2525293231010437, 0.21857242286205292, -0.22276201844215393, -0.16353274881839752, -0.04577581584453583, 0.7660208344459534, 0.4480060338973999, -0.6755398511886597, -0.14910800755023956, -0.1574324071407318, -0.14218787848949432, -0.4464205801486969, -1.1762086153030396, -0.5162854790687561, 0.2630360424518585, -0.10460403561592102, -0.3924994468688965, -0.12062102556228638, -0.06626448780298233, -0.19434522092342377, -0.3962874114513397, 0.03708726540207863, -0.38170939683914185, -0.08061568439006805, 0.33244070410728455, 0.00969559047371149, 0.10252279788255692, 0.2968326508998871, 0.5487242937088013, 0.02334122732281685, 0.08385544270277023, 0.31864094734191895, -0.3979761600494385, 0.3498263955116272, -0.0784420445561409, -0.018071500584483147, -0.024706540629267693, 0.13596107065677643, 0.017634790390729904, 0.2682705521583557, -0.11427168548107147, 0.0804395079612732, 0.17059361934661865, 0.4135150611400604, -0.7078501582145691, 0.0349704883992672, -0.117734394967556, 0.35668033361434937, 0.20117834210395813, 0.5295227766036987, 0.2627341151237488, -0.1599598228931427, -0.5661212801933289, 0.4474662244319916, -1.1477607488632202, -0.4122481346130371, -0.2708732485771179, 0.14773909747600555, -0.056315671652555466, 0.08480451256036758, 0.06660926342010498, -0.3904891312122345, 0.097592793405056, 0.03753158822655678, 0.2572261095046997, -0.3067529499530792, -0.28244084119796753, -0.3150172531604767, -0.2601078450679779, -0.1300322562456131, 0.0739588737487793, -0.5472366213798523, 0.026696080341935158, -0.4400552809238434, 0.1631339192390442, 0.23605774343013763, -0.02936842478811741, 0.14595718681812286, 0.09712022542953491, -0.12033579498529434, 0.2568574547767639, 0.5379582643508911, 0.3400309681892395, 0.2061559557914734, -0.5112040638923645, 0.527681827545166, -0.46003594994544983, 0.013443809002637863, 0.24360650777816772, 0.12249879539012909, -0.33399346470832825, -0.24787236750125885, -0.16240845620632172, 0.4534182548522949, -0.10462765395641327, 0.04093689098954201, 0.1095794215798378, 0.28928419947624207, -0.5103466510772705, -0.46900099515914917, -0.2589319050312042, 0.5709004998207092, 0.4893395006656647, 0.5678814649581909, -0.12349369376897812, -0.02810099348425865, -0.13579538464546204, -0.3026845455169678, 0.4336640536785126, -0.2395307570695877, 0.004790252540260553, -0.18690750002861023, 0.02788078784942627, -0.4867539405822754, -0.08884362131357193, 0.07259517908096313, 0.1355220079421997, 0.21495307981967926, 0.16373343765735626, 0.09681527316570282, -0.33974385261535645, 0.26494091749191284, -0.21594086289405823, 0.3909922242164612, -0.08437557518482208, -0.03468077629804611, -0.340955525636673, 0.3032349646091461, 0.30717921257019043, -0.1488356590270996, -0.2546084523200989, 0.0839075818657875, 0.5664933919906616, -0.07047462463378906, -0.10390187799930573, 0.19368168711662292, -0.26223641633987427, -0.02533748745918274, -0.1554303914308548, 0.07900626957416534, -0.0925913080573082, -0.1546110063791275, -0.4143370985984802, 0.006521871313452721, 0.3002745509147644, 0.3380582928657532, 0.22139032185077667, -0.32357966899871826, 0.19566306471824646, -0.39754220843315125, -0.17665092647075653, 0.2628228962421417, 0.21437382698059082, -0.09606391191482544, -0.4126514494419098, 0.07971968501806259, 0.23719245195388794, -0.1534205973148346, -0.0638984739780426, -0.29643481969833374, -0.09012901037931442, 0.2624886929988861, 0.23073656857013702, 0.13367187976837158, -0.261440634727478, -0.296649694442749, 0.07881749421358109, 0.21303428709506989, -0.22499282658100128, 0.03939583897590637, -0.17524555325508118, -0.30000507831573486, -0.2090110033750534, 0.07457784563302994, 0.1779695600271225, 0.20699536800384521, 0.1357039213180542, -0.049651067703962326, 0.28326648473739624, 0.30151838064193726, -0.24225766956806183, -0.4106874167919159, 0.3741800785064697, 0.25416502356529236, 0.46582671999931335, -0.18219564855098724, 0.20368191599845886, 0.2274780422449112, -0.2196202427148819, -0.002412620931863785, 0.08656260371208191, 0.07000923156738281, -0.030207455158233643, 0.0028847004286944866, 0.11227869242429733, 0.1127941831946373, -0.027498409152030945, -0.1500648707151413, -0.42385467886924744, -0.1433839201927185, 0.4525318443775177, 0.4107861816883087, -0.4333750307559967, -0.21221855282783508, -0.07764419168233871, 0.3022306561470032, -0.06501774489879608, 0.055505815893411636, 0.02165244333446026, 0.4489104151725769, 0.16057902574539185, -0.07037299126386642, -0.07690484821796417, -0.24876363575458527, 0.062050435692071915, -0.5043524503707886, 0.15543246269226074, 0.13352255523204803, -0.26352763175964355, -0.44916674494743347, 0.5970857739448547, -0.21801362931728363, 0.4254453182220459, -0.23537586629390717, 0.1755489856004715, 0.4476378560066223, 0.17583352327346802, 0.007951220497488976, 0.0017103746067732573, -0.13572300970554352, 0.46099990606307983, -0.1654626429080963, 0.08651059865951538, 0.13649052381515503, 0.06852345913648605, 0.5403338074684143, 0.42203202843666077, -0.24317319691181183, -0.6444826722145081, -0.34144341945648193, -0.4229978322982788, 0.07523685693740845, 0.1366938352584839, 0.09904102981090546, -0.07869330048561096, 0.07732561230659485, -0.6923509240150452, 0.3222266733646393, -0.14260122179985046, 0.32418105006217957, 0.21978257596492767, -0.30774247646331787, -0.06439170986413956, 0.09211794286966324, -0.15274621546268463, 0.07490723580121994, 0.023856211453676224, 0.005842640530318022, 0.15309034287929535, -0.2605263590812683, 0.24715116620063782, 0.44393548369407654, -0.4283737540245056, -0.08787238597869873, -0.003441660897806287, 0.0391787551343441, -0.007862398400902748, -0.6231252551078796, 0.10617197304964066, -0.4096960127353668, -0.06287013739347458, 0.2180716097354889, -0.5380077958106995, -0.12814831733703613, 0.2026732712984085, -0.15476512908935547, -0.3972153663635254, 0.0007253684452734888, -0.3898823857307434, -0.036814168095588684, -0.2612723410129547, 0.18128588795661926, -0.3974134624004364, 0.25254395604133606, 0.07476291060447693, 0.13767270743846893, -0.1557757407426834, 0.2685915231704712, -0.008505077101290226, -0.006006091833114624, -0.30343011021614075, -0.34094345569610596, 0.058934878557920456, 0.25334087014198303, 0.12918800115585327, -0.1875862181186676, -0.28635016083717346, -0.008289184421300888, -0.19271749258041382, 0.2898012399673462, -0.6681309938430786, 0.09184359014034271, 0.5003463625907898, 0.05754141882061958, 0.16413931548595428, -0.6091606616973877, 0.24625098705291748, -0.20676372945308685, 0.12900689244270325, 0.3779396712779999, -0.06736046075820923, -0.3489004671573639, 0.15736354887485504, -0.23701709508895874, -0.3409605920314789, 0.5505924820899963, -0.4140114188194275, 0.3809928297996521, -0.045037321746349335, -0.13539385795593262, 0.1297358274459839, 0.08519819378852844, 0.25088149309158325, -0.5434798002243042, -0.15768101811408997, -0.11246022582054138, 0.075331911444664, 0.2211127132177353, -0.25993749499320984, 0.10470563918352127, -0.17128856480121613, -0.35226327180862427, -0.1285298466682434, -0.36215946078300476, -0.4034876525402069, 0.15552981197834015, -0.5643537044525146, -0.14897631108760834, 0.22721365094184875, -0.6063579320907593, 0.3880496323108673, -0.8001437187194824, -0.1885063201189041, -0.14932528138160706, -0.30389514565467834, 0.16462424397468567, 0.480460524559021, -0.09652954339981079, 0.054346051067113876, 0.07622937113046646, 0.3856624960899353, -0.0833299532532692, -0.11662466078996658, 0.022712618112564087, -0.3319440186023712, 0.4696090817451477, 0.061579059809446335, 0.30017784237861633, 0.01333705522119999, 0.32140570878982544, -0.20861850678920746, -0.821552574634552, 0.3448426127433777, 0.17648489773273468, -0.15196675062179565, -0.18400026857852936, -0.12956230342388153, 0.16602212190628052, -0.11290846765041351, 0.409853458404541, -0.04193507507443428, 0.44365212321281433, -0.1864268034696579, -0.15864716470241547, -0.5198113322257996, 0.20037353038787842, -0.06586427241563797, -0.044728346168994904, -0.5898042321205139, -0.31385743618011475, -0.053406089544296265, -0.27194082736968994, 0.14004135131835938, 0.3165561258792877, -0.05160132795572281, -0.5091527700424194, 0.11550115048885345, -0.20374387502670288, 0.24311968684196472, -0.38652998208999634, -0.4973248541355133, -0.04230738803744316, 0.0766373872756958, 0.010010521858930588, 0.5459632873535156, 0.17814312875270844, 0.1601601541042328, 0.1198224350810051, -0.38855740427970886, -0.04710453003644943, -0.6618990302085876, 0.18616484105587006, 0.2280542254447937, 0.2613098919391632, 0.17661359906196594, -0.39752185344696045, -0.23494991660118103, 0.4579380452632904, 0.30675774812698364, 0.018960796296596527, -0.1107759028673172, -0.1948433369398117, 0.06931019574403763, -0.3659302890300751, -0.4023445248603821, 0.031207239255309105, 0.043344054371118546, 0.28436723351478577, -0.26646122336387634, 0.45377522706985474, 0.053508661687374115, 0.16106030344963074, -0.1556931436061859, 0.15413665771484375, -0.41829127073287964, 0.2720043361186981, -0.02081236243247986, 0.37237364053726196, 0.25597235560417175, 0.19950748980045319, 0.2971455156803131, 0.5632774233818054, -0.32437610626220703, 0.07454808801412582, 0.4606899321079254, 0.16428884863853455, -0.1612802892923355, -0.7656081914901733, 0.3925953805446625, -0.4266883432865143, 0.149174764752388, -0.06234155595302582, -0.13303415477275848, 0.15674573183059692, -0.2505614459514618, 0.08897585421800613, 0.40583428740501404, 0.5178791284561157, -0.1902381181716919, 0.17730893194675446, 0.2635270357131958, -0.4613022804260254, 0.47786372900009155, 0.061104852706193924, 0.11986644566059113, -0.3428981900215149, 0.09974357485771179, 0.1381123960018158, 0.19811108708381653, 0.1892991065979004, 0.2722327709197998, 0.15408995747566223, 0.1769871860742569, -0.07235480844974518, -0.31475481390953064, -0.2054286152124405, -0.038322970271110535, 0.6850095391273499, -0.01930668205022812, -0.11365838348865509, -0.31343597173690796, 0.22780892252922058, -0.07033384591341019, -0.10279137641191483, 0.04569542780518532, -0.2568866014480591, 0.1388932764530182, -0.06854566186666489, 0.27098050713539124, 0.010138225741684437, 0.003627629019320011, -0.2682850658893585, 0.5313113331794739, 0.3894306719303131, -0.044172972440719604, -0.2289501130580902, 0.2430524080991745, 0.02236495539546013, 0.28896671533584595, 0.034048281610012054, 0.1467425376176834, 0.10075245052576065, -0.06216825917363167, -0.42884334921836853, -0.3437524139881134, 0.28024497628211975, -0.30884137749671936, 0.12648911774158478, 0.020688019692897797, 0.08995693922042847, 0.10708371549844742, 0.053706202656030655, 0.08287111669778824, -0.4656961262226105, 0.2489043027162552, 0.27408894896507263, 0.15370933711528778, -0.3058710992336273, -0.11110643297433853, 0.295867383480072, -0.04662084951996803, 0.30464860796928406, 0.1369519829750061, 0.3582158088684082, 0.11060217022895813, -0.17083288729190826, 0.23354217410087585, -0.3803867995738983, -0.4357398450374603, -0.18288959562778473, -0.16500405967235565, -0.06976007670164108, -0.5384491086006165, -0.09559740126132965, -0.18500514328479767, -0.929069995880127, 0.028353432193398476, -0.48657238483428955, -0.31312766671180725, -0.027727561071515083, -0.42584919929504395, 0.184715136885643, -0.400076687335968, 0.47449004650115967, -0.12484269589185715, -0.09507627040147781, 0.1934933215379715, 0.010330919176340103, -0.2921448349952698, -0.03136857971549034, 0.31565940380096436, -0.41662025451660156, 0.6635876297950745, 0.47138503193855286, -0.13994546234607697, 0.10994874686002731], "bias_tensor": [-0.1708647608757019, 0.027766456827521324, 0.11760088801383972, -0.31875160336494446, 0.027780773118138313, 0.27227625250816345, 0.2208910882472992, 0.03828185424208641, -0.22661225497722626, -0.21684198081493378, -0.1786113679409027, -0.02967229299247265, 0.28813663125038147, -0.0627395361661911, 0.14494746923446655, -0.022883014753460884, 0.16760194301605225, 0.3337884545326233, 0.07533962279558182, -0.041167110204696655, 0.6271762251853943, 0.06050858274102211, -0.01546122133731842, 0.3805738687515259]}}}, "inbound_nodes": [[["td_dense0", 0, 0, {}]]]}, {"name": "td_dense2", "class_name": "TimeDistributed", "config": {"name": "td_dense2", "layer": {"class_name": "Dense", "config": {"name": "dense_3", "units": 24, "activation": "relu", "use_bias": true, "kernel_tensor": [0.21508175134658813, -0.20080602169036865, 0.0032640032004565, -0.5430164337158203, -0.25112250447273254, -0.439354807138443, -0.18190649151802063, 0.2901819348335266, 0.36357441544532776, 0.16894572973251343, 0.20680691301822662, -0.0777723640203476, 0.03610609844326973, 0.45249032974243164, 0.41697296500205994, -0.4641626179218292, -0.7541159987449646, 0.31616392731666565, -0.2198406308889389, -0.03612866997718811, -0.35553789138793945, 0.11677978932857513, -0.28828543424606323, -0.10282692313194275, -0.034026771783828735, -0.16015686094760895, 0.3081338107585907, -0.09646093100309372, 0.5200920104980469, 0.49302682280540466, 0.32556650042533875, 0.18699012696743011, -0.49143078923225403, 0.08937621861696243, -0.14917996525764465, 0.07012815028429031, 0.32799047231674194, -0.1850910633802414, -0.07999121397733688, -0.285064160823822, -0.08451269567012787, 0.519418478012085, -0.4463726878166199, -0.2581639885902405, 0.3120103180408478, 0.20170435309410095, 0.2146477997303009, 0.861798107624054, 0.13229165971279144, -0.16750609874725342, -0.30957016348838806, -0.11222180724143982, 0.09892159700393677, -0.10515622794628143, -0.05763751640915871, -0.1213906928896904, -0.3044309914112091, 0.21995852887630463, -0.29038113355636597, -0.0026710603851825, -0.33933138847351074, 0.10571157932281494, -0.09099303930997849, 0.09529240429401398, -0.17750151455402374, 0.06586305797100067, -0.18061593174934387, -0.17021699249744415, -0.14417290687561035, -0.17157596349716187, 0.13969114422798157, 0.03422555699944496, -0.006619465071707964, -0.40666449069976807, 0.18538431823253632, 0.44066277146339417, -0.3791458308696747, -0.06471554934978485, 0.22839103639125824, 0.3292273283004761, -0.21004009246826172, -0.7235435247421265, -0.15881431102752686, 0.3621717393398285, 0.5816201567649841, -0.05899081006646156, -0.219817653298378, 0.11150634288787842, -0.2857467234134674, 0.6467825174331665, -0.5086513757705688, -0.22181940078735352, 0.4169289171695709, -0.328382670879364, -0.21879155933856964, 0.04471466690301895, 0.09675885736942291, -0.2556998133659363, -0.1923569142818451, 0.0910019502043724, -0.0002466422156430781, 0.18038241565227509, 0.2613559663295746, -0.19255581498146057, 0.22308827936649323, 0.01888166181743145, -0.1329178661108017, -0.1036335676908493, -0.34474629163742065, -0.17829161882400513, 0.2637195289134979, 0.5393452644348145, 0.28181129693984985, 0.4963379204273224, -0.08333942294120789, -0.6203007698059082, -0.7554934620857239, -0.47412893176078796, 0.664201021194458, -0.8493035435676575, -0.0979275181889534, -0.12035032361745834, -0.3715510964393616, 0.25663772225379944, -0.368192195892334, 0.14389672875404358, 0.12761209905147552, 0.05553267523646355, 0.03598202019929886, -0.1852048635482788, -0.7589110136032104, 0.30860719084739685, 0.1067461147904396, -0.16664260625839233, -0.08798385411500931, 0.19378702342510223, 0.5117725729942322, -0.16874825954437256, 0.2658143937587738, 0.10095005482435226, 0.029337232932448387, -0.08963920176029205, -0.5362223386764526, -0.4007585346698761, 0.3935452401638031, -0.029623204842209816, 0.10957774519920349, 0.28979915380477905, -0.39278092980384827, 0.26223433017730713, -0.025499112904071808, 0.48831120133399963, 0.31572410464286804, -0.21545352041721344, -0.4048335552215576, 0.3742803931236267, 0.5111219882965088, -0.4707157015800476, 0.14802765846252441, 0.1253509223461151, -0.12240520864725113, -0.3031008839607239, 0.12912623584270477, -0.22070108354091644, 0.11643814295530319, -0.18375840783119202, 0.2948279082775116, 0.11762011796236038, 0.23231060802936554, -0.6715133786201477, -0.6062814593315125, -0.48988285660743713, -0.21607935428619385, 0.10479702800512314, 0.10352036356925964, -0.5781440138816833, 0.22671371698379517, 0.3273193836212158, -0.6651150584220886, 0.45704641938209534, -0.03158164024353027, -0.1479838788509369, 0.1562093198299408, -0.2745562791824341, 0.16564339399337769, 0.002713975729420781, 0.23805773258209229, 0.03362753614783287, -0.22303372621536255, 0.31566321849823, -0.45918914675712585, -0.6445387601852417, 0.21640174090862274, -0.007092307787388563, 0.1380622833967209, -0.05843851715326309, -0.09384237229824066, 0.12633615732192993, 0.09818848222494125, 0.3174465298652649, 0.0233926959335804, 0.3627544939517975, 0.09206341952085495, 0.21256884932518005, 0.1163167878985405, 0.13673938810825348, -0.2267698347568512, -0.17987601459026337, 0.038595326244831085, 0.036032918840646744, 0.2761775553226471, 0.1519167423248291, -0.4541796147823334, -0.35554900765419006, 0.1983378678560257, -0.6875877976417542, 0.019851073622703552, -0.6513928771018982, 0.08074500411748886, -0.3051873445510864, 0.29250526428222656, 0.21908923983573914, -0.16561254858970642, -0.03971844166517258, -0.31585246324539185, 0.10867923498153687, 0.030841026455163956, 0.4921760857105255, -0.050555408000946045, 0.0067747244611382484, -0.5436407923698425, -0.08763191848993301, 0.2692531943321228, 0.3768598735332489, 0.26027318835258484, -0.5321239829063416, -0.114164799451828, 0.35123082995414734, -0.20425158739089966, -0.6882511377334595, 0.3367091715335846, -0.30700674653053284, -0.36130982637405396, -0.3531249761581421, -0.5616936683654785, 0.012404805980622768, -0.07215936481952667, -0.09497173875570297, -0.3337557017803192, 0.34513017535209656, 0.13714759051799774, -0.23609818518161774, -0.3595173954963684, -0.18721508979797363, -0.13249151408672333, -0.1674622893333435, 0.10841858386993408, 0.23455671966075897, -0.10441403090953827, 0.43666717410087585, -0.3021480143070221, 0.03049987368285656, -0.4400026500225067, -0.9673199653625488, 0.13327746093273163, 0.09145508706569672, -0.25008901953697205, -0.1938340812921524, 0.7252420783042908, 0.04699592664837837, -0.33798927068710327, 0.37076497077941895, -0.31875351071357727, -0.19619201123714447, -0.4098649322986603, -0.724557101726532, -0.4498429298400879, -0.054492320865392685, 0.15247254073619843, 0.11021772027015686, 0.22408054769039154, 0.037153586745262146, -0.25493648648262024, 0.3115311563014984, 0.49805760383605957, -0.06935764849185944, -0.06813111901283264, 0.7539008855819702, -0.3902026116847992, -0.3893986642360687, 0.27992165088653564, 0.24898532032966614, -0.2664646804332733, 0.464396595954895, 0.46649229526519775, 0.25731492042541504, -0.035664089024066925, -0.5093013048171997, 0.012526584789156914, -0.48479753732681274, 0.2985179126262665, -0.15636160969734192, 0.15373985469341278, -0.31958794593811035, -0.007022420410066843, 0.6838240623474121, 0.0896243155002594, 0.13377529382705688, -0.010381405241787434, -0.06602606922388077, 0.05271255970001221, 0.10863810032606125, -0.5046249628067017, 0.007679215632379055, -0.20151451230049133, 0.0790783166885376, 0.21110157668590546, -0.22889362275600433, 0.33253252506256104, 0.3151904046535492, -0.17792180180549622, -0.3881303369998932, 0.10510572046041489, -0.6986877918243408, 0.13920602202415466, 0.11729362607002258, 0.12137899547815323, -0.10500988364219666, 0.27497515082359314, 0.3176220953464508, -0.009198571555316448, -0.052594732493162155, 0.581877589225769, -0.01090295985341072, 0.039242468774318695, 0.1815146654844284, 0.11726263910531998, -0.18607105314731598, 0.5154123902320862, 0.1391420066356659, -0.035619910806417465, 0.08267185091972351, -0.3639175295829773, -0.20169959962368011, -0.11589866131544113, -0.4178391695022583, 0.4096986949443817, -0.45902445912361145, 0.032825034111738205, -0.22044572234153748, -0.2921940088272095, 0.5254321098327637, -0.08625982701778412, -0.41851598024368286, 0.029627114534378052, -0.1907089650630951, 0.15192270278930664, -0.3225920498371124, -0.3625454306602478, 0.4669085443019867, -0.29841718077659607, -0.3561922013759613, -0.1583331823348999, -0.13135917484760284, 0.18879203498363495, 0.08549771457910538, 0.03435009345412254, 0.5439484119415283, -0.5495586395263672, 0.6286792755126953, 0.19803474843502045, -0.7271511554718018, 0.17288701236248016, 0.42380332946777344, 0.09261378645896912, 0.016155008226633072, -0.4494290053844452, 0.21392662823200226, 0.32566121220588684, -0.14149101078510284, -0.4749215841293335, -0.13877493143081665, 0.15318959951400757, 0.05372479930520058, -0.4453631043434143, 0.9005359411239624, -0.1413387656211853, 0.33801957964897156, 0.3219332695007324, 0.03346164897084236, 0.2496144026517868, -0.22726896405220032, -0.10026451200246811, -0.35187798738479614, -0.3469304144382477, -0.6221596002578735, -0.011964414268732071, 0.23188956081867218, 0.13874594867229462, -0.31608110666275024, -0.484016090631485, -0.02791120857000351, -0.10724565386772156, -0.5383971929550171, -0.14168322086334229, -0.6785818338394165, -0.38930240273475647, 0.19693759083747864, 0.4198019206523895, 0.053087491542100906, -0.1762608140707016, -0.4410514533519745, 0.07410906255245209, -0.9229698181152344, -0.08912791311740875, 0.26464346051216125, 0.12720094621181488, 0.3284655213356018, 0.2529536187648773, 0.33006128668785095, -0.10702919960021973, 0.489097535610199, -0.5022537708282471, 0.39440885186195374, -0.22919531166553497, 0.10671029984951019, -0.20708656311035156, 0.27939867973327637, -0.26498493552207947, -0.22272367775440216, 0.35305696725845337, 0.17483286559581757, -0.189631387591362, 0.08946530520915985, -0.02553008310496807, -0.4531671702861786, 0.4241284728050232, -0.11657339334487915, 0.10996272414922714, 0.19677864015102386, -0.5607160925865173, 0.24711759388446808, 0.34847429394721985, 0.26403242349624634, 0.5093621611595154, -0.37419071793556213, 0.18088741600513458, -0.2071341872215271, 0.2666545510292053, 0.020596515387296677, 0.26263660192489624, -0.36988916993141174, 0.00048230652464553714, -0.24334222078323364, 0.2962315082550049, -0.31175315380096436, 0.47215357422828674, -0.027705417945981026, -0.35277074575424194, -0.21739281713962555, -0.7215047478675842, -0.4209679961204529, -0.42346763610839844, -0.2544841468334198, 0.2755230963230133, -0.09840831905603409, -0.25017601251602173, -0.40565648674964905, 0.11276561766862869, 0.33606454730033875, -0.10897497087717056, 0.03686226159334183, 0.13027498126029968, 0.16207832098007202, -0.439572274684906, 0.23984642326831818, 0.2585427165031433, -0.27077263593673706, -0.41218116879463196, -0.4883642792701721, 0.28745904564857483, -0.038980334997177124, -0.3226057291030884, -0.6349933743476868, 0.27651116251945496, -0.8131466507911682, 0.2697538733482361, 0.05701974406838417, 0.010871104896068573, -0.24059534072875977, 0.19298212230205536, 0.2411816418170929, 0.8538447022438049, 0.13827994465827942, 0.5418654084205627, -0.4355933368206024, 0.2925747036933899, 0.041360121220350266, -0.20480503141880035, 0.03640744462609291, -0.30890950560569763, -0.010395687073469162, -0.572783887386322, -0.665315568447113, 0.5152500867843628, -0.4667526185512543, 0.03460291028022766, 0.08791041374206543, 0.17420533299446106, -0.12125135958194733, 0.042043041437864304, -0.17410580813884735, -0.4121646285057068, -0.12917731702327728, 0.41340142488479614, -0.3385745882987976, 0.5871151685714722, 0.12922923266887665, -0.21597838401794434, 0.38475582003593445, -0.31067460775375366, -0.45762237906455994, 0.10812016576528549, 0.23549985885620117, -0.21324484050273895, -0.2764107286930084, -0.46977657079696655, -0.4408595561981201, 0.06864297389984131, -0.4435955286026001, 0.21483801305294037, 0.41720589995384216, 0.038952697068452835, -0.24378226697444916, -0.4235685169696808, 0.15699945390224457, 0.26817256212234497, -0.1904584914445877, 0.36294296383857727, -0.6097492575645447, -0.1624768078327179, 0.9530874490737915, 0.7046694159507751, -0.10453671216964722, -0.5858728289604187, -0.42856529355049133, -0.6634119153022766, -0.270828515291214, 0.08647651225328445, -1.242213249206543, 0.15322071313858032, -0.07997799664735794, 0.263943612575531, 0.5172707438468933, 0.40457120537757874, -0.31012532114982605, 0.08038504421710968, 0.1330542266368866, -0.3093010485172272, -0.09280969947576523, -0.353879451751709, 0.0882708728313446, 0.380083829164505, -0.19170820713043213, -0.13719706237316132, -0.05221068114042282, 0.33586385846138, 0.13591736555099487, 0.4483047425746918, 0.07846155017614365, -0.3751485049724579, -0.294138640165329, 0.2928270101547241, -0.33311691880226135, -0.16918905079364777, -0.3958229720592499], "bias_tensor": [-0.1229807510972023, 0.18095530569553375, -0.02826714888215065, 0.10557076334953308, 0.0006741887191310525, 0.23313656449317932, 0.3466004431247711, 0.02923605777323246, -0.14042595028877258, -0.09638269245624542, 0.003267501015216112, 0.3749085068702698, 0.31517183780670166, 0.5147490501403809, 0.10228707641363144, -0.014604371041059494, 0.060555219650268555, -0.07362324744462967, 0.028029626235365868, 0.045083701610565186, -0.04111151024699211, -0.017824169248342514, -0.09454166889190674, 0.19162212312221527]}}}, "inbound_nodes": [[["td_dense1", 0, 0, {}]]]}, {"name": "noseq_gru", "class_name": "GRU", "config": {"name": "noseq_gru", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 48, "activation": "relu", "recurrent_activation": "hard_sigmoid", "use_bias": true, "reset_after": false, "Wz": [-0.4741710126399994, 0.9129765629768372, 0.012733327224850655, -0.17925074696540833, 0.7064846754074097, 0.20468880236148834, 0.5683085322380066, -0.03713836520910263, -0.3572753965854645, 0.1496664434671402, -0.10266369581222534, 0.7129436731338501, 0.6763454675674438, 0.33268314599990845, 0.0319829136133194, -0.9431499242782593, 0.11630741506814957, -0.09004552662372589, 0.23651954531669617, 0.44964298605918884, -0.05088160187005997, -0.4550248384475708, -0.41815924644470215, 0.1680755466222763, -0.08557195216417313, 0.051530446857213974, 0.028521833941340446, 0.15524892508983612, 0.05350345000624657, 0.5268730521202087, -0.04402004927396774, -0.13487142324447632, 0.012482085265219212, 0.5233756899833679, 0.47871777415275574, 0.09076708555221558, 0.057062335312366486, 0.3344930410385132, 0.3045230805873871, 1.0253175497055054, 0.4240514636039734, 0.18725816905498505, 0.349527508020401, 0.2465132176876068, -0.674263596534729, -0.7782995700836182, 0.25475460290908813, -0.022113895043730736, -0.02013644017279148, 0.32210323214530945, -0.03574651852250099, -0.8613936901092529, -0.04021385312080383, -0.4584294855594635, 0.08623755723237991, 0.7412620782852173, -0.3127221167087555, -0.5697620511054993, 0.11517845839262009, -0.7072120904922485, 0.18493664264678955, -0.3339618742465973, -0.19801554083824158, 0.012119932100176811, -0.13303707540035248, -0.8250900506973267, 0.4494379460811615, -0.42454221844673157, 0.34649458527565, -1.4084863662719727, -0.6809287071228027, 0.29757192730903625, -0.636386513710022, 0.21434418857097626, 0.06396327167749405, 0.18130254745483398, 0.5920834541320801, 0.2371158003807068, 0.5455037951469421, 0.6595323085784912, 0.35480746626853943, 0.38130301237106323, 0.16317583620548248, -0.27330759167671204, 0.732003390789032, 0.04857474938035011, 0.07931524515151978, 0.0847739651799202, -0.5883378982543945, -0.24782468378543854, 0.1372506022453308, -0.5821220278739929, 0.12447183579206467, -0.9686313271522522, -0.7105780839920044, -0.004417943302541971, -0.19826576113700867, 0.34555956721305847, -0.07676047086715698, -0.28965315222740173, -0.25112292170524597, 0.6041824817657471, 0.3888663649559021, 0.45695117115974426, -0.10960207134485245, -0.006895449478179216, 0.6042160391807556, 0.4606142044067383, 0.3603266179561615, 0.31371742486953735, -0.2171865701675415, -0.019482344388961792, 0.3865174353122711, -0.283206045627594, 0.25946399569511414, -0.30941349267959595, -0.32354843616485596, -0.0642976462841034, -0.6616148352622986, -0.1681801676750183, -0.6328001618385315, 0.1195877194404602, -0.16328825056552887, 0.2919873297214508, -0.03257526829838753, 0.3389471769332886, -0.04785449430346489, 0.04711948707699776, 0.26163432002067566, 0.7283774614334106, 0.6878024935722351, 0.05606834217905998, 0.14307861030101776, 0.007357405964285135, 0.2770231366157532, 0.6804412007331848, -0.05772017315030098, 0.1377069056034088, 0.7612251043319702, 0.42958563566207886, -0.902747392654419, -0.14030733704566956, 0.06060846522450447, -0.014127868227660656, -0.48820778727531433, 0.40387001633644104, -0.05861899256706238, 0.32040268182754517, -0.5242087841033936, 0.5492824912071228, 0.6236431002616882, -0.42271101474761963, -0.20510223507881165, -0.17267274856567383, -0.4018648564815521, 0.9326688647270203, 0.5154529213905334, 0.5345293283462524, -0.3993988037109375, -0.3251596987247467, 0.07339053601026535, -0.22576452791690826, 0.1919475495815277, 0.05938975512981415, -0.35218778252601624, -0.3717135190963745, -0.5421271920204163, -0.17926950752735138, -0.15487924218177795, 0.05147280544042587, -0.008188731968402863, 0.6337278485298157, 0.3522801399230957, 0.25062981247901917, 0.17454823851585388, -0.4871772825717926, -0.4458906650543213, 0.20729771256446838, -0.6060628294944763, 0.5240222215652466, 0.19102026522159576, 0.44542747735977173, -0.27089083194732666, -0.2572811245918274, -0.6901350021362305, -0.12408768385648727, -0.29109200835227966, 0.48825913667678833, -0.012970578856766224, -0.5901389122009277, 0.23299387097358704, 0.1365252286195755, -0.05558671057224274, 0.7310647368431091, -0.15460379421710968, 0.22745461761951447, -0.2513332664966583, 0.566813051700592, 0.281201034784317, -0.42265644669532776, -0.08018793165683746, -0.17351870238780975, -0.18297967314720154, 0.8888288736343384, 0.3166453242301941, 0.37724772095680237, -0.4901254177093506, 0.17184817790985107, 0.09075825661420822, -0.3385375738143921, 0.13584379851818085, 0.021692516282200813, -1.374044418334961, -0.7145942449569702, -0.2473210096359253, -0.14752554893493652, -0.29656267166137695, 0.3065679967403412, -0.10742828994989395, 0.0452398806810379, -0.20468637347221375, 0.37407320737838745, 0.2643798589706421, 0.3907058835029602, -0.026390932500362396, 0.13906802237033844, 0.7599377036094666, 0.6224851608276367, 0.28121501207351685, 0.32822903990745544, -0.4487420618534088, 0.29389673471450806, 0.44648540019989014, -0.43926921486854553, 0.4625989496707916, -0.4625363051891327, -0.6968302726745605, -0.543246328830719, -0.8159880638122559, -0.3869227170944214, -0.4307261109352112, 0.3171829879283905, 0.037139248102903366, 0.20433978736400604, 0.33189940452575684, 1.0367491245269775, 0.49778908491134644, 0.215044766664505, -0.34273573756217957, -0.08030681312084198, 0.15062426030635834, 0.5415124893188477, 0.41036278009414673, 0.700550377368927, -0.2615164518356323, -0.14583370089530945, 0.45066550374031067, -0.09647610783576965, 0.16474078595638275, 0.23433296382427216, -0.004353702533990145, -0.25857529044151306, -0.5346646904945374, 0.12267783284187317, -0.8950750827789307, 0.4437634348869324, -0.03851139545440674, 0.029968036338686943, -0.3126015067100525, 0.24000412225723267, 0.27975037693977356, 0.1113697737455368, -0.2339554876089096, 0.018652664497494698, -0.23040908575057983, 0.33933258056640625, 0.16464507579803467, 0.37472936511039734, 0.3535519540309906, -1.0178771018981934, 0.13799519836902618, 0.21934391558170319, 0.21582525968551636, 0.4312463402748108, 0.04538099467754364, -0.31546512246131897, -0.00393584743142128, 0.5109986066818237, -0.5408198833465576, 0.25763630867004395, 0.19293580949306488, -0.24225041270256042, -0.07130882143974304, 0.15318787097930908, -0.032819122076034546, -0.11304428428411484, -0.2461775839328766, 0.05176244303584099, -0.23294022679328918, 0.334008127450943, -0.018633956089615822, 0.20243051648139954, 0.11697592586278915, 0.03042960725724697, -0.6440204977989197, 0.8023166656494141, 0.2887602150440216, 0.14649242162704468, 0.13237322866916656, 0.4998665153980255, 0.6266690492630005, 0.03459415212273598, -0.06826316565275192, 0.20263193547725677, 0.1722641885280609, -0.15696914494037628, -0.7020929455757141, 0.23973041772842407, 0.3121298551559448, -0.4281190037727356, 0.18867015838623047, 0.38603726029396057, -0.815215528011322, 0.4667896330356598, -0.05011839419603348, 0.28835031390190125, -0.6112547516822815, -0.12389586865901947, -0.4615956246852875, 0.5724554061889648, 0.2282029688358307, 0.016885781660676003, 0.3217722475528717, -0.3921961784362793, -0.22686634957790375, -0.46988001465797424, 0.19011074304580688, -0.1586405634880066, 0.03255290165543556, 0.3878486156463623, 0.12298404425382614, 0.39122557640075684, 0.40790054202079773, 0.22120283544063568, 0.5185294151306152, -0.8663861155509949, 0.4815712869167328, 0.36719903349876404, -0.1900777369737625, -0.06275329738855362, -0.0653495043516159, 0.35665538907051086, -0.4867328405380249, 0.4181685447692871, -0.13965564966201782, 0.48616501688957214, 0.30169910192489624, 0.4414753019809723, -0.1657460331916809, 0.010358179919421673, 0.07800062000751495, 0.4014943540096283, -0.18751877546310425, -0.6234114170074463, 0.4656975567340851, -0.16266486048698425, 0.23382268846035004, -0.3053816556930542, -0.26411378383636475, -0.1884787231683731, 0.3004216253757477, 0.19256414473056793, 0.026730628684163094, -0.4116913676261902, -0.3539182245731354, -0.34935256838798523, -0.2764699161052704, 0.963030993938446, 0.015778284519910812, 0.3672032356262207, 0.0479862242937088, 0.666985809803009, -0.8595781922340393, -0.3949642479419708, -0.14744950830936432, 0.060084227472543716, -0.04130600392818451, -0.23902826011180878, -0.27084898948669434, 0.586457371711731, 0.02811126783490181, 0.05547530576586723, 0.3860129117965698, 0.12505115568637848, 0.016791213303804398, 0.6015332937240601, 0.371227502822876, 0.1040206253528595, -0.38561493158340454, 0.9066786766052246, 0.2889541983604431, -0.41685551404953003, -0.004640704020857811, -0.12338858097791672, -0.1784975230693817, -0.7309795022010803, 0.714329719543457, 0.11929137259721756, 0.619866132736206, 0.05005805194377899, 0.05178370326757431, -0.3253718912601471, -0.11087725311517715, 0.6250399947166443, 0.0060393912717700005, 0.5982624292373657, -0.13373762369155884, -0.5837264657020569, 0.37363192439079285, 0.08913036435842514, 0.23639583587646484, 0.30506712198257446, 0.059692759066820145, 0.6272991299629211, 0.2153310775756836, -0.24887073040008545, -0.00785655714571476, -0.16152578592300415, -0.7728949785232544, -0.6654347777366638, -0.069456085562706, -0.2037956714630127, -0.16704928874969482, 0.44661223888397217, -0.0034508430399000645, -0.18897269666194916, 0.08877500146627426, -0.3216876983642578, 0.3160044848918915, 0.1864728331565857, -0.33409860730171204, -0.5003383755683899, 0.3414454460144043, -0.10544508695602417, 0.34000885486602783, 0.5705651044845581, -0.01662631891667843, -0.03850499913096428, 0.10280947387218475, -0.8456299304962158, 0.3361038267612457, -0.3754965364933014, -0.2181990146636963, 0.1643872708082199, -0.32418400049209595, -0.25163355469703674, -0.2180444896221161, -0.07761639356613159, -0.12516145408153534, -0.2951909303665161, 0.022235386073589325, 0.15340152382850647, -0.05308281257748604, 0.03677455335855484, 0.052415791898965836, -0.07198306918144226, 0.02579496055841446, -0.025150462985038757, -0.08822065591812134, -0.1100635826587677, 0.08540782332420349, -0.27806833386421204, 0.05898522585630417, 0.10895369946956635, -0.1794462352991104, 0.21899230778217316, 0.12460606545209885, 0.05571797490119934, -0.08476435393095016, -0.23291316628456116, -0.5649397969245911, 0.4953041970729828, -0.020331455394625664, 0.3388788104057312, -0.04962332174181938, 0.7402303218841553, 0.5085521340370178, -0.43951475620269775, -0.45479822158813477, -0.00874375645071268, -0.31078630685806274, 0.5610968470573425, 0.3375963866710663, 0.44842320680618286, -0.577878475189209, -0.1967741996049881, 0.2449355572462082, -0.05355985835194588, 0.20283660292625427, -0.06645557284355164, 0.016324201598763466, -0.3837668299674988, -0.39676156640052795, -0.1577829271554947, -0.1630634367465973, 0.74069744348526, -0.02894751913845539, 0.04659650847315788, 0.03516717627644539, 0.18354222178459167, 0.3120307922363281, 0.2126336544752121, -0.38870173692703247, 0.04454465210437775, 0.15878017246723175, 0.2143235057592392, 0.6810774803161621, 0.4147835671901703, -0.030988458544015884, -0.35580435395240784, -0.06778430938720703, -1.0950859785079956, 0.09435312449932098, -0.4013543426990509, 0.0987265557050705, -0.699284553527832, -0.6436670422554016, 0.1613306999206543, -0.5497444868087769, 0.18526266515254974, 0.0012072481913492084, 0.8519273996353149, 0.293489933013916, -0.20592431724071503, -0.01575772650539875, -0.05683283135294914, -0.18332193791866302, 0.06899780035018921, 