{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": ["None", 100, 18], "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "mask", "class_name": "Masking", "config": {"name": "mask", "mask_value": -999}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "td_dense0", "class_name": "TimeDistributed", "config": {"name": "td_dense0", "layer": {"class_name": "Dense", "config": {"name": "dense_1", "units": 24, "activation": "relu", "use_bias": true, "kernel_tensor": [-0.006758695002645254, -0.007173669058829546, -0.01433024276047945, 0.004620300605893135, -0.004564427770674229, 0.003163245739415288, -0.0004361751489341259, 0.0016544836107641459, -0.0025483451317995787, -0.3930197060108185, 0.05736173689365387, -0.0007154055056162179, 0.004187028389424086, -0.020379960536956787, 0.0065963310189545155, -2.643711805343628, -0.00758029380813241, 0.000720114738214761, 0.24442052841186523, 0.13919377326965332, 0.021394312381744385, -0.10816075652837753, -0.024150973185896873, -0.045495983213186264, 0.28175368905067444, -0.914149820804596, -0.012553106993436813, 0.36908280849456787, 1.6664358377456665, -0.11700505763292313, 0.029018089175224304, 0.1234993264079094, 0.049408458173274994, 0.016680527478456497, 0.0021339308004826307, -0.06387484818696976, -0.18472975492477417, 0.10448441654443741, 0.18882985413074493, 0.017525887116789818, -0.057594574987888336, 0.3871305286884308, -0.28064221143722534, -0.009936408139765263, 0.00639112014323473, 1.4567005634307861, 0.18698272109031677, 0.024745173752307892, -0.01715330220758915, -0.4951563775539398, -0.0009664467070251703, 0.013339984230697155, 0.03346725553274155, -0.8978584408760071, -0.001009342260658741, -0.13295701146125793, 0.04429466277360916, 0.007108149118721485, 0.015361524187028408, 0.08632863312959671, -0.0392022468149662, 0.12416262924671173, 0.016016297042369843, -4.470206260681152, 0.813609778881073, -0.019775815308094025, -0.018333349376916885, 0.05072646215558052, 0.03588821738958359, 0.05099772661924362, -0.18808123469352722, 0.0529182143509388, 0.008451233617961407, 0.01183360256254673, -0.0017106058076024055, -0.0007775478297844529, 0.00682042958214879, 0.03822290152311325, -0.2596445679664612, 0.1047421246767044, 0.020331772044301033, 5.14017915725708, -1.1067403554916382, -0.009981800802052021, -0.00849159061908722, 0.12224533408880234, -2.232994556427002, -0.08608172088861465, -0.04497108608484268, 0.007790436968207359, -0.30509334802627563, 0.1399407535791397, -0.47904396057128906, 0.006915091071277857, 0.652991533279419, -0.3041641116142273, 0.06112309917807579, 0.0029623545706272125, 0.014511125162243843, 1.3865866661071777, -1.180558204650879, -0.09331223368644714, -0.11437172442674637, -0.03563699871301651, -0.11339709907770157, -0.008582658134400845, -0.016516052186489105, -0.0065277619287371635, -0.43416497111320496, 0.1821320652961731, 0.04901579022407532, -0.6883691549301147, 0.05615157261490822, 0.16335803270339966, 0.08234468102455139, 0.09807132929563522, -0.021459337323904037, 0.27896007895469666, -3.0963985919952393, -0.12343338876962662, 0.04705062136054039, 0.023280523717403412, 0.0770845115184784, 0.049588270485401154, -0.08283301442861557, -0.027930868789553642, -0.03114856593310833, 0.03878416493535042, 0.09859621524810791, -0.003257511416450143, -0.11483390629291534, -0.16373790800571442, -0.0032490896992385387, 0.0937284305691719, 0.14306260645389557, 0.9344459176063538, 0.8686711192131042, 0.060153111815452576, 0.02128789760172367, -1.6931321620941162, 0.14513827860355377, -0.15200351178646088, 0.001752436743117869, -0.015082511119544506, 0.053369272500276566, -0.14213629066944122, -0.024463040754199028, 0.01723286882042885, -0.02495656907558441, -0.05433150380849838, 0.05867992714047432, -0.042843014001846313, -0.022189421579241753, 0.7868802547454834, -0.3670714795589447, 1.1875178813934326, 0.025718916207551956, 0.3514896631240845, -0.1014053076505661, 0.02543298713862896, -0.00013729522470384836, -0.04017987847328186, -0.03595428541302681, 0.009817698039114475, 0.241291344165802, -0.012501572258770466, 0.007798245642334223, 0.04026379436254501, -0.020068777725100517, 0.13402539491653442, -0.021951409056782722, 5.744053840637207, 0.6862226724624634, 0.0227943304926157, -0.013735516928136349, -0.05050775781273842, 0.03787801414728165, -0.002874485682696104, -0.011571444571018219, -0.0013687333557754755, -0.035131096839904785, 0.05891243740916252, 0.21188411116600037, -0.01745106838643551, 0.027528638020157814, 0.026819897815585136, 0.025970350950956345, 0.013839170336723328, 0.35126543045043945, -3.856109619140625, -0.4816380739212036, 0.00645231269299984, -0.00035315335844643414, -0.00907879788428545, 0.010784345678985119, 0.005734469275921583, -0.023699892684817314, 0.025499684736132622, -0.2888762056827545, 0.12314023822546005, 0.15206597745418549, -0.15325994789600372, 0.04883039742708206, 0.12141715735197067, 0.0358264334499836, 0.1662178486585617, 0.026099836453795433, -1.927582025527954, -0.8097748160362244, 0.031182413920760155, 0.020713908597826958, 0.052907299250364304, 0.038396745920181274, -2.3467814922332764, 0.06953612715005875, -0.22897091507911682, -0.04016633331775665, 0.02162354812026024, 0.33273038268089294, -0.054909687489271164, -0.005567764863371849, 0.018791567534208298, 0.003926294390112162, 0.05066760629415512, -0.18487142026424408, -3.973071336746216, -0.07029788941144943, 0.012651645578444004, -0.0004913259181194007, -0.06519871950149536, 0.07689963281154633, 0.010015244595706463, -0.021549995988607407, 0.004618028644472361, 0.6309418082237244, -0.621405303478241, 0.057013604789972305, 0.13820911943912506, -0.07584676891565323, -0.0814858004450798, 0.00955179613083601, 0.12910687923431396, 0.017084375023841858, 2.45597505569458, 1.2885425090789795, 0.11196762323379517, -0.05575354024767876, 0.0026593534275889397, 0.1803676187992096, 0.008863520808517933, -0.06134307384490967, 0.028140438720583916, 0.12926611304283142, -0.07934416830539703, -0.027971213683485985, -0.062452301383018494, 0.05815591290593147, 0.058866702020168304, -0.07501719146966934, 0.11548814922571182, 0.050691358745098114, -0.7237129211425781, 1.8599492311477661, 0.05455636978149414, 0.5881879329681396, 0.05751538276672363, -0.07646689563989639, -0.037506189197301865, -0.04534686729311943, -0.002042230451479554, 0.01840631663799286, 0.019049473106861115, 0.03077218122780323, -0.0568770132958889, -0.005398266948759556, 0.008524932898581028, -0.4944862723350525, 0.14935532212257385, -0.014723630622029305, 0.37984326481819153, -2.0156073570251465, -0.08100640773773193, -0.022805793210864067, 0.022667376324534416, 3.8453779220581055, -0.04799271002411842, 0.04564335569739342, 0.1229054182767868, -0.3554443120956421, 0.08943282812833786, -0.7773067951202393, -0.002133596921339631, -0.13337485492229462, 0.24036096036434174, 0.034167200326919556, -0.19568204879760742, -0.037871792912483215, -0.5036604404449463, -1.0142759084701538, -0.033788032829761505, 0.005371646955609322, -0.004828776232898235, -0.08248522877693176, 0.0037749570328742266, -0.023501383140683174, 0.1357809156179428, 0.05642158165574074, -0.09045664221048355, 0.05727658048272133, 0.015631053596735, -0.1038561537861824, -0.0840698778629303, 0.4935799837112427, -2.150383949279785, -0.04222148284316063, 2.088345527648926, 1.306058406829834, -0.14036060869693756, 0.031128371134400368, 0.07839743047952652, 0.25564277172088623, -0.25916340947151184, -0.19256943464279175, -0.10063424706459045, 0.20897340774536133, -0.06823877990245819, 0.00025526632089167833, 0.1635783314704895, 0.00597353046759963, -0.15525682270526886, -0.02533533051609993, -1.4076447486877441, -0.0029216224793344736, 1.364073395729065, -3.2696499824523926, -0.01648767665028572, 0.07682796567678452, 0.046353209763765335, -0.1756839007139206, 0.17914871871471405, 0.030681494623422623, 0.04763316735625267, 0.1893301010131836, -0.04082607477903366, 0.05727751553058624, 0.1379399597644806, -0.027681415900588036, -0.11389646679162979, -0.014797876589000225, 0.047111768275499344, -1.0834060907363892, 0.5785601139068604, 0.7380695939064026, 0.07441972196102142, 0.020389888435602188, -0.06131394952535629, -0.2541916072368622, 0.02039739303290844, -0.03291035443544388, 0.02393941394984722, 0.3682399094104767, 0.12245911359786987, -0.17917367815971375, 0.419333815574646, 0.06370887160301208, -0.1037994921207428, 0.08410049229860306, 0.04998209327459335, 0.18253298103809357, 2.4135849475860596, 0.4638557434082031, 0.030273225158452988, -0.006304479669779539, -0.007943821139633656, 0.019735056906938553, 0.004645791836082935, -0.14905065298080444, 0.09246204048395157, 0.21732546389102936, -0.10784240067005157, 0.04483065754175186, 0.19954635202884674, -0.01839255727827549, -0.1010940819978714, -0.04372425377368927, 0.31561240553855896, -0.012850405648350716, -3.0862648487091064, -0.5229409337043762, 0.03326117619872093, -0.035732436925172806, -0.07614961266517639, -0.05366232618689537, -0.06122421473264694, 0.2254834622144699, -0.08871636539697647, 0.13847561180591583, -0.03356300666928291, -0.4029274582862854, -0.40163886547088623, -0.08228836953639984, -0.11437956243753433, 0.03021346405148506, 0.3676820397377014, -0.022029973566532135, -0.10781410336494446, 0.31842342019081116, 0.07393283396959305, -0.00855297688394785, -0.03238470479846001, -0.19567544758319855, -0.4277020990848541, -0.0682196319103241, 0.04136792570352554, 0.04514353722333908, 0.10009936988353729, 0.08973551541566849, 0.014976589940488338, 0.046760257333517075, -0.043515413999557495, -2.158061981201172, 0.19737373292446136, 0.020704884082078934, -0.42213526368141174, -1.0165094137191772, -0.017303425818681717, 0.04534359648823738, 0.08429206907749176, 0.087931789457798, 0.021417807787656784, -0.059748612344264984, 0.10769166052341461], "bias_tensor": [-1.2580358982086182, 1.002890706062317, 0.14386828243732452, -0.5637583136558533, 0.2662682831287384, -0.780542254447937, -0.08077190816402435, -0.2312251776456833, -0.5402747988700867, 1.2221336364746094, -0.5484941601753235, -0.0649891048669815, -0.6226533055305481, 0.45635533332824707, -0.7077973484992981, -0.2902810871601105, 0.1430245339870453, -0.3790281116962433, 0.2433704137802124, -0.043864913284778595, -1.3463908433914185, -0.5986919403076172, -0.05199531465768814, -0.48214566707611084], "feature_scaling": [{"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_PROBNNe", "offset": 0.030422654002904892, "scale": 0.14616194367408752}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_PROBNNghost", "offset": 0.11401314288377762, "scale": 0.23914359509944916}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_PROBNNk", "offset": 0.15336082875728607, "scale": 0.28137722611427307}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_PROBNNmu", "offset": -0.9374123215675354, "scale": 0.26967713236808777}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_PROBNNp", "offset": 0.1217692643404007, "scale": 0.24534550309181213}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_PROBNNpi", "offset": 0.6797865033149719, "scale": 0.3665015995502472}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_P", "offset": 12336.2587890625, "scale": 15372.3310546875}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_PT", "offset": 684.4905395507812, "scale": 656.24853515625}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_Charge", "offset": 0.011527227237820625, "scale": 0.9999336004257202}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_BPVIP", "offset": 1.2934150695800781, "scale": 5.897713661193848}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_BPVIPCHI2", "offset": 753.9222412109375, "scale": 11017.62109375}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_SumBDT_ult", "offset": -31.718950271606445, "scale": 17.383716583251953}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_VeloCharge", "offset": 0.9702540636062622, "scale": 0.14005929231643677}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_IP_trMother", "offset": 2.4735429286956787, "scale": 6.123851299285889}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_diff_z", "offset": 9.262086868286133, "scale": 74.80217742919922}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_P_proj", "offset": 10589410.0, "scale": 17551046.0}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_cos_diff_phi", "offset": -0.03754472732543945, "scale": 0.7110063433647156}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_diff_eta", "offset": 0.11017335951328278, "scale": 1.0557432174682617}]}}}, "inbound_nodes": [[["mask", 0, 0, {}]]]}, {"name": "td_dense1", "class_name": "TimeDistributed", "config": {"name": "td_dense1", "layer": {"class_name": "Dense", "config": {"name": "dense_2", "units": 24, "activation": "relu", "use_bias": true, "kernel_tensor": [-1.0617977380752563, -0.2730705738067627, -0.08816421031951904, -0.038838017731904984, -0.0667317733168602, -0.5065516233444214, -0.08135004341602325, 0.5097344517707825, 0.2753998935222626, 0.7815512418746948, 0.3920794427394867, -0.12588700652122498, -0.05153091251850128, 0.2110542207956314, -0.0968446284532547, 0.3132990002632141, -0.5898248553276062, -0.2820786237716675, -0.04680338129401207, -0.13390125334262848, 0.32880982756614685, -0.14957986772060394, -0.13577041029930115, -0.1473459005355835, 1.3246963024139404, -0.3808728754520416, -0.28832948207855225, 0.24748851358890533, -0.20968936383724213, -0.164886474609375, 0.021708251908421516, 0.07190103828907013, 0.3005599081516266, 0.4522936940193176, 0.007130015175789595, 0.5955259799957275, 0.07771461457014084, 0.06276047974824905, -0.08350639045238495, -0.07968532294034958, 0.4459473192691803, 0.1971176564693451, -0.07079701870679855, -0.105586476624012, -1.1833091974258423, 0.053939227014780045, 0.3269979953765869, -0.3346332907676697, -1.1769436597824097, 0.038337212055921555, -0.2497396022081375, -0.14653310179710388, -0.2474910020828247, 0.34188011288642883, -0.029766419902443886, 0.7007233500480652, 0.13607540726661682, 0.30399635434150696, -0.7911737561225891, 0.13275299966335297, 0.40573668479919434, -0.19037599861621857, -0.0883009135723114, -0.25767698884010315, -0.3191882371902466, 0.07507862150669098, -0.1788206249475479, 0.3029506802558899, -0.6032512187957764, 0.39630424976348877, 0.03247109055519104, -0.28815388679504395, 0.7016763091087341, 0.1870518922805786, -0.37138909101486206, -0.48619431257247925, -0.5397331714630127, 0.2099851816892624, 0.04831169545650482, 0.03561678156256676, -0.17239722609519958, -0.8965879678726196, 0.026826471090316772, 0.7049254179000854, 0.1297711431980133, 0.24023747444152832, -0.11404259502887726, -0.6472133994102478, 0.5524151921272278, -1.5555312633514404, -0.22312051057815552, -0.0033471854403615, 0.58922278881073, 0.43140432238578796, -0.41636618971824646, 0.14028529822826385, 0.18725284934043884, -0.14837206900119781, 0.058934248983860016, 0.075194351375103, -0.14877179265022278, -0.01275139581412077, 0.2724507451057434, 0.13729427754878998, 0.11736233532428741, -0.12703140079975128, -0.9823669791221619, 0.11620531231164932, 0.31780675053596497, 0.2431327998638153, -0.06517428159713745, 0.08157448470592499, 0.037745703011751175, -0.33177897334098816, -0.36081019043922424, 0.5407999157905579, 0.32573872804641724, -0.013984673656523228, 0.16383129358291626, 0.13424888253211975, 0.8658488392829895, 0.10430009663105011, -0.00020649132784456015, 0.43525248765945435, 0.43292686343193054, 0.4063546657562256, -0.20044220983982086, 0.12048207223415375, 0.149539515376091, -1.2199034690856934, 0.14091020822525024, 0.6070740222930908, 0.08290213346481323, -0.40446361899375916, 0.2055184245109558, -0.34252944588661194, -0.17742854356765747, -0.22432449460029602, 0.19804425537586212, 0.13309724628925323, 0.26888298988342285, 0.4565086364746094, -0.11191833019256592, -0.32581081986427307, -1.9260939359664917, 0.1131080910563469, -0.0008413036703132093, 0.30325013399124146, 0.2389492243528366, -0.10048037767410278, -0.08566869050264359, 0.2211254984140396, -0.053736746311187744, 0.2672382593154907, 0.30887746810913086, -0.10205299407243729, -0.8386328816413879, 0.23276199400424957, 0.16848625242710114, 0.22595399618148804, 0.13244988024234772, -0.2318906933069229, -0.29457327723503113, -1.412258267402649, 0.3234010636806488, 0.15561063587665558, 0.05335633456707001, 0.4127348065376282, -6.335351467132568, 0.10683368891477585, 0.04162883013486862, 0.3416135609149933, 0.07247654348611832, -0.2485211044549942, 0.05268153175711632, 0.0643245279788971, 0.018034538254141808, -1.1313093900680542, 0.2565250098705292, 0.07338213175535202, 0.4441641569137573, -0.14470748603343964, 0.04213716462254524, -0.0280745942145586, 0.32177144289016724, 0.005603121593594551, -0.025195317342877388, 0.05276506394147873, -0.3050056993961334, 0.19918030500411987, 0.0648830384016037, 0.005003298632800579, 0.18305237591266632, -0.025882722809910774, -0.31975167989730835, -0.285602331161499, -0.3210310935974121, -0.11379232257604599, 0.057987041771411896, -0.28033512830734253, -0.0018303031101822853, -0.4404107928276062, 0.05825687199831009, -0.1516336351633072, -0.3735959231853485, -0.06210600957274437, -0.03603077307343483, -0.21906054019927979, -0.13717246055603027, -0.2472275048494339, -0.09921283274888992, -0.4223879873752594, -0.23884588479995728, -0.16037064790725708, -0.0714489296078682, -0.38549795746803284, -1.9739084243774414, 0.018350953236222267, -0.12079112976789474, 0.0990310087800026, 0.2317141592502594, 0.07831699401140213, 0.08840089291334152, 0.06444598734378815, 0.15029622614383698, 0.9161461591720581, -0.9738900661468506, -0.24633732438087463, 0.16773253679275513, -0.2367352694272995, 0.2775821387767792, -0.019697781652212143, 0.0785956159234047, 0.05521203577518463, 0.354930579662323, 0.11693820357322693, -0.22509944438934326, 0.06778962165117264, 0.13799147307872772, -0.3750050365924835, -0.12196197360754013, 0.4951116442680359, 0.21111196279525757, 0.28368839621543884, -0.18783298134803772, 0.14056794345378876, 0.022467371076345444, 0.07091474533081055, -0.31934046745300293, 0.037821970880031586, -0.12957505881786346, 0.1781635284423828, -0.6566524505615234, 0.11044083535671234, 0.24327930808067322, -0.03601677715778351, 0.4241299331188202, -0.2033020406961441, 0.36959630250930786, -0.2512618601322174, 0.13712124526500702, -0.4225060045719147, 0.07068429887294769, 0.3927745521068573, -1.6301181316375732, 0.41533100605010986, 0.07874367386102676, -0.1147448942065239, 0.07594607770442963, 0.6258729696273804, -0.1291789710521698, 0.03444880619645119, 0.026874512434005737, -0.29847025871276855, 0.13671782612800598, 0.07089681178331375, 0.1794721484184265, -0.09052986651659012, 0.2608153223991394, -1.3838967084884644, 0.13972410559654236, -0.35983672738075256, -0.06218241900205612, 0.04233787581324577, 0.15426579117774963, -0.12283582985401154, -0.18048709630966187, -0.8163576126098633, -3.894540548324585, -0.23637019097805023, -0.14601679146289825, -0.6953634023666382, 0.7535802721977234, -0.01576288230717182, 0.2111053466796875, -0.07947548478841782, -0.032175611704587936, 1.3295122385025024, -0.3654085099697113, 0.08486441522836685, -0.864109992980957, 0.11566554754972458, -0.16777434945106506, 0.5546734929084778, 0.1232316866517067, -0.8586099743843079, -0.3341803252696991, -0.029144881293177605, -0.10475187748670578, -0.2230951488018036, -0.042074158787727356, 0.029274841770529747, -3.289454698562622, -0.47877901792526245, -0.1942606419324875, 0.57281893491745, 1.1231621503829956, 0.28199493885040283, 0.17758534848690033, -0.1214238703250885, -0.012075148522853851, -0.3662525713443756, 0.21378715336322784, -0.0726621225476265, 0.5567426681518555, -0.11156276613473892, -0.37383705377578735, 0.6971409320831299, -0.19160042703151703, -3.4409351348876953, -0.2576030492782593, -0.03850313648581505, -0.29938679933547974, 0.11128230392932892, -0.12879739701747894, 0.11368077248334885, -1.9101797342300415, 0.0267317034304142, -0.10490891337394714, -0.0033376903738826513, -0.009187175892293453, -0.3957105278968811, -0.01564069837331772, 0.004652622155845165, -0.04046313464641571, 0.9634875059127808, -0.13533632457256317, -0.15481118857860565, -0.10929769277572632, 0.4812411963939667, -0.5024181008338928, 0.1264120191335678, -0.09950543195009232, -0.7134323120117188, -0.5116783976554871, 0.31063157320022583, 0.3395307958126068, -0.2887762188911438, 0.09131748229265213, 0.044812824577093124, -0.12622398138046265, -0.09458450973033905, -0.06497887521982193, 0.47872430086135864, 0.023087482899427414, 0.16180026531219482, -0.18777050077915192, 0.057692889124155045, 0.040977172553539276, -1.773239016532898, 0.6048722863197327, 0.10467305034399033, 0.9165512323379517, 0.012347172014415264, -0.293022096157074, 0.4057829976081848, -0.06072908639907837, -0.27542299032211304, -0.15822654962539673, 0.010147495195269585, 0.07831314951181412, 0.5641720294952393, 0.2829291820526123, 0.046738382428884506, 1.3382327556610107, 0.03540446609258652, -0.0018281082157045603, -0.45848625898361206, 0.21589349210262299, 0.42529910802841187, -0.07579899579286575, -1.1095924377441406, -0.05390985682606697, -0.1268487423658371, -0.23988695442676544, 0.14940960705280304, -0.2955527603626251, 0.12213478237390518, 0.18902906775474548, 0.1955760419368744, -0.023137109354138374, -0.16393642127513885, 0.05198690667748451, 0.6787283420562744, -0.2686562240123749, -0.31139740347862244, -0.606007993221283, -0.004848536103963852, 1.8166428804397583, 0.49827829003334045, -0.1093297153711319, -0.04156645014882088, 0.20268316566944122, 0.16941550374031067, 0.0655234232544899, 0.15993092954158783, -0.321169376373291, -0.7810104489326477, 0.37313759326934814, -0.1904338002204895, 0.4877582788467407, 0.06419245898723602, 0.21419422328472137, 0.05413433164358139, -0.1223994717001915, 0.6293790340423584, 0.18041342496871948, 0.11737440526485443, 0.08132307231426239, 0.21688921749591827, -0.08098599314689636, -0.11141342669725418, 1.7372649908065796, 0.008688800036907196, -0.058130159974098206, 0.24368488788604736, 0.9709572792053223, 0.10373838990926743, -0.645557701587677, -0.05097681283950806, 0.02676703780889511, -0.7718464136123657, 0.21408270299434662, 0.012603473849594593, 0.3447439968585968, 0.1820821911096573, -0.23961730301380157, 0.5041609406471252, 0.10703660547733307, 0.06896645575761795, 0.38600313663482666, 0.028413627296686172, 0.35912588238716125, -0.5302000045776367, -0.5364860892295837, 0.23852114379405975, 0.6363224387168884, 0.055617161095142365, 0.1779889464378357, 0.07886544615030289, -0.4613320231437683, -0.03776855766773224, -0.19947557151317596, 0.10215778648853302, 0.06001489236950874, -0.39815855026245117, 0.5878129005432129, -0.10080201923847198, -0.11377884447574615, -0.6409097909927368, -0.02009444870054722, -0.1328672617673874, -0.23128849267959595, 0.16955476999282837, 0.4255981147289276, -1.2791714668273926, -0.6660304665565491, -0.019117321819067, -0.11422126740217209, 0.07134296745061874, -0.7115488648414612, 0.0007401063339784741, 0.043645378202199936, 0.06624329835176468, 0.05496445298194885, 0.11050797253847122, 0.11707395315170288, 0.3763948976993561, 0.1310836523771286, 0.7807793021202087, 0.14208665490150452, 0.14358843863010406, -0.42449745535850525, 0.09503813832998276, -8.687563240528107e-05, -0.21918368339538574, -0.28595033288002014, -0.21112586557865143, -0.08111823350191116, -0.8888059258460999, 0.3504736125469208, 0.011126525700092316, 0.21351440250873566, -0.08599469065666199, -4.074982166290283, -0.2516147792339325, 0.025399480015039444, 0.4953366219997406, -1.2527717351913452, 0.255224347114563, 0.27108034491539, 0.24388283491134644, 0.25375548005104065, 0.5200476050376892, -0.4655616283416748, -0.17788416147232056, -1.2387909889221191, -0.015582216903567314, -0.2577614486217499, -0.41157254576683044, 0.2770735025405884, 0.2974773943424225, 0.11602232605218887, 0.13949330151081085, 0.5260652899742126, -0.20578430593013763, 0.24486397206783295, -0.2682707905769348, -1.411188006401062, 0.18850986659526825, 0.2196250706911087, 0.05052906274795532, -0.18796928226947784, -0.07466316968202591, 0.06224728748202324, -0.062276847660541534, -0.03894767537713051, -0.25132566690444946, -0.5403475761413574, 0.0032090372405946255, 0.11932481080293655, -0.48058944940567017, -0.17855237424373627, -0.13785888254642487, -0.2341054081916809, 0.06262053549289703, 0.17116302251815796, 0.44911324977874756, -0.5194391012191772, -0.31812137365341187, -0.1552073210477829, 0.3423852324485779, 0.9990269541740417, 0.16433830559253693, -0.019594740122556686, -0.8272824883460999, 0.08346060663461685, 0.2894313335418701, 0.057816483080387115, -0.8282338380813599, -0.35961616039276123, 0.6730666756629944, -0.3526221215724945, 0.03482196480035782, 0.4147464334964752, -0.22824685275554657, -0.13306725025177002, 0.07638174295425415, 0.10303601622581482, 0.13692127168178558, -0.2714388370513916, 0.20417296886444092, -0.009060196578502655, 0.16344095766544342, 0.17032334208488464, 0.07367129623889923], "bias_tensor": [0.02881649322807789, 0.22120611369609833, -0.3852701783180237, -0.9299108982086182, 0.06257157027721405, -0.8896318674087524, 0.3875182569026947, -0.02426881343126297, -0.1693895310163498, -0.06389479339122772, -0.15993618965148926, 0.24242247641086578, 0.464557945728302, 0.4659654498100281, 0.28510770201683044, -0.4138227701187134, -0.14442038536071777, -0.08396890014410019, 0.38966599106788635, 0.14409403502941132, 0.10565485060214996, 0.3568042516708374, 0.34263432025909424, -0.3770190477371216]}}}, "inbound_nodes": [[["td_dense0", 0, 0, {}]]]}, {"name": "td_dense2", "class_name": "TimeDistributed", "config": {"name": "td_dense2", "layer": {"class_name": "Dense", "config": {"name": "dense_3", "units": 24, "activation": "relu", "use_bias": true, "kernel_tensor": [0.3116018772125244, -0.008785933256149292, -0.4359837472438812, 0.1911255568265915, -0.49384185671806335, 0.21072760224342346, 0.2766287326812744, -0.03963620215654373, 0.2284068912267685, -0.34511321783065796, 0.15317431092262268, 0.008236215449869633, 0.15462006628513336, -0.2539403736591339, -0.263918936252594, -0.12309989333152771, -0.17338445782661438, -0.42489564418792725, 0.29013872146606445, 0.47878527641296387, -0.07889028638601303, -0.21987904608249664, -0.42598608136177063, -0.1000414490699768, -0.673998236656189, -0.15433689951896667, -0.08609188348054886, -0.17870919406414032, 0.48698359727859497, 0.21787777543067932, -2.0227484703063965, -0.4259076714515686, 0.3287198543548584, 0.0968095138669014, 0.031153714284300804, -0.20525403320789337, -0.509611189365387, 0.13852550089359283, 0.7144606113433838, -0.9797465801239014, -0.28855931758880615, 0.2802715599536896, -0.2760385274887085, -0.6568349599838257, -0.2812694311141968, 0.5639046430587769, -0.4654095470905304, -0.39437878131866455, 0.18681757152080536, 0.3569898009300232, 0.0418337844312191, 0.5920566916465759, 0.4458666443824768, 0.6660775542259216, -0.11401895433664322, -0.4783113896846771, -0.13191290199756622, -0.28437188267707825, 0.22326096892356873, -0.41153573989868164, -0.33872491121292114, -0.44725173711776733, -0.059721093624830246, 0.5894649624824524, -0.18719787895679474, -0.15878453850746155, -0.439588338136673, -0.2635045051574707, -0.5258708000183105, 0.3855319619178772, -0.2471153736114502, -0.14245760440826416, -0.37268897891044617, 0.399179607629776, -0.557243287563324, 0.1419224590063095, 0.06672091782093048, 0.47211623191833496, 0.11416203528642654, -3.5311179161071777, 0.269426167011261, -0.36937010288238525, 0.26325538754463196, -0.058129649609327316, -0.29571714997291565, -0.1868378221988678, -0.15270455181598663, 0.14815419912338257, 0.01753387041389942, -0.1956324428319931, 0.01712910644710064, -0.2880397140979767, -0.474801242351532, -1.014157772064209, -0.024253850802779198, 0.39053407311439514, -0.15772880613803864, -0.3152664005756378, 0.17216405272483826, -0.6684706807136536, -0.1410585641860962, -0.4364244043827057, -0.09888719022274017, 1.616386890411377, 0.002611403586342931, -0.08107337355613708, 0.1411227285861969, 0.2428995668888092, 0.49374863505363464, 0.5451449155807495, -0.3555338978767395, 0.19514094293117523, -0.13796229660511017, 0.4319344162940979, -0.1596398651599884, 0.055835820734500885, 0.07202263921499252, 0.20046930015087128, 0.28301531076431274, 0.11926945298910141, -0.05370986461639404, -0.5174048542976379, -0.3478207290172577, 0.2226768583059311, -0.4884866178035736, 0.09715632349252701, 0.32446610927581787, 0.06668847054243088, 0.2889389097690582, 0.5486322045326233, 0.45041540265083313, -0.15956628322601318, -0.5946146249771118, 0.2423820197582245, 0.014108363538980484, 0.290417343378067, -0.15861926972866058, 0.004814193584024906, 0.00551262404769659, 0.007915397174656391, 0.20078428089618683, 0.0014712668489664793, -0.10603596270084381, -0.1493668407201767, 0.2453063428401947, -0.45634424686431885, -0.06589778512716293, -0.9400132894515991, -0.42847344279289246, -2.4305901527404785, -0.10661673545837402, 0.7066205143928528, -0.1523910015821457, 0.21828393638134003, -0.22617875039577484, -0.16008418798446655, 0.16087748110294342, 0.770224928855896, 0.016467133536934853, 0.7518869042396545, 0.5246922373771667, 7.939022907521576e-06, 0.33161094784736633, -0.2599848806858063, -0.22632403671741486, 0.1369314342737198, -0.2630678415298462, 0.056300751864910126, -0.04831641912460327, 0.2443811297416687, -0.5999952554702759, 0.2604656219482422, -0.10223635286092758, 0.2669515609741211, 0.7113702893257141, -1.75566565990448, 0.22632671892642975, 0.1384071558713913, 0.37404921650886536, -0.20160439610481262, -0.13521459698677063, -0.3995751738548279, -0.2914186716079712, 0.28127872943878174, -0.10350553691387177, 0.021781940013170242, 0.06575221568346024, 0.10042273253202438, 0.1011277511715889, 0.1230989396572113, -0.44279158115386963, -0.0499526672065258, -0.21707424521446228, -0.502121090888977, -0.09103979915380478, -0.08607294410467148, 0.1868436634540558, -0.305785208940506, -0.3462638556957245, -0.08516858518123627, -0.20359256863594055, 0.4176332950592041, 0.4087488651275635, 0.08041714131832123, 0.5858327746391296, 0.11723550409078598, -0.12637339532375336, -0.2275741994380951, -0.043146952986717224, -0.035705018788576126, 0.34204572439193726, 0.01595114730298519, -0.06832894682884216, 0.016587940976023674, -0.015262028202414513, 0.019631177186965942, -0.08053794503211975, -0.04018804430961609, -0.33340030908584595, -0.16940240561962128, -0.14551419019699097, -0.23430204391479492, -0.39792531728744507, -0.21747846901416779, -0.2088751494884491, 0.10705796629190445, 0.04219810292124748, -0.21319060027599335, -0.19150397181510925, -0.05470502749085426, -0.14121265709400177, -0.08914550393819809, 0.03238506242632866, -0.19802089035511017, 0.029190827161073685, 0.045397382229566574, -0.30326971411705017, -0.24744801223278046, -0.3141629099845886, -0.33107060194015503, 0.08278418332338333, 0.06980174779891968, -0.28659334778785706, 0.2106170803308487, -0.8430758118629456, 0.2491949200630188, -0.11600210517644882, 0.1294003278017044, 0.2876048982143402, 0.17339275777339935, 0.16571566462516785, 0.093856580555439, 0.000628642097581178, 0.15937377512454987, -0.16021330654621124, 0.28709936141967773, -1.1048957109451294, -0.19270257651805878, 0.0477118119597435, 0.46579501032829285, 0.7601255774497986, -0.5943219065666199, -0.3041515052318573, -0.23550695180892944, 0.1358373910188675, 0.5292571187019348, 0.005069526843726635, 0.7004937529563904, -0.451325386762619, 0.8889411091804504, -0.33335867524147034, -0.47949859499931335, -0.05518423393368721, -0.004198224283754826, -0.39133286476135254, -0.41007348895072937, -0.6288002729415894, -0.05307907983660698, 0.11838696897029877, -0.11483056098222733, -0.11202020198106766, -0.09691999107599258, -0.6276057958602905, -0.22297780215740204, -0.09745074063539505, -0.9468082189559937, 0.05460427701473236, 0.1002248004078865, 0.13990518450737, 0.46797260642051697, -0.28187525272369385, 0.07443511486053467, -0.3673793375492096, 0.6386146545410156, 0.18949802219867706, -0.2408757209777832, 0.26394447684288025, -0.8181487321853638, 0.03705502673983574, -0.2618170976638794, -0.6894726753234863, 0.05331307277083397, 0.04055771604180336, 0.4443449079990387, -0.00035894394386559725, 0.057925786823034286, -0.5529546141624451, -0.2346625179052353, 0.3099847137928009, 0.3972705602645874, -0.47307613492012024, 0.1008414551615715, -0.03924553096294403, 0.21561697125434875, 0.0897974744439125, -1.0435515642166138, 0.08954634517431259, -0.7219288945198059, 0.30482563376426697, -2.0402989387512207, 0.1317935287952423, -0.09819022566080093, -0.02213144488632679, 0.011213256046175957, -0.8722464442253113, -0.40497052669525146, 0.3600914180278778, -1.2992539405822754, 0.07694154232740402, -0.006048375274986029, 0.1480884999036789, -0.7623237371444702, -0.00870504230260849, 0.8137416243553162, -0.24911710619926453, -0.2649908661842346, 0.0984303206205368, -0.05123812332749367, -0.1943601816892624, 0.23274925351142883, 0.32166263461112976, 0.23708859086036682, -1.1424866914749146, 0.5169153809547424, 0.2695767879486084, -0.12207744270563126, -0.15484227240085602, -0.20511466264724731, -0.9913269281387329, -0.15145672857761383, 0.12055987864732742, 0.15229764580726624, 0.2605556547641754, 0.04276997223496437, 0.14610570669174194, -1.0120352506637573, -0.39675670862197876, -0.6434846520423889, 0.4310956597328186, -0.46404847502708435, 0.2915389835834503, -0.0552220456302166, -0.04360215738415718, -1.3118208646774292, -0.8803223967552185, -0.8523295521736145, 0.21819540858268738, -0.08137587457895279, 0.1552981436252594, -0.17859318852424622, -0.15499931573867798, 0.1383119374513626, 0.30976733565330505, 0.31052613258361816, -0.10456835478544235, -1.164242148399353, -0.44867727160453796, -0.2770896553993225, 0.2385951280593872, -0.28017616271972656, 0.24020366370677948, 0.09988618642091751, -0.23674485087394714, -0.9996943473815918, -0.2902587652206421, 0.3718320429325104, 0.2493761032819748, 0.3065820634365082, -1.5978046655654907, 0.38346877694129944, 0.45687368512153625, -0.29250285029411316, 0.006370748858898878, -1.7901450395584106, 0.12916046380996704, -0.26881250739097595, -0.5902077555656433, -0.10820300877094269, -0.9929304718971252, 0.800839364528656, 0.6239844560623169, -0.23825384676456451, -0.4421805441379547, -0.10170713812112808, 0.0786663144826889, -0.35320326685905457, -0.17251631617546082, 0.05827967822551727, -0.2524333894252777, 0.4370897710323334, 0.6160780787467957, 0.050786860287189484, 0.2948566675186157, 0.3188728392124176, -0.948941171169281, 0.252963125705719, 0.1604057401418686, -0.08176960796117783, -0.06647558510303497, -0.20710860192775726, -0.8995731472969055, 0.08982935547828674, -0.14298728108406067, 0.43377646803855896, -0.12508603930473328, 0.20876730978488922, -0.4794587790966034, -2.965029001235962, -1.713739037513733, -0.055847395211458206, -0.06296201050281525, 0.2620139718055725, 0.0016621999675408006, 0.12742973864078522, -0.512265682220459, 0.5861881375312805, 0.19315363466739655, 0.10239705443382263, -0.04936486855149269, -0.8398622274398804, -0.13450755178928375, -0.4493072032928467, 0.2752358317375183, -0.005035622511059046, 0.4150039851665497, 0.3286937475204468, -0.5520104169845581, -0.4813694357872009, 0.19784173369407654, 0.4309405982494354, -0.20418789982795715, -0.18903383612632751, -0.5369145274162292, 0.142201229929924, -0.12274874746799469, 0.07604357600212097, 0.6133753061294556, 0.01654033362865448, 0.2995491027832031, -0.0007953713648021221, 0.4507412612438202, 0.7735394239425659, -1.2832987308502197, -2.404003381729126, 0.3243556022644043, -0.04611121490597725, -0.062161218374967575, -0.5099232196807861, 0.08866304904222488, 0.002482571406289935, 0.32774943113327026, -1.288112759590149, -1.0393683910369873, 0.003209060523658991, 0.10355965048074722, -2.781386375427246, -0.2851320207118988, -0.4933190643787384, 0.08466647565364838, -0.01657095178961754, 0.357765793800354, -0.04095552861690521, 0.1554727703332901, -0.7941979765892029, -0.026103544980287552, -0.7236790060997009, 0.18751540780067444, -0.2917388379573822, 0.010110841132700443, 0.26087862253189087, -0.12405908852815628, -0.2565784156322479, -0.8546018004417419, 0.11080549657344818, 0.5648694038391113, -1.0196549892425537, 0.11512577533721924, -0.25175371766090393, -0.0024585267528891563, -0.026256825774908066, -0.029504993930459023, -0.06325849890708923, 0.17561176419258118, -0.2026354819536209, 0.5440236926078796, 0.10016056150197983, 0.09114868193864822, -0.08733253180980682, -0.12025029212236404, 1.0764557123184204, 0.05717262998223305, -0.30621397495269775, 0.28131458163261414, -0.7605265378952026, 0.02152557298541069, -0.5621322989463806, -0.10758153349161148, -0.40068596601486206, 0.17536430060863495, -0.2285533994436264, 0.21130557358264923, -0.27727076411247253, -0.2187795490026474, -0.12239111214876175, 0.7278492450714111, -0.23623278737068176, 0.008776064030826092, -0.7837070226669312, -0.2820988595485687, 0.4127046465873718, 0.06728994101285934, -0.06803243607282639, 0.08015970140695572, 0.27239421010017395, -1.0420953035354614, -0.44625359773635864, -0.12653760612010956, 0.6417759656906128, 0.013864940032362938, 0.0831182524561882, 0.07134559750556946, -0.16078433394432068, 0.015147536993026733, -0.102767214179039, 0.15109166502952576, -0.7658581137657166, -0.08151291310787201, -0.2759774923324585, -0.7064468860626221, -0.2679613530635834, 0.4912864565849304, -0.25525858998298645, -0.2088286578655243, -0.1837962120771408, -0.549429714679718, 0.32578396797180176, 0.18731562793254852, 0.37983188033103943, 0.3514596223831177, 0.208475723862648, 0.1045539602637291, -0.410815954208374, 0.09347653388977051, -0.05705355480313301, 0.3371853828430176, 0.11655686795711517, 0.2862758934497833, -0.10255581885576248, -0.10673190653324127, -0.5028229355812073, -0.20012901723384857, -0.18169383704662323, 0.1763031780719757, 0.06551214307546616, 0.2005719542503357, -0.18787261843681335], "bias_tensor": [0.37630486488342285, 0.3496429920196533, -0.1655735969543457, -0.010714138858020306, 0.43403229117393494, -0.062327802181243896, -0.3781260550022125, 0.06634055823087692, 0.05132012814283371, -0.1413646936416626, 0.22410303354263306, 0.00928446464240551, -0.12306191027164459, 0.2651366889476776, 0.2091280072927475, 0.5373579263687134, -0.1012686938047409, 0.08751363307237625, 0.3602440357208252, -0.06609717011451721, 0.5159070491790771, -0.3301398456096649, 0.057171303778886795, 0.20900236070156097]}}}, "inbound_nodes": [[["td_dense1", 0, 0, {}]]]}, {"name": "noseq_gru", "class_name": "GRU", "config": {"name": "noseq_gru", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 48, "activation": "relu", "recurrent_activation": "hard_sigmoid", "use_bias": true, "reset_after": false, "Wz": [0.1682232916355133, 0.1611834615468979, -0.25148820877075195, -0.029508961364626884, 0.38687819242477417, 0.1610446572303772, -0.13181115686893463, 0.3201849162578583, -0.14791731536388397, -0.006287527270615101, 0.2978019416332245, 0.39776360988616943, -0.18941476941108704, -0.06454281508922577, -0.16311776638031006, 0.21714968979358673, -0.10217322409152985, 0.3452807366847992, 0.1355084627866745, -0.38505232334136963, 0.650477945804596, -0.3288414776325226, -0.1971598118543625, 0.21248231828212738, 0.20715951919555664, 0.1116306409239769, 0.8243260383605957, -0.4719667136669159, 0.5623115301132202, 0.04225984588265419, 1.2441129684448242, -0.26508551836013794, 0.1736602634191513, 0.011494327336549759, 0.500738799571991, 0.8650299906730652, -0.24829477071762085, 1.2453343868255615, 0.10924263298511505, 0.32754555344581604, 0.6778265833854675, 0.08579745888710022, 1.1073471307754517, -1.2387181520462036, -1.3177177906036377, 0.13594745099544525, -0.7488851547241211, -0.06193655729293823, -0.05581223592162132, -0.050511352717876434, -0.24609480798244476, 1.2531362771987915, 1.464556097984314, 0.4497728943824768, 0.4075503349304199, 0.6043376922607422, -0.09870719909667969, -0.01668633334338665, -0.4249298572540283, -0.6003408432006836, 0.40681716799736023, 0.37025928497314453, 0.3901868164539337, -1.288745403289795, -0.25122013688087463, -0.01563236489892006, 0.3252265155315399, 0.3595750331878662, -0.37856465578079224, -0.385930597782135, 0.1234733983874321, 0.42705169320106506, 0.4093851149082184, 0.9665133357048035, -0.8195853233337402, 1.6369507312774658, 1.5981491804122925, 0.3210597634315491, 0.482485830783844, 0.010513700544834137, 0.3672172427177429, -0.07292892783880234, 0.11568200588226318, -0.3756482005119324, -0.05651804059743881, 0.6054050326347351, 0.7290118336677551, 0.015221964567899704, 0.08904215693473816, -0.7407039403915405, -0.23403476178646088, -1.8047794103622437, -0.7337354421615601, 0.12224183231592178, 0.08886730670928955, 0.008615510538220406, -0.06157964468002319, -0.17537234723567963, -0.0825774148106575, 0.554019570350647, 0.2584005296230316, 0.005321762058883905, 0.14553014934062958, -0.11762867122888565, 0.5391930937767029, 0.06828083842992783, -0.15548303723335266, -0.4240390658378601, -0.5759802460670471, 0.24933040142059326, 0.2641642689704895, 0.13265277445316315, -0.08397885411977768, 0.19000300765037537, 0.21061678230762482, 0.22370974719524384, -0.018950926139950752, -1.7704862356185913, 0.25983965396881104, 0.17360764741897583, 0.18909239768981934, -0.19521568715572357, -0.14662177860736847, 0.7214537262916565, 0.5034984946250916, 0.09297838807106018, 0.0676947683095932, -0.027208678424358368, 0.5918700098991394, 0.023867327719926834, -0.1119232103228569, 0.24145053327083588, -0.982440173625946, -0.012814497575163841, 0.766356348991394, 0.366116464138031, 0.24309419095516205, 0.040175676345825195, 0.26705265045166016, 0.811864972114563, 0.4189263880252838, -1.5824851989746094, 0.29656800627708435, -0.2684400975704193, -0.11187522858381271, 0.1036006435751915, -0.2519378364086151, 0.7222775816917419, 0.7354000210762024, 0.23738405108451843, 0.17023025453090668, 0.07679828256368637, -0.0006542163901031017, -0.12152700126171112, -0.2626262307167053, -0.4433521628379822, 0.31478971242904663, 0.5555208325386047, 0.2522004544734955, -0.7360116839408875, 0.2524973452091217, 0.06646955013275146, 0.646352231502533, 0.04216136038303375, -0.7300758957862854, -0.3684975802898407, 0.31362006068229675, 0.1665341854095459, 0.35453152656555176, -0.21026229858398438, -0.21531707048416138, 0.7062906622886658, 1.1676357984542847, 0.389212042093277, 0.5342953205108643, -0.15718437731266022, -0.06821390241384506, 0.09110726416110992, 0.38704797625541687, -0.1472676545381546, -0.6465977430343628, 0.8906843662261963, 0.5099414587020874, -0.8035249710083008, -0.1806323081254959, 0.16420423984527588, 0.6681106090545654, 0.018250267952680588, -0.2868947982788086, -0.3291696012020111, 0.2786087691783905, -0.15363653004169464, 0.020386843010783195, -0.05933528020977974, 0.41166529059410095, -0.03503458574414253, 0.2844618558883667, 0.617327868938446, 0.18602339923381805, -0.14958392083644867, 0.09618725627660751, 0.14139796793460846, -0.26887014508247375, -0.6403453350067139, -0.0014090603217482567, 0.2929481267929077, 0.26663896441459656, -0.5181557536125183, -1.1642202138900757, 0.08974786102771759, 0.42618730664253235, -0.10864710807800293, -0.09603234380483627, -0.37926357984542847, 0.13860832154750824, 0.037021998316049576, -0.702728807926178, 0.060618914663791656, 0.009753221645951271, 0.5613240599632263, 0.3870372474193573, 0.3869055211544037, 0.1728477030992508, -0.07405722886323929, 0.5225431323051453, 0.07953441143035889, -0.9553935527801514, 0.011908878572285175, -0.45243293046951294, 0.3938015401363373, 0.5018459558486938, -0.22744350135326385, -0.9526814222335815, 0.16316036880016327, 0.20553337037563324, 0.1442582607269287, -0.140743225812912, -1.6204934120178223, 0.13524878025054932, 0.21688801050186157, -0.21305805444717407, 0.5345800518989563, 0.11933332681655884, 0.26666221022605896, 0.261187881231308, 0.20636063814163208, 0.24007900059223175, -0.1356860101222992, 0.30881789326667786, -0.016228361055254936, -0.1879718154668808, -0.3446820080280304, 0.25380614399909973, 0.01369611918926239, 0.1409800946712494, 0.511990487575531, 0.6260573267936707, 0.11670733243227005, 0.388586163520813, 0.4956286549568176, 0.2661758363246918, -0.9688963294029236, 0.2547292411327362, 0.18109862506389618, -0.01802346110343933, 2.162083864212036, 0.4466969966888428, 1.2609657049179077, 0.4444008469581604, 0.33128777146339417, 0.36506718397140503, 0.1728111058473587, 0.08436711132526398, 0.21028254926204681, 0.0917295292019844, -0.567777156829834, 0.07527761906385422, 0.4483022391796112, 0.5049320459365845, -0.18856315314769745, 0.005005242303013802, 0.9705450534820557, -0.18248464167118073, 0.19609597325325012, 0.0917552262544632, -0.48774293065071106, -0.08415330946445465, 0.5720306038856506, 0.2931831181049347, 0.2296166867017746, -0.526683509349823, 0.5867476463317871, 1.6710597276687622, 0.5403603911399841, 0.03075200319290161, 0.14379481971263885, -0.2457653284072876, 0.0037647252902388573, 0.36589759588241577, -0.4733596742153168, 0.10191012173891068, 0.9533646702766418, 0.4592397212982178, 0.0176655575633049, 0.021255595609545708, -0.13191092014312744, 1.381570816040039, -0.5872387290000916, -0.9601659178733826, -0.24342931807041168, -0.674859881401062, -0.12110070884227753, 0.02716498076915741, 1.0244389772415161, -0.3526015281677246, 0.22358658909797668, 0.46365490555763245, 0.043433140963315964, 0.13561394810676575, 0.44828635454177856, 0.05883423238992691, 0.03568010404706001, 0.30190035700798035, -1.2939752340316772, -0.2699339985847473, 0.21172058582305908, 0.001768897520378232, 0.254269003868103, -0.0397355854511261, -0.08061234652996063, 0.10779088735580444, -1.0631637573242188, -0.12703865766525269, -1.0054770708084106, -0.17140863835811615, 0.22987401485443115, 0.5864714980125427, 0.5614640116691589, -0.23061461746692657, 0.3340855538845062, 0.4982440173625946, 0.11443407833576202, 0.0077410852536559105, 0.146447092294693, 0.18313951790332794, -0.11268644779920578, 0.0792638435959816, -0.2651265561580658, -0.027665788307785988, 0.08951931446790695, -0.7798669934272766, -0.11453034728765488, 0.2724115252494812, -1.0630292892456055, 0.03654712066054344, -0.5077561140060425, 0.04466187208890915, 0.38254931569099426, -0.9834553003311157, 0.1838829219341278, 0.15718699991703033, -0.49614670872688293, -0.2616875171661377, 0.5828741788864136, 0.6793719530105591, -0.050477657467126846, 0.18041853606700897, 0.08756665885448456, 0.09765248745679855, -0.014207087457180023, 0.03878100588917732, 0.01413472555577755, -0.8070676326751709, -0.14465132355690002, 0.7743134498596191, -0.2377801239490509, 0.5570211410522461, -0.1062653511762619, 0.40043342113494873, 0.9701268076896667, 0.5408125519752502, -1.2174872159957886, 0.44478732347488403, -0.14575301110744476, -0.11020264029502869, 0.0026337120216339827, -0.05699368566274643, 0.5282406210899353, 0.6441583633422852, 0.05184740573167801, 0.3453156352043152, 0.01477955561131239, 0.5784217715263367, -0.11814186722040176, -0.5218884944915771, 0.2381865233182907, -0.7169377207756042, 0.8243674039840698, 0.09837412089109421, -0.34278416633605957, -0.2624799311161041, -0.05586549639701843, 0.6248036026954651, 0.007154650054872036, -0.4869038760662079, -1.482297420501709, -0.08877718448638916, -0.01639949157834053, 0.0023798460606485605, 1.1981797218322754, -0.5069509148597717, 0.4926508367061615, 0.5957390069961548, 0.2389908730983734, 0.4183569848537445, 0.5809018015861511, -0.10209274291992188, -0.10370968282222748, -0.16311410069465637, -0.767761766910553, 0.4144246578216553, 0.4310484826564789, -0.22074952721595764, 0.06856094300746918, 0.37294235825538635, -0.4392136037349701, -0.1198396161198616, -0.4756071865558624, -0.5606319904327393, -0.5886293649673462, -0.4703063666820526, 0.21047784388065338, -0.08155705034732819, 0.07766761630773544, 0.012532249093055725, 0.6440163254737854, 0.5912671685218811, 0.15044619143009186, 0.8270058035850525, 0.06703203916549683, 0.36568668484687805, -0.07635699957609177, -0.37482261657714844, -0.2415287047624588, -0.6652364134788513, 0.36504605412483215, 0.2811751365661621, 0.12340676039457321, -0.691649317741394, -0.038058921694755554, 0.24782352149486542, -0.12731634080410004, -0.21073202788829803, -1.4429965019226074, -0.06874744594097137, 0.35742005705833435, 0.20279769599437714, 0.4963058531284332, -0.6495298147201538, 0.6047686338424683, 0.6588018536567688, 0.2413361370563507, -0.0007318112766370177, 0.3357488214969635, -0.11745326966047287, -0.06968767940998077, 0.02617935836315155, -0.13290974497795105, -0.13325296342372894, 0.5051926970481873, 0.06367063522338867, 0.010650746524333954, 0.20832571387290955, -0.5614038109779358, 0.4046754539012909, -0.6811162829399109, -0.3688090145587921, -0.09220375120639801, -0.3490978479385376, 0.05635518953204155, -0.7267613410949707, -0.16562896966934204, -0.2728373110294342, 0.6347673535346985, 0.8929529786109924, 0.04537711665034294, 1.2955514192581177, 0.0706264078617096, 0.8575356602668762, -0.10392437875270844, 0.24702244997024536, -0.05150797963142395, -0.4488975405693054, -0.07004763185977936, 0.8060766458511353, -0.6866658926010132, -0.1821717768907547, 0.608637273311615, -0.06338227540254593, 0.6575860381126404, 0.38138851523399353, -0.5775330066680908, 0.3625376522541046, -0.06407332420349121, 0.3308503329753876, -0.08779897540807724, 0.06911209225654602, 0.3267362415790558, 0.2793966233730316, 0.29442811012268066, 0.5308511853218079, -0.0687558576464653, 0.5569458603858948, 0.1963018774986267, 0.5352044701576233, -1.0460107326507568, -0.2865649163722992, 0.20858535170555115, -0.1473376750946045, -0.37695106863975525, 0.46728959679603577, -0.24720731377601624, 0.5695717334747314, -1.3279926776885986, -0.36486783623695374, 0.25984957814216614, -0.27855387330055237, -0.007537472527474165, -0.02897508442401886, 0.06868903338909149, -0.14083096385002136, 0.41744041442871094, 0.5612061619758606, 0.39710405468940735, 