{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": ["None", 100, 18], "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "mask", "class_name": "Masking", "config": {"name": "mask", "mask_value": -999}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "td_dense0", "class_name": "TimeDistributed", "config": {"name": "td_dense0", "layer": {"class_name": "Dense", "config": {"name": "dense_1", "units": 24, "activation": "relu", "use_bias": true, "kernel_tensor": [-0.2321518510580063, -0.217861607670784, -0.0778704285621643, -0.1335073560476303, 0.25214406847953796, -0.1438138633966446, -0.002399181015789509, 0.11196024715900421, -0.015491641126573086, -3.603797197341919, -1.157028079032898, 0.20921088755130768, -0.0704168900847435, -0.18735161423683167, 0.31014347076416016, 0.3678267002105713, -0.19430266320705414, -0.14073413610458374, 0.42760786414146423, -0.16455164551734924, 0.13155293464660645, 0.053885169327259064, -0.10402435809373856, -0.13285180926322937, -0.03880396485328674, 0.011909833177924156, -0.44428351521492004, 1.6655385494232178, 1.0524359941482544, -0.06705500930547714, 0.07664641737937927, 0.17065393924713135, -0.17791570723056793, 0.158706933259964, 0.1494344174861908, -0.35712581872940063, -0.019265910610556602, 0.19965775310993195, 0.4226187765598297, -0.06227251887321472, -0.17062321305274963, 0.23413260281085968, 0.048426076769828796, -0.0885176807641983, 0.1032090038061142, 2.2927603721618652, 1.535803198814392, 0.07495322078466415, 0.11601182073354721, 0.1331411600112915, -0.49305009841918945, 0.04012049362063408, -0.07590139657258987, 0.04985887557268143, -0.21418797969818115, 0.1599709391593933, -0.5726488828659058, -0.24223265051841736, -0.09456919133663177, 0.30405619740486145, -0.16060295701026917, 0.391032874584198, 0.25217992067337036, 0.10532017052173615, -0.5813007354736328, -0.05530012771487236, 0.4404911398887634, -0.3042205274105072, -0.04570510983467102, 0.009089238941669464, -0.4127581715583801, -0.3176916539669037, -0.06377910077571869, -0.12717607617378235, 0.1884666234254837, 0.04537244141101837, -0.3483510911464691, -0.2263699173927307, 0.1156516894698143, 0.35159730911254883, 0.001025981968268752, -1.709185004234314, -1.1308197975158691, -0.032914500683546066, -0.013801760971546173, -0.26936355233192444, -0.01543336920440197, -1.1633243560791016, -0.27527159452438354, 0.1332872211933136, 0.012344317510724068, -0.0031787180341780186, 0.35693439841270447, 0.030830848962068558, -0.14477762579917908, 0.1278335303068161, 0.02277815341949463, 0.0028771539218723774, 0.4012094736099243, -2.872100591659546, -1.1933302879333496, 0.036532457917928696, 0.031905923038721085, 0.06112287938594818, -0.6159522533416748, 0.20449888706207275, 0.12031014263629913, 0.1047484502196312, 0.05215027928352356, 0.03367297351360321, 0.10199495404958725, 0.12065797299146652, 0.055448487401008606, 0.15115882456302643, -0.3796660304069519, -0.15948627889156342, 0.17700280249118805, -1.2600258588790894, -1.597155213356018, -0.12344089150428772, -0.01159704476594925, -0.06422584503889084, -1.8768675327301025, 0.09234312921762466, -0.030198805034160614, 0.05376383662223816, 0.40199416875839233, 0.013881959952414036, -0.5573890209197998, 0.11859039962291718, 0.05846395343542099, 0.016946544870734215, -0.04327293857932091, -0.9993476867675781, -0.09629110991954803, -0.5587558746337891, -0.4698465168476105, -0.04102028161287308, 0.24947571754455566, 1.3129785656929016e-05, -0.39358389377593994, 0.16112251579761505, 0.11297798156738281, -0.03360770270228386, 0.03622771054506302, 0.00045007228618487716, 0.17173413932323456, 0.019713396206498146, -0.058438513427972794, 0.030206037685275078, -0.008808095008134842, 0.1724383682012558, -0.12449521571397781, 1.0940450429916382, 1.3166481256484985, 0.08075553178787231, -0.04416154697537422, -0.3853461742401123, 0.22987483441829681, 0.40125980973243713, -0.4050019383430481, 0.1003093272447586, 0.07556179165840149, -0.04301883280277252, 0.21864068508148193, 0.0608726367354393, -0.2003599852323532, 0.0410633347928524, -0.0300969909876585, -0.015192873775959015, 0.6876776814460754, 1.0826572179794312, 0.561040997505188, 0.0071770381182432175, 0.10376434028148651, -0.18415212631225586, -0.6144348978996277, 0.27502748370170593, 0.02948087267577648, 0.01387081015855074, 0.28261131048202515, 0.06275733560323715, -0.5978677272796631, 0.1055358275771141, -0.4340584874153137, 0.008682597428560257, 0.1501554548740387, 0.024223092943429947, 0.20462578535079956, -0.9578506946563721, 0.011188499629497528, 0.35332930088043213, 0.1112261712551117, -0.16078732907772064, 0.3561416268348694, 0.0710984393954277, -0.20957663655281067, 0.023873964324593544, -0.1410938799381256, -0.3051929771900177, 0.18837235867977142, -0.08667684346437454, 0.1569344699382782, 0.014942917972803116, -0.02725234255194664, 0.05638326331973076, 0.08137466758489609, 3.8067307472229004, 1.4533205032348633, 0.1434837281703949, -0.0038356648292392492, -0.07248491793870926, 0.19536782801151276, -0.0066413888707757, -0.1481446623802185, -0.037395648658275604, 0.14510241150856018, -0.09180264919996262, 0.04238862916827202, 0.07079236209392548, -0.025614095851778984, -0.05801647901535034, 0.30881819128990173, -2.010159969329834, -0.01923401840031147, 0.5729914307594299, 1.1568042039871216, -0.0630275160074234, 0.048334114253520966, -0.15394487977027893, 0.12216389179229736, 0.15110859274864197, 0.012847961857914925, 0.06295724213123322, -0.187771737575531, -0.055686406791210175, 0.12616278231143951, 0.06944063305854797, -0.07720809429883957, -0.19995087385177612, 0.06529062241315842, -0.11535404622554779, -0.1610967069864273, 2.2154691219329834, 1.0641847848892212, -0.07568948715925217, -0.07848351448774338, -0.14067311584949493, 0.19621409475803375, 0.14516085386276245, 0.08227115869522095, 0.10004077851772308, 0.20098255574703217, -0.13461308181285858, 0.1026243045926094, 0.09384535998106003, 0.05025424435734749, -0.13554532825946808, 0.010610736906528473, 0.26585525274276733, 0.5795244574546814, 2.4307284355163574, 1.2928845882415771, 0.22914113104343414, -0.1660376936197281, -0.10964273661375046, 0.14236395061016083, 0.22777171432971954, 0.13364461064338684, -0.01982027292251587, 0.22302652895450592, -0.34350112080574036, 0.1247183233499527, 0.1060933917760849, -0.06191374361515045, -0.03824648633599281, 0.03693366423249245, 0.3085976541042328, -0.6855549812316895, 1.1295385360717773, 0.7094638347625732, 0.9136111736297607, -0.19295081496238708, -0.08325671404600143, 0.11041272431612015, 0.04357866942882538, 0.1262548714876175, 0.05121303349733353, 0.01891377754509449, 0.10054546594619751, 0.2935195565223694, 0.010287330485880375, 0.022950109094381332, 0.09395792335271835, -0.01573128066956997, 0.01599053293466568, -0.20451860129833221, -2.3149960041046143, -1.0959579944610596, 0.09388991445302963, 0.05519099533557892, 0.0664408802986145, -0.2289445400238037, -1.575169324874878, 0.041071511805057526, 0.042973533272743225, -0.03961167111992836, 0.068773552775383, 0.19319091737270355, -0.027591632679104805, 0.0912320613861084, 0.1709333062171936, -0.08754486590623856, 0.21139265596866608, -0.26406627893447876, -2.5119800567626953, -2.1199638843536377, -0.1709297001361847, -0.0442543625831604, -0.002345662796869874, 0.11306043714284897, -0.0035572093911468983, 0.18293608725070953, 0.26912006735801697, -0.6956587433815002, 0.1254166066646576, -0.2636857032775879, 0.17477059364318848, 0.09370990097522736, 0.5816806554794312, -0.02290966920554638, -0.31646448373794556, -0.2207057923078537, -0.1859065592288971, -0.7897331714630127, 0.04286901652812958, -0.28733739256858826, -0.10834015905857086, 0.41457775235176086, 0.03299771249294281, -0.21148470044136047, 0.004214526154100895, 0.07410042732954025, -0.13634175062179565, -1.0434291362762451, 0.16323351860046387, -0.09842442721128464, 0.018928667530417442, 0.018393708392977715, -0.003818432567641139, 0.10700228065252304, -2.23579478263855, -2.350325107574463, -0.3201639652252197, -0.060739800333976746, -0.03508300334215164, -0.4300748109817505, -0.0011278908932581544, -0.10177022963762283, 0.12996233999729156, -0.07806537300348282, -0.007587941363453865, -0.04909547418355942, -0.03042701631784439, 0.0814995989203453, 0.019065948203206062, 0.013995940797030926, 0.09685730934143066, -0.06350746005773544, 4.019524097442627, 0.7146270275115967, 0.04912213981151581, -0.04527163505554199, -0.02741118147969246, -0.1408771276473999, 0.22066335380077362, 0.033448923379182816, 0.01410661730915308, -0.009605199098587036, -0.04689512029290199, -0.19292178750038147, 0.012936951592564583, 0.1306452453136444, -0.14722882211208344, -0.10359601676464081, 0.20931579172611237, 0.07804177701473236, -0.16844111680984497, -0.16529259085655212, -0.011021538637578487, -0.005655255634337664, -0.31804195046424866, 0.05545723810791969, -1.5461630821228027, 0.34360471367836, -0.3773798644542694, 0.01822216622531414, -0.014016257598996162, 0.16305990517139435, 0.040387652814388275, -0.023118389770388603, -0.2871650755405426, 0.005359637551009655, -0.6303465366363525, 0.0668804943561554, -0.10744677484035492, -0.42349204421043396, -0.03687998279929161, -0.17670676112174988, -0.042819567024707794, 1.3153882026672363, 0.03124060481786728, -0.29605287313461304, -0.10670029371976852, -0.542757511138916, 0.07238883525133133, 0.2629506587982178, -0.006625870242714882, 0.07761509716510773, 0.09970047324895859, 0.2899000942707062, -0.008855569176375866, -0.09378919750452042, -1.728731632232666, -0.9738159775733948, -0.13341382145881653, -0.21593110263347626, 0.07985653728246689, 0.3177197575569153, 0.023084774613380432, 0.349298357963562, -0.3759066164493561], "bias_tensor": [-0.5910801291465759, 0.44532904028892517, 0.6226992011070251, 0.3422911465167999, -0.35066816210746765, -0.41527116298675537, -0.08221589028835297, -0.12234795838594437, 0.5551413893699646, 0.01631109043955803, 0.08829570561647415, 0.7708149552345276, -0.01994573324918747, 0.38064083456993103, 0.49171021580696106, -0.04012617468833923, -0.5648806691169739, -0.5306575298309326, 0.5207579135894775, -0.7262587547302246, 1.0530238151550293, -0.5295725464820862, 0.17804719507694244, -0.5642026662826538], "feature_scaling": [{"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_PROBNNe", "offset": 0.029921475797891617, "scale": 0.14492681622505188}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_PROBNNghost", "offset": 0.10169490426778793, "scale": 0.22438623011112213}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_PROBNNk", "offset": 0.15999560058116913, "scale": 0.28967157006263733}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_PROBNNmu", "offset": -0.9457343220710754, "scale": 0.25843897461891174}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_PROBNNp", "offset": 0.12455946952104568, "scale": 0.24889972805976868}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_PROBNNpi", "offset": 0.6835159063339233, "scale": 0.3672078549861908}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_P", "offset": 12971.0205078125, "scale": 16599.708984375}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_PT", "offset": 729.2111206054688, "scale": 742.1095581054688}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_Charge", "offset": 0.011322290636599064, "scale": 0.9999359250068665}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_BPVIP", "offset": 1.2204408645629883, "scale": 5.782809734344482}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_BPVIPCHI2", "offset": 695.073486328125, "scale": 8493.69921875}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_SumBDT_ult", "offset": -31.896360397338867, "scale": 15.051877975463867}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_VeloCharge", "offset": 0.9174966812133789, "scale": 0.1316533088684082}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_Tr_T_IP_trMother", "offset": 3.1734230518341064, "scale": 6.076236248016357}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_diff_z", "offset": 9.433614730834961, "scale": 71.3769302368164}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_P_proj", "offset": 15876521.0, "scale": 26115662.0}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_cos_diff_phi", "offset": -0.058551542460918427, "scale": 0.7122989296913147}, {"name": "B_IFT_OSMuonDev_TagPartsFeature_diff_eta", "offset": -0.18361525237560272, "scale": 0.9581849575042725}]}}}, "inbound_nodes": [[["mask", 0, 0, {}]]]}, {"name": "td_dense1", "class_name": "TimeDistributed", "config": {"name": "td_dense1", "layer": {"class_name": "Dense", "config": {"name": "dense_2", "units": 24, "activation": "relu", "use_bias": true, "kernel_tensor": [-0.05917488783597946, 0.5972813367843628, 0.8113258481025696, 0.2563803195953369, 0.10947994887828827, 0.3161039352416992, -0.5836355686187744, -0.1743684858083725, -0.3033794164657593, -0.07620217651128769, 0.03310594707727432, 0.1298283338546753, 0.32544782757759094, -0.021772021427750587, -0.42725351452827454, -0.07331236451864243, 0.13771945238113403, -1.3528327941894531, -0.07506948709487915, 0.04956435412168503, -0.19773416221141815, 0.02371416985988617, -0.03622209653258324, 0.24861425161361694, -0.6558268070220947, 0.055620308965444565, 0.4247209131717682, 0.1424712836742401, 0.03302537649869919, -0.6491654515266418, -0.06489535421133041, 0.16299697756767273, -0.0007215857040137053, 0.07392565160989761, 0.33568283915519714, 1.025607705116272, -0.4072161316871643, 0.170766681432724, 0.23298870027065277, 0.03080885112285614, -0.35154032707214355, -0.08344846963882446, 0.07375381886959076, 0.04982813820242882, 0.9624915719032288, 0.0863826647400856, -0.1130819246172905, -0.0489320233464241, -0.5946473479270935, 0.22837720811367035, 0.1464075744152069, -0.07211575657129288, -0.23651333153247833, 0.32634299993515015, 0.246915802359581, -0.12861283123493195, -0.5228387117385864, 0.32558587193489075, -0.39922022819519043, 0.11977044492959976, 0.5651326179504395, 0.2950993776321411, -0.2665548026561737, -0.07044298946857452, 0.03546789661049843, 0.11972203105688095, 0.0030464623123407364, -0.14190268516540527, 0.621435284614563, -0.8330597877502441, -0.09243074804544449, -0.11391797661781311, -0.7426976561546326, 0.18466489017009735, -0.07121482491493225, -0.39607563614845276, 0.13375259935855865, -0.6654326319694519, 0.02314828336238861, -0.38212090730667114, 0.3529255986213684, -0.0480213463306427, -0.08566778153181076, 0.4250606894493103, -0.3990708291530609, -0.060971103608608246, 0.20369896292686462, 0.06358864158391953, 0.14459434151649475, -0.1541982889175415, -0.38239815831184387, -0.3777468204498291, 1.055823564529419, -0.38791757822036743, -0.0844932496547699, -0.05170607566833496, 0.06591300666332245, -0.4948379099369049, 0.2171708196401596, 0.17326359450817108, -0.08081664144992828, -0.03562306612730026, -0.12471975386142731, -0.21670332551002502, -0.30188417434692383, 0.11226900666952133, 0.09239435195922852, 0.2355235069990158, -0.17286884784698486, 0.14798778295516968, 0.4743269979953766, -0.4312118589878082, -0.5570833683013916, 0.12452726066112518, 0.3502300977706909, 0.08453112840652466, 0.24392442405223846, -0.32573574781417847, -0.24728049337863922, 0.326669842004776, 0.4226248860359192, -0.47842657566070557, -0.396484911441803, -0.08993058651685715, -0.21224351227283478, -0.5995569229125977, -0.13867130875587463, 0.5634704828262329, -0.6792705655097961, -0.3800470232963562, -0.5624196529388428, 0.42205485701560974, -0.5555416941642761, -0.22327497601509094, -0.004745359066873789, -0.1499299705028534, -0.16684935986995697, 0.0199101734906435, 0.034560855478048325, 0.27796900272369385, 1.3468917608261108, -0.007144647650420666, -0.060476478189229965, -0.12286898493766785, -0.3246462047100067, -0.329057902097702, 0.05893475189805031, -0.12227922677993774, -0.13193963468074799, 0.4130138158798218, -0.20591984689235687, -0.2450055480003357, -0.25822877883911133, 0.3757076859474182, 0.3565569818019867, -0.48180073499679565, 0.46320968866348267, -0.6766149401664734, 0.2245626300573349, -0.008292602375149727, -0.48406246304512024, 0.08715061843395233, 0.0936073511838913, 0.35661783814430237, -0.10923907160758972, 0.5414881706237793, 0.10268450528383255, -0.07383057475090027, 0.48917344212532043, -0.13365471363067627, 0.39141717553138733, -0.013867734000086784, -0.03751936927437782, 0.31819871068000793, 0.06221965700387955, -0.7764044404029846, 0.19002774357795715, 0.10680505633354187, -0.03693590685725212, 0.06626862287521362, -0.3095308244228363, 0.25054919719696045, 0.09624352306127548, -0.014476252719759941, -0.6316317915916443, 0.01667974144220352, -0.31948015093803406, -0.030096083879470825, -1.26548433303833, 0.10241591185331345, 0.14974918961524963, -0.24116207659244537, 0.0957680493593216, -0.3560095727443695, -0.43104442954063416, -0.9994924068450928, 0.6788949370384216, -0.12681396305561066, 0.4336702227592468, -0.05724479258060455, -0.2575894594192505, -0.0680677518248558, -0.16522587835788727, -0.49493607878685, -0.11775485426187515, -0.20574703812599182, -0.2127581089735031, 0.200448676943779, -0.3925016224384308, 0.03711313381791115, -0.04763161391019821, -0.3183998763561249, 0.2953977882862091, 0.4597868025302887, 0.40911179780960083, -0.23255270719528198, -0.7109774947166443, 0.09030601382255554, 0.2905482351779938, 0.034146521240472794, 0.1234406903386116, -0.5219237208366394, 0.034098755568265915, -0.2717042565345764, 0.038730598986148834, 0.025139765813946724, -0.14257974922657013, 0.9197377562522888, -0.3677820563316345, 0.3817194402217865, 0.10825920850038528, 0.07632274925708771, -0.04489808902144432, -0.4109499156475067, -0.023451289162039757, -0.5818975567817688, 1.0784111022949219, 0.11833689361810684, 0.027861719951033592, -0.16352900862693787, -0.2745726704597473, 0.30086368322372437, -0.15207983553409576, 0.24168534576892853, 0.44319748878479004, -0.10291549563407898, 0.2452436089515686, -0.44650426506996155, -0.28681156039237976, 0.12782083451747894, 0.08587035536766052, -0.05671258270740509, -0.1388980895280838, -0.15698394179344177, -0.37331879138946533, -0.07128170132637024, 0.670111358165741, 0.3172101080417633, 0.4237835705280304, -0.36558619141578674, -0.08972418308258057, 0.3477570116519928, -0.14835122227668762, 0.3322494924068451, -1.324841856956482, 0.004634624347090721, -0.9786655902862549, -1.5184872150421143, -0.3245868384838104, 0.08940604329109192, -0.4399784505367279, 0.29384252429008484, -1.3605445623397827, 0.4292851984500885, 0.4722748398780823, -0.49054914712905884, 0.08970045298337936, -0.3775502145290375, -0.0772232711315155, -0.41498658061027527, -0.0032671999651938677, 0.421713262796402, -0.15808960795402527, 0.5575798153877258, 0.6170282363891602, -0.24063080549240112, -0.3126358389854431, -0.3131111264228821, -0.05653630942106247, -0.22159075736999512, -0.028481807559728622, -0.8336135149002075, 0.2764241695404053, -0.16657575964927673, -0.15656019747257233, 0.5369503498077393, -0.30196353793144226, -0.17585483193397522, 0.17258000373840332, 0.4939434826374054, -0.2813207805156708, -0.01285531185567379, 0.2765209674835205, 0.10726428031921387, 0.44358670711517334, 0.09488030523061752, -0.576724648475647, 0.7661577463150024, -0.3475249111652374, 0.12773087620735168, -0.34229445457458496, 0.19984731078147888, -0.11530386656522751, -0.7375746965408325, 0.23869813978672028, -0.10899991542100906, 0.27042075991630554, -0.025644725188612938, -0.4040932059288025, -0.008853111416101456, -0.5203161835670471, 0.3645613491535187, 0.08144722133874893, -0.05686429515480995, -0.34113723039627075, 0.178863063454628, -0.07513519376516342, 0.026242069900035858, 0.5819026827812195, -0.14897707104682922, -0.29605698585510254, -0.3467352092266083, -0.4370492100715637, 0.3178873360157013, -0.06524531543254852, 0.06696785241365433, -0.34274375438690186, 0.22168894112110138, 0.21364019811153412, -0.10576343536376953, 0.05710207670927048, 0.025815078988671303, 0.12471762299537659, 0.16396719217300415, -0.1264636367559433, 0.20068448781967163, -0.2845113277435303, 0.3074965476989746, -0.35859251022338867, -0.5125642418861389, 0.45754361152648926, -0.0910540372133255, -0.2598266005516052, -0.356854110956192, -0.11263370513916016, -0.8789428472518921, 0.3637372851371765, 0.17348726093769073, 0.06537081301212311, 0.23388521373271942, -0.07210876047611237, -0.12090937048196793, 0.348450630903244, 0.33936169743537903, -0.2267926037311554, -0.09572933614253998, 0.43533217906951904, 0.20471757650375366, 0.1216806024312973, -0.10754192620515823, 0.1003592386841774, -0.1152789443731308, 0.19090162217617035, -0.07932738959789276, -0.31845584511756897, 0.09758643060922623, -0.3275628685951233, 0.17101243138313293, 0.4115716814994812, -0.0877421498298645, 0.8441833257675171, -0.09403280168771744, 0.182186558842659, 0.10310341417789459, -0.48000219464302063, -0.06710997968912125, 0.10121341049671173, -0.1716640442609787, 0.022620484232902527, -0.6401546597480774, 0.08500727266073227, 0.053618527948856354, 0.1162501722574234, -0.02768363431096077, 0.15507444739341736, 0.031395960599184036, 0.10447205603122711, 0.3799191117286682, 0.3609740436077118, -0.17326810956001282, -0.24775353074073792, 0.06934120506048203, -0.15995550155639648, -0.7140730619430542, 0.7983125448226929, 0.31597471237182617, -0.26203322410583496, -0.06595509499311447, 0.24411597847938538, -0.5325235724449158, 0.21516557037830353, 0.34792542457580566, 0.5435164570808411, 0.2869121730327606, 0.32668033242225647, 0.10220414400100708, -0.4799027740955353, -0.24552485346794128, -0.15758630633354187, -0.04370056465268135, -0.18034353852272034, -0.3149232566356659, -0.024952450767159462, -0.44691014289855957, 0.02027387171983719, 0.4554581940174103, 0.17535226047039032, 0.20912222564220428, 0.0007389413076452911, 0.10515515506267548, 0.1453598141670227, -0.029870476573705673, 0.4221774637699127, 0.026877637952566147, -0.2819870114326477, 0.3283456861972809, 0.3335394263267517, 0.4241270422935486, 0.056866779923439026, -0.6769845485687256, 0.1016392931342125, -0.12976056337356567, 0.02088562771677971, 0.3090929687023163, -0.20671769976615906, -0.46712133288383484, -0.1795196235179901, 0.3773617148399353, 0.23269107937812805, 0.2691318094730377, 0.060295697301626205, 0.30133727192878723, -1.117782473564148, -0.21418388187885284, -0.10364453494548798, 0.32957810163497925, -0.38425877690315247, 0.06795112788677216, 0.5689854025840759, -0.16495077311992645, -0.20204555988311768, -0.19867157936096191, -0.41088545322418213, -0.24265550076961517, 0.2279403954744339, 0.05491660535335541, 0.19270455837249756, 0.7042691111564636, -0.31346991658210754, 0.3402929902076721, 0.41353604197502136, 0.5099238157272339, -0.17327962815761566, -0.2364877611398697, -0.32810717821121216, 0.541401207447052, -0.08936522156000137, -0.16885565221309662, -0.27002498507499695, -0.2453155815601349, -0.04801775515079498, -0.46377110481262207, -0.10023597627878189, -0.22218401730060577, 0.14575915038585663, 0.4504011571407318, 0.03215143457055092, -0.22282575070858002, 0.11119875311851501, 0.4470960199832916, 0.49277031421661377, 0.13945898413658142, 0.031788237392902374, -0.4758366048336029, 0.14269214868545532, 0.18677042424678802, -0.037184420973062515, -0.30260470509529114, -0.1184815838932991, -0.41666755080223083, -0.07573617249727249, -0.10654143244028091, -0.1512901782989502, -0.24205905199050903, 0.2171204388141632, 0.4044593274593353, 0.27450311183929443, -0.184629425406456, 0.13833735883235931, -0.40713638067245483, -0.5400933027267456, -0.05483218654990196, 0.5050527453422546, -0.7750316262245178, -0.28276294469833374, -0.09135687351226807, -0.08851833641529083, 0.3288375735282898, -0.7900128960609436, 0.3510628640651703, -0.05379839614033699, 0.46304357051849365, 0.05999132618308067, -0.12285055965185165, 0.37751105427742004, 0.051420312374830246, -0.532278835773468, 0.012016605585813522, 0.12889088690280914, -0.3864072263240814, 0.03184617683291435, 0.25433558225631714, 0.29248642921447754, -0.09221974015235901, -0.1300959438085556, -0.01671236753463745, -0.852202832698822, -0.2589152455329895, 0.5035080313682556, -0.041942838579416275, 0.07605911791324615, -0.11672741174697876, 0.0025945885572582483, 0.1452856957912445, 0.4725205898284912, -0.15706783533096313, 0.15772345662117004, -0.16991399228572845, -0.2627490162849426, 0.5771360397338867, -0.1396506279706955, 0.0279572494328022, -0.13307657837867737, -0.18325942754745483, -0.22038881480693817, 0.04792843386530876, 0.34079501032829285, 0.24307671189308167, -0.10671847313642502, 0.04318131506443024, -0.317667692899704, 0.21346764266490936, -0.47729066014289856, -0.10014659911394119, 0.17258484661579132, -0.21103397011756897, 0.269476056098938, -0.05225544795393944, 0.1462809443473816, 0.10766211897134781, 0.1682640165090561, -0.3801594078540802, -0.9995371103286743, 0.4021974205970764, -0.16631068289279938, 0.17051814496517181], "bias_tensor": [-0.1280946582555771, 0.12941446900367737, 0.07633387297391891, -0.03260428085923195, 0.3954553008079529, 0.1589200794696808, 0.3117307424545288, 0.34308457374572754, -0.04058346524834633, 0.07791882753372192, -0.44706788659095764, 0.06986486911773682, -0.49830836057662964, -0.34445804357528687, 0.42471036314964294, 0.544971764087677, 0.11839863657951355, -0.028693635016679764, -0.23619243502616882, -0.0489344447851181, 0.2762068808078766, 0.3958256244659424, -0.43235549330711365, -0.42663735151290894]}}}, "inbound_nodes": [[["td_dense0", 0, 0, {}]]]}, {"name": "td_dense2", "class_name": "TimeDistributed", "config": {"name": "td_dense2", "layer": {"class_name": "Dense", "config": {"name": "dense_3", "units": 24, "activation": "relu", "use_bias": true, "kernel_tensor": [-0.03475518897175789, 0.23832109570503235, -0.2563950717449188, 0.06401616334915161, -0.34138232469558716, 0.025390878319740295, -0.17000211775302887, -0.03677834942936897, -0.34669792652130127, 0.3447733223438263, -0.41971996426582336, -0.3065182566642761, 0.2858516275882721, -0.42573168873786926, -0.013345019891858101, 0.040006548166275024, -0.44790422916412354, -0.23856349289417267, 0.03676589950919151, 0.38483911752700806, 0.03467591479420662, 0.3921056091785431, 0.16288180649280548, 0.09156788885593414, 1.090230941772461, 0.32096320390701294, -1.0989470481872559, -0.8313186764717102, 0.013095716945827007, -0.03950358182191849, -0.3476460576057434, -0.47533512115478516, 0.5201608538627625, -0.1642901599407196, -0.015592883341014385, 0.5720504522323608, -0.0946703627705574, 0.13118022680282593, -0.4913339912891388, 0.15835411846637726, 0.10891229659318924, -0.36686575412750244, 0.2890528738498688, -0.26750585436820984, 0.08356298506259918, -0.4049340486526489, 0.03898470848798752, 0.04731316864490509, 0.2192019373178482, 0.12600089609622955, -0.2401605248451233, -0.11013001948595047, -0.31394168734550476, 1.0426775217056274, 0.15661273896694183, 0.19953198730945587, 0.10856419801712036, 0.4991697669029236, -0.23085713386535645, 0.2909049093723297, -0.12486298382282257, -0.259930282831192, -0.24242562055587769, -0.11661761999130249, -0.3723677396774292, 0.14926664531230927, 0.1594635248184204, -0.37218788266181946, 0.12240965664386749, 0.19984418153762817, 0.11838285624980927, -0.030765274539589882, 0.262146532535553, -0.19983084499835968, 0.4737439751625061, 0.5720745921134949, 0.010091754607856274, 0.5605267286300659, 0.44986486434936523, -0.3461987376213074, -0.041385337710380554, 0.43988049030303955, -0.2598418593406677, -0.26575616002082825, 0.016274521127343178, 0.39683017134666443, 0.2777199447154999, 0.2977578341960907, 0.19101497530937195, 0.23139351606369019, -0.2037457972764969, -0.28765055537223816, 0.03955767676234245, 0.06840785592794418, 0.23821885883808136, -0.5979508757591248, -0.007569645065814257, 0.2333003729581833, -0.17838360369205475, -0.42838969826698303, 0.01794656366109848, -0.10292717814445496, 0.01948937401175499, -0.25585561990737915, 0.029513251036405563, 0.21856045722961426, -0.4556612968444824, 0.4779839813709259, 0.12418339401483536, -0.05324602872133255, 0.2081221044063568, -0.34905821084976196, -0.4840552508831024, 0.16933970153331757, -0.08276543021202087, 0.6063263416290283, 0.3240070641040802, -0.28990042209625244, -0.10047339648008347, 0.20943132042884827, 0.20439626276493073, 0.24099598824977875, -0.17870627343654633, -0.17923912405967712, 0.0755845457315445, -0.8885223269462585, -0.33386752009391785, -0.030625537037849426, 0.792386531829834, 0.585475504398346, -0.1565721184015274, 0.04725104197859764, 0.08064618706703186, -0.03017769753932953, 0.3545707166194916, -0.446936696767807, -0.15229853987693787, 0.22286057472229004, 0.20109745860099792, 0.15786603093147278, 0.12876415252685547, -1.3963630199432373, 0.05547569692134857, 0.20233488082885742, -0.6238107085227966, -0.10730729252099991, -0.7113508582115173, 0.030262716114521027, -0.0979391559958458, -0.23301444947719574, 0.27704498171806335, -0.11694023013114929, -0.01674598827958107, 0.07977964729070663, 0.1751471608877182, -0.4110031723976135, 0.242596834897995, 0.3247154653072357, 0.2538165748119354, -0.39239996671676636, -0.06309028714895248, -0.10073588788509369, 0.3830263614654541, 0.5304221510887146, 0.26049190759658813, -0.21358941495418549, -0.00225916039198637, 0.5026044845581055, -0.3241797089576721, 0.34288281202316284, -0.11107662320137024, 0.16667629778385162, 0.25321608781814575, 0.4454852044582367, -0.07461928576231003, 0.19345435500144958, -0.08660639822483063, -0.19948795437812805, -0.18406182527542114, 0.08293973654508591, -0.26538705825805664, -0.16559532284736633, 0.1962214708328247, 0.27972400188446045, 0.05141349881887436, -0.12100136280059814, 0.10373397171497345, -0.19821178913116455, 0.009557998739182949, 0.33929476141929626, -0.358242005109787, 0.20117688179016113, 0.09155107289552689, 0.3815886974334717, -0.26681166887283325, -0.7252874970436096, -0.04621605575084686, -0.03895054757595062, 0.20295380055904388, -0.6609784960746765, -0.20953480899333954, 0.0767650306224823, 0.14969764649868011, 0.11166945099830627, 0.10635393112897873, 0.10760053247213364, 0.04900915548205376, 0.15050286054611206, -0.4696333408355713, -0.3989029824733734, -0.1768016368150711, -0.253195196390152, -0.03290150314569473, 0.06074982509016991, 0.1308814287185669, -0.027023393660783768, 0.22105486690998077, -0.3680146038532257, 0.14434228837490082, -0.25593724846839905, -0.21044586598873138, 0.9628329873085022, -0.29916462302207947, 0.518968403339386, -0.09988763928413391, 0.8068939447402954, 0.2559235990047455, 0.2693903148174286, 0.0469408743083477, -1.336108684539795, 0.24930787086486816, 0.05002591758966446, 0.36926034092903137, -0.09687452018260956, -0.5144361257553101, -0.017828205600380898, -0.08378628641366959, -0.9858520030975342, 0.03476197272539139, -0.6302396059036255, -0.019024193286895752, -1.3500868082046509, -0.3854568600654602, -1.0695185661315918, -0.7685624361038208, -0.3163701891899109, -0.31822729110717773, -0.5239139199256897, 0.24434414505958557, 0.11555146425962448, 0.539428174495697, 0.17844437062740326, 0.46332982182502747, 0.5721601247787476, -0.7084614634513855, -0.6588515043258667, 0.10365864634513855, -0.05115605145692825, 0.05279673635959625, 0.08721820265054703, 0.012211505323648453, -0.22591523826122284, 0.7522192597389221, 0.036420706659555435, 0.07637960463762283, -0.9269714951515198, -0.02313202992081642, -0.006222532130777836, -0.2616875171661377, -0.22842420637607574, -0.3244190514087677, -0.45163029432296753, -0.10353223234415054, 0.35907867550849915, 0.5206360816955566, 0.2536182105541229, 0.3402614891529083, 0.47006499767303467, -0.07506107538938522, -0.04423115774989128, -0.5070376396179199, 0.37064501643180847, -0.2973989248275757, 0.019303472712635994, -0.5494555830955505, 0.32483986020088196, -0.007334374822676182, -0.15183125436306, -0.21280577778816223, -0.33677375316619873, 0.006250210106372833, -0.3652251362800598, 0.2034977525472641, 0.5371857285499573, -0.06438793987035751, 0.23652639985084534, -0.18382114171981812, -0.18872866034507751, 0.35594597458839417, 0.020924493670463562, -0.4423864483833313, -0.12225861102342606, 0.1971786469221115, 0.062314677983522415, 0.36401858925819397, 0.48886439204216003, -0.13130445778369904, -0.5237350463867188, -0.7129438519477844, -0.36211758852005005, -0.1912725865840912, -0.3665085732936859, 0.49425771832466125, -0.3674217760562897, 0.31272587180137634, -0.5311812162399292, -0.0690607875585556, 0.8870022296905518, 0.392549067735672, 0.34437787532806396, -0.35818055272102356, -0.6525142192840576, 0.03910451754927635, 0.2925867438316345, -0.13164499402046204, -0.5196630358695984, -0.5338153839111328, 0.21351855993270874, 0.20786766707897186, -0.36507031321525574, -0.3153112828731537, -0.11582724004983902, -0.3132050335407257, 0.17640654742717743, -0.2926403880119324, -1.492190957069397, -0.17176853120326996, 0.5445963740348816, 0.4699418544769287, 0.23998844623565674, 0.15148717164993286, 0.13773667812347412, 0.05251489579677582, -0.6407456398010254, 0.2889840602874756, -0.018631745129823685, -0.2764257788658142, -0.8288120627403259, 0.0022682547569274902, 0.6516766548156738, -0.22686977684497833, 0.3006962537765503, -1.0128546953201294, -0.4241809546947479, -0.5884321928024292, 0.11147753149271011, 0.40501853823661804, -0.08282320946455002, -0.6771141886711121, 0.5892080664634705, -0.12885916233062744, 0.07436282187700272, -0.167872816324234, 0.09228856861591339, -0.41951534152030945, -1.0685012340545654, 0.6851417422294617, 0.608627438545227, 0.07258578389883041, -0.028717508539557457, -0.8215086460113525, 0.26552969217300415, 0.6900724768638611, -0.7764714956283569, 0.02289552241563797, -0.8859849572181702, 0.22251878678798676, 0.3915994465351105, -0.2989034056663513, 0.24658095836639404, -0.5056391954421997, -0.2326192855834961, -0.017686262726783752, -1.4282857179641724, -0.1827424168586731, -0.19832412898540497, -0.00245998939499259, -0.16226977109909058, 0.21719393134117126, 0.07899603247642517, -0.21135114133358002, 0.32779619097709656, -0.45998531579971313, 0.4428442120552063, -0.004147808533161879, -0.4110012948513031, -0.07183168828487396, -0.174046128988266, 0.15612737834453583, -0.008010158315300941, -0.4378668963909149, -0.3829602301120758, -0.1849370300769806, -0.06150214374065399, 0.24192188680171967, 0.07648961991071701, -0.6348522305488586, 0.17005543410778046, -0.27956801652908325, -0.18993660807609558, -0.2155877947807312, -1.3365904092788696, -0.24320782721042633, -0.47526323795318604, 0.006634560413658619, -1.278943419456482, 0.47677165269851685, -2.1705446243286133, -0.16682112216949463, -0.6947498917579651, 0.30082640051841736, -0.13274408876895905, -0.2406081259250641, 0.3737811744213104, -0.6610892415046692, -0.3209991157054901, 0.10779895633459091, -1.2237666845321655, 0.26248544454574585, -0.03305784985423088, 0.7507562041282654, -0.8519355654716492, 0.15899282693862915, -1.2264193296432495, -0.12221659719944, -0.9245316386222839, 0.19949407875537872, 0.6268589496612549, 0.2834842801094055, 0.5532938838005066, 0.19289690256118774, -1.3104456663131714, -0.4379887878894806, 0.53852778673172, -0.4576842784881592, -0.3446085453033447, -0.35027793049812317, -0.27335894107818604, -0.01912059634923935, -0.0076284585520625114, 0.9020999670028687, -0.22871463000774384, 0.09957454353570938, 0.31091544032096863, 0.08611505478620529, 0.3435225486755371, -0.6537472009658813, 0.4652364253997803, -0.06059639900922775, -0.6434712409973145, 0.4502823054790497, 0.0435839481651783, 0.5183828473091125, 0.16245362162590027, 0.05035199224948883, 0.19614437222480774, -0.18494009971618652, 0.29843729734420776, -0.14707966148853302, -0.1823698729276657, -0.08114535361528397, -0.2916712164878845, -0.23029176890850067, -0.15846538543701172, 0.044675808399915695, 0.29878950119018555, 0.30814629793167114, -1.618634581565857, -0.32355257868766785, -0.15491612255573273, 0.3982905149459839, -0.5551661252975464, -0.3087671995162964, -0.5825795531272888, -0.06320477277040482, 0.1275840848684311, -0.8185743093490601, -2.3316168785095215, 0.30419930815696716, -0.34509825706481934, 0.3665147125720978, -1.9777178764343262, -0.01514959055930376, -0.19497257471084595, -0.24954631924629211, -0.1486314833164215, 0.5842701196670532, 0.08039070665836334, 0.4095900356769562, -0.5775542259216309, -0.5181939601898193, 0.2825506925582886, 0.26372766494750977, 0.27115631103515625, -0.12190665304660797, -0.6506401896476746, -0.19545625150203705, -0.13597798347473145, 0.22926044464111328, -0.6454511880874634, -0.02883661352097988, -0.18090353906154633, 0.5374122858047485, -0.20108456909656525, 0.2743261158466339, 0.6813359260559082, 0.2783691883087158, 0.4732050597667694, 0.19383391737937927, -0.44682589173316956, -0.34559687972068787, 0.5266023278236389, 0.35666364431381226, -0.6257635354995728, 0.32463619112968445, -0.3381492793560028, 0.35608574748039246, 0.27409955859184265, -0.16994811594486237, -0.5770521759986877, -0.46059226989746094, -0.39375317096710205, -1.067872405052185, 0.39295366406440735, 0.40012380480766296, 0.30666762590408325, 0.40182194113731384, -0.39070209860801697, -0.2880935072898865, 0.4003736674785614, 0.37128782272338867, 0.24546073377132416, -0.46060293912887573, -0.37276139855384827, -0.5349327325820923, -0.16266104578971863, -0.018507210537791252, -0.88442063331604, -0.49597957730293274, -0.03926275670528412, -0.39224377274513245, -0.3184853196144104, -0.11661162972450256, -0.746635913848877, -0.07276208698749542, 0.12131011486053467, -0.43125948309898376, -0.6439310908317566, -0.482509970664978, -0.30048850178718567, 0.20540091395378113, 0.48140522837638855, 0.25312188267707825, -0.7812675833702087, 0.3299746513366699, -0.20220598578453064, -0.49085599184036255, -0.17687389254570007, -0.051678989082574844, -0.29920610785484314, 0.22381070256233215, 0.40220069885253906, -0.09906518459320068, 0.41761207580566406, 0.13898104429244995, 0.28676265478134155], "bias_tensor": [-0.19609786570072174, -0.2507382929325104, 0.3260853886604309, 0.5003888010978699, 0.199480801820755, 0.30024397373199463, -0.13732607662677765, 0.47723355889320374, 0.6811648607254028, 0.029142681509256363, -0.10745180398225784, -0.1238054484128952, 0.4484442472457886, 0.4382978081703186, 0.12249933183193207, -0.04233601689338684, 0.7306901812553406, 0.049033649265766144, 0.4608895480632782, 0.29375848174095154, -0.11840767413377762, -0.19470514357089996, -0.14128991961479187, -0.126304492354393]}}}, "inbound_nodes": [[["td_dense1", 0, 0, {}]]]}, {"name": "noseq_gru", "class_name": "GRU", "config": {"name": "noseq_gru", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 48, "activation": "relu", "recurrent_activation": "hard_sigmoid", "use_bias": true, "reset_after": false, "Wz": [-0.5277990102767944, 0.3383448123931885, 0.16193552315235138, 0.4106857478618622, -0.0250643752515316, 0.6360613703727722, -0.14365583658218384, 0.1475657969713211, 0.6765173673629761, -0.29604434967041016, -0.9879853129386902, -0.12658211588859558, 1.153863787651062, 0.0005067987949587405, 0.30052462220191956, -0.3790595233440399, 0.21959109604358673, -1.1129146814346313, 0.17334242165088654, 1.1236454248428345, -0.5123043060302734, -0.2303958237171173, 0.10376261919736862, -0.33094558119773865, -0.3171371519565582, 1.3219441175460815, 0.20925521850585938, 0.46704524755477905, 0.1224924772977829, 0.2292587012052536, 0.10564365983009338, 0.1536739468574524, 0.4454486668109894, 1.138390302658081, -0.8263224959373474, -1.1041043996810913, -0.14012746512889862, 0.4954622685909271, 0.006384524051100016, 0.5458888411521912, 0.17789331078529358, 0.11760812252759933, -0.2977772057056427, 0.46832865476608276, -1.1158663034439087, -0.2321970909833908, 0.1758781522512436, -0.1549696922302246, -0.19197534024715424, -0.06670570373535156, 0.04878214746713638, -0.11913333833217621, -0.18081505596637726, -0.09937426447868347, -0.12193572521209717, 0.15995000302791595, -0.030150964856147766, 0.00405133469030261, -0.0865933895111084, -0.06128061190247536, 0.08729083836078644, 0.12440497428178787, -0.2170996069908142, -0.178414985537529, 0.12154019623994827, 0.16055959463119507, -0.022998804226517677, 0.11564293503761292, 0.1904861181974411, -0.049033023416996, 0.16546152532100677, -0.08947564661502838, 0.6440474987030029, 0.8116685748100281, 0.3081310987472534, -0.01573014073073864, 0.7534709572792053, 0.5081971883773804, -0.46235865354537964, -0.00269357580691576, 0.21524377167224884, 0.26311227679252625, -0.309839129447937, 0.05686972290277481, 0.34155648946762085, 0.2433062642812729, 0.40596047043800354, 1.0064520835876465, 0.5612180233001709, -0.9755825400352478, -0.17400260269641876, 0.599416196346283, -0.7773616909980774, -0.8812938928604126, 0.17579352855682373, 0.8930909633636475, -0.014603340066969395, 0.11808936297893524, 0.2815227508544922, 0.40375566482543945, -0.25692567229270935, -0.06522253900766373, -0.14767606556415558, 0.27774882316589355, -0.052980877459049225, 0.9103416204452515, 0.2275068163871765, -0.5586143732070923, 0.14093589782714844, 0.8690863251686096, 0.40329423546791077, 1.042728066444397, 0.6520848274230957, 0.5343106389045715, 0.27385321259498596, 0.38545727729797363, -0.15912389755249023, -0.23060929775238037, -0.02879563346505165, -0.41131043434143066, 0.443285197019577, 0.43655145168304443, 0.5872454643249512, 0.35969310998916626, 0.1047312542796135, 0.20535443723201752, -0.2809361219406128, 0.6714997887611389, 0.2276189923286438, 1.2897260189056396, -0.5422900319099426, -0.6623812913894653, -0.00699281133711338, 0.46207916736602783, 1.491505742073059, 0.24241410195827484, 0.49570074677467346, -0.37219172716140747, -0.0631500706076622, 0.3343569338321686, -0.4224764108657837, -0.3015529215335846, -0.6349668502807617, -1.1790766716003418, -0.19232860207557678, 0.3371392488479614, 0.0589786022901535, 0.34223222732543945, 0.2961585223674774, 0.22247441112995148, 0.027279753237962723, 0.6015653610229492, 0.40219584107398987, 0.19527506828308105, -1.4038290977478027, 0.05812659114599228, 0.4322740435600281, 1.7064634561538696, -0.02420426346361637, -0.01468718983232975, 0.0008987243636511266, 1.9423574209213257, 0.2719477117061615, 0.8914377689361572, 0.14899477362632751, -0.10376318544149399, 0.4862031042575836, -0.2417324334383011, -0.7839870452880859, 0.07055311650037766, 0.10291124880313873, 0.30356940627098083, 0.09228024631738663, 0.0953015387058258, 0.034825343638658524, 0.05356166511774063, 0.511376678943634, 0.42507970333099365, 0.5910961031913757, 1.6021630764007568, 0.8760557770729065, 0.27849310636520386, 0.22532320022583008, -0.126852348446846, -0.15031751990318298, -0.08189278095960617, 0.7007486820220947, -0.0008585763862356544, 0.4316539466381073, 0.24086645245552063, -0.7950676083564758, -0.9830663800239563, -0.5412611961364746, -0.3401084542274475, 0.26420658826828003, 0.5116432309150696, 0.0033784108236432076, 0.5952876210212708, -0.04637347534298897, 0.3384048342704773, 0.8589442372322083, 0.34098297357559204, -1.2579381465911865, 0.16314516961574554, 0.5570387244224548, -0.08025538921356201, 0.002936498261988163, -0.11972356587648392, 0.10744114965200424, 0.6795392036437988, 0.5529524087905884, 1.0685948133468628, -0.22292202711105347, -0.1990073174238205, 0.20753324031829834, -0.004090394824743271, -0.27855515480041504, 0.3061409890651703, 0.23703472316265106, 0.48408886790275574, 0.02582293190062046, -0.5970604419708252, 0.03274708613753319, 0.0036861731205135584, 0.5143937468528748, 0.4841513931751251, -0.12541882693767548, 0.24402301013469696, 0.4271445870399475, 0.667945921421051, -0.011170018464326859, -0.018620552495121956, -0.203773632645607, 0.03148689121007919, -0.10994897782802582, -0.3004666864871979, 0.36467015743255615, -0.16864952445030212, -0.42284610867500305, -0.024729235097765923, 0.25473886728286743, -0.015805773437023163, 0.2210802435874939, 0.3176237940788269, 0.14338316023349762, -0.3593049943447113, -0.890150249004364, 0.6090840697288513, 0.1183294877409935, 0.5394573211669922, 0.1810685694217682, -0.17247936129570007, -0.2070084512233734, 0.5380300879478455, 0.09980104118585587, -0.6565977334976196, 0.6455937623977661, 0.10038071870803833, -0.059951864182949066, 0.3130807876586914, -0.019816076382994652, -0.9204756021499634, -0.14358313381671906, -0.13358096778392792, 0.9075245261192322, 0.4886789917945862, -0.10416537523269653, 0.32449576258659363, -1.3985106945037842, -0.7761104106903076, -0.39145994186401367, 0.07061371952295303, 0.5885055661201477, 0.0887429267168045, -1.5086811780929565, -0.12748681008815765, 0.59245365858078, 0.12397178262472153, 0.07221899181604385, -0.5139997601509094, 0.1835469901561737, -0.4461348056793213, 0.4661053419113159, -0.07464371621608734, -0.7494739294052124, 0.256882905960083, -0.25373703241348267, 0.3041950464248657, -0.416822612285614, 0.042227067053318024, 0.007007933687418699, 0.4290814697742462, -0.08507023751735687, -0.617476761341095, -0.42095711827278137, 0.263461172580719, 0.3395947813987732, 1.2237621545791626, -0.035896312445402145, -0.020941540598869324, 0.3670770525932312, 0.4535532593727112, 0.36633506417274475, 0.16977407038211823, -0.27276211977005005, 0.36062315106391907, -0.30575788021087646, 0.05179235339164734, 2.3443543910980225, -1.9853237867355347, -0.44431883096694946, -0.051176365464925766, 0.48608461022377014, 0.4861208200454712, 0.48649919033050537, 0.5170995593070984, 0.5089192390441895, -1.1396777629852295, -0.2478341907262802, 0.5795291662216187, 0.31922322511672974, 0.4702637195587158, -0.04616978392004967, -0.020450398325920105, 0.2787612974643707, 0.04476281255483627, 0.05677364021539688, -1.54411780834198, 0.637442409992218, -0.3178051710128784, -0.41147398948669434, 0.5321645736694336, -0.19503530859947205, -0.98695969581604, -0.4029752016067505, -0.008381601423025131, -0.2132996916770935, 0.2122090458869934, 0.12645304203033447, 0.026756376028060913, -0.06203096732497215, -0.2988807260990143, -0.11148414760828018, -0.2331618070602417, 0.1071106567978859, -0.23211807012557983, -0.19849331676959991, 0.028776519000530243, 0.11103692650794983, 0.11632820963859558, -0.26497215032577515, 0.049678996205329895, -0.3029862940311432, 0.10906974971294403, -0.07812491059303284, -0.24015825986862183, -0.19814719259738922, -0.09026312828063965, -0.09146403521299362, -0.0476200208067894, 0.6665560603141785, 0.26019376516342163, 0.3415904939174652, 0.2809343636035919, 0.22697412967681885, -0.24866007268428802, -0.8945523500442505, 0.5207380652427673, 0.051639508455991745, 0.3898922801017761, 0.03434716537594795, -0.3574787676334381, 0.268128901720047, 0.5445114374160767, 0.5173125267028809, -0.2607486844062805, 0.5807267427444458, 0.08927973359823227, 0.08667347580194473, 0.41925373673439026, -0.23975518345832825, -0.591230571269989, 0.7124948501586914, 0.04882205277681351, -0.7448266744613647, -0.09382745623588562, -0.5584057569503784, -0.8563432693481445, -0.24515287578105927, 0.020115310326218605, -0.256584107875824, -0.5268445611000061, -1.0549592971801758, -0.4058176577091217, 0.2668243944644928, -0.035146068781614304, 0.05071669816970825, -0.2898167073726654, -0.7593769431114197, -0.09938463568687439, -0.34267741441726685, 0.18346519768238068, 0.47997012734413147, -1.206664800643921, 0.5025603771209717, 0.7314367294311523, 0.1949365884065628, -0.1754300594329834, -0.10627137869596481, 0.2298366278409958, -0.020911330357193947, 0.16097287833690643, 0.34761711955070496, 0.26118162274360657, 1.4822155237197876, -0.18453189730644226, 0.181369349360466, -0.06127133592963219, -0.016350157558918, -0.021870823577046394, 0.12094005942344666, 0.050595346838235855, 0.2181958556175232, 1.1717958450317383, 0.2424909919500351, -0.43886277079582214, 0.5364923477172852, 0.029718756675720215, 0.2853141129016876, 1.6787339448928833, 0.008573017083108425, 0.6738889217376709, 0.4335170090198517, 0.42427170276641846, -0.040787067264318466, 0.08499220758676529, -0.17520058155059814, -0.04911379516124725, -0.44504687190055847, 0.43787682056427, 0.39423346519470215, -0.36284124851226807, 0.2645191550254822, 0.3760954439640045, 0.4687337875366211, 0.5195916891098022, 0.40329235792160034, 0.19490861892700195, 0.28458085656166077, 0.4588630497455597, 1.5881866216659546, -0.22628818452358246, 0.5356023907661438, 0.7206286191940308, -0.2806520164012909, 2.070711374282837, 1.6178648471832275, -0.1880744993686676, 0.555747926235199, 0.45708104968070984, 0.05551736429333687, 0.08795074373483658, -0.20033994317054749, 0.5060911774635315, 0.5863443613052368, 0.7383901476860046, -1.136909008026123, -0.3769383132457733, 0.3131103813648224, 0.11312182992696762, 0.020486997440457344, 0.3657934069633484, 0.19391673803329468, 0.9368740916252136, -0.1485971361398697, 0.28354787826538086, -0.9217758774757385, 0.13344359397888184, 0.020374897867441177, -0.3175543248653412, 0.10064846277236938, 0.4634106755256653, 0.561620831489563, 0.4473441243171692, 1.5157207250595093, 0.14895212650299072, -0.6143150329589844, 0.6335145831108093, 0.2973642349243164, 0.11506498605012894, -0.23293812572956085, -0.058317773044109344, 0.08885636180639267, -0.1576092690229416, 0.11058776080608368, 0.33801504969596863, 0.18211250007152557, 0.4286644160747528, -0.17545393109321594, 0.14935044944286346, -0.00820584874600172, -0.04159589111804962, 0.31565582752227783, -0.03516131639480591, 0.2847956120967865, 0.16254977881908417, -0.19624897837638855, -0.037677984684705734, -0.016805553808808327, -0.061373140662908554, -0.7399697303771973, 0.39957794547080994, 0.2118816077709198, 0.7783733606338501, 0.16481055319309235, -0.2559015452861786, 0.27013900876045227, 0.5435826778411865, 0.750825822353363, 0.3294323682785034, 0.8095813989639282, 0.5523131489753723, 0.5465070605278015, 0.38331130146980286, -0.4659484326839447, -0.7432617545127869, -0.28505635261535645, -0.8015626072883606, -0.09303323179483414, 0.21126675605773926, 0.7190525531768799, 0.28471100330352783, 0.011002223007380962, 0.16089865565299988, -0.18297375738620758, 0.319553941488266, 0.48480483889579773, 0.4607720375061035, -0.9493380188941956, 0.2186381220817566, 